[{"summary":"<b>Debate: NAP is flawed and unnecessary [SOHO Forum]</b> David Friedman, Gene Epstein, Dennis Pratt [Pav]","description":"For Whom: Lovers of the age-old libertarian debate between libertarian consequentialists and ethicists\nDescription: Resolution:\nThe right way to persuade people of libertarianism is by showing them that its outcomes are superior by their standards, without any resort to the flawed non-agression principle (NAP).\nAffirmative: David Friedman, An American economist, legal scholar, and anarcho-capitalist theorist, author of six non-fiction books, many articles and three novels. His most popular book is The Machinery of Freedom: Guide to a Radical Capitalism. <a href=\"www.daviddfriedman.com\"> Website </a>. <a href=\"https://i.imgur.com/beVXLM0.jpg\"> Image </a>\nNegative: Gene Epstein, In 2018. Gene stepped down from a 25-year stint as Economics & Books Editor at Barron's Financial Weekly, where he wrote a widely-followed weekly column called \"Economic Beat.\" Since then, Gene has been actively directing his debate society, www.thesohoforum.org, maintaining an active Twitter account @genesohoforum, writing articles and doing frequent interviews on many libertarian podcasts. . <a href=\"www.thesohoforum.org\"> Website </a>. <a href=\"https://images.squarespace-cdn.com/content/v1/58ac6b92414fb5aa5de25b89/1540759502298-Z8YOG2CTZ4PMJF87R4DR/HeadShot_Square.jpg?format=1000w\"> Image </a>\nModerator: Dennis Pratt, Dennis is the Chef de Village of PorcFest XX 2023. This year's NH's Liberty Activist of the Year and the Keynote Speaker at NH Liberty Forum. He was the number 1 writer on libertarian topics on the competitive intellectual essay site Quora before moving to the Free State 4.5 years ago to become the consummate volunteer to create the Libertarian Homeland, starting liberty clubhouses including the famous SHELL, opening the Independence Inn, leading liberty bus tours, raising hell with the LPNH, and tweeting about liberarian ethics and the Free State. This is his fifth and last year volunteering to lead PorcFest. Catch his daily talks at Libety 101 on libertarianism.. <a href=\"https://twitter.com/DennisPrattFree\"> Website </a>\nWhen: Fri, 12:00P (120m)\nWhere: Pav: Pavillion, Field\nNote: What underlies libertarianism? And what is the best way to explain it to newbies? Two greats go head to head on whether consequentialism or ethics are the proper way to position libertarianism.","location":"Pav","startDatetime":"2023-06-23T16:00:00Z","endDatetime":"2023-06-23T18:00:00Z","timestamp":"2023-04-30T22:11:16Z"},{"summary":"<b>Easier to Convert: Homosexuality OR Libertarianism</b> Jeremy Kauffman, Matt Kibbe, Gene Epstein [Pav]","description":"For Whom: Have you been frustrated with converting people to libertarianism? Perhaps it's because it may harder than converting someone to homosexuality? Kauffman v. Kibbe square off on the recent question: Which is more innate: sexual or political orientation?\nDescription: Resolution:\n\"It would be easier to convert a heterosexual to homosexuality than to convert a non-libertarian to libertarianism\"\nAffirmative: Jeremy Kauffman, Founder and CEO of Lbry and Odyssee, Jeremy is on the Board of the Free State Project. He ran for US Senate from NH, and is himself a free state mover with his wife and children. Jeremy has been failing to convert nonlibertarians to libertarianism for years, but while dating, proved to be surprisingly good at converting heterosexual women to homosexuality.. <a href=\"https://twitter.com/jeremykauffman\"> Website </a>. <a href=\"https://www.findinggeniuspodcast.com/wp-content/uploads/2018/01/podcast-small-image-11-277x200.jpg\"> Image </a>\nNegative: Matt Kibbe, Matthew B. Kibbe is the President of Free the People and of Fight the Power Productions, and host of BlazeTV’s Kibbe on Liberty. He founded FreedomWorks, was senior advisor for a Rand Paul Presidential Super PAC Chief of Staff to U.S. Representative Dan Miller (R-FL), Budget Director for the U.S. Chamber of Commerce, and Senior Economist for the RNC.\n\nAmong other books, he authored, the number 2 New York Times bestseller \"Don’t Hurt People and Don’t Take Their Stuff\". MSNBC’s Keith Olbermann called Kibbe “The second worst person in the world.”\n\nGraduate work in economics at George Mason, a B.A. in economics from Grove City College, Matt is DeadHead and a beer and whiskey connoisseur and apologist. He should be living in the Free State with his awesome wife Terry, and three objectivist cats.. <a href=\"https://freethepeople.org/author/mkibbe/\"> Website </a>. <a href=\"https://en.wikipedia.org/wiki/Matt_Kibbenumber /media/File:Matt_Kibbe_by_Gage_Skidmore_2.jpg\"> Image </a>\nModerator: Gene Epstein, In 2018. Gene stepped down from a 25-year stint as Economics & Books Editor at Barron's Financial Weekly, where he wrote a widely-followed weekly column called \"Economic Beat.\" Since then, Gene has been actively directing his debate society, www.thesohoforum.org, maintaining an active Twitter account @genesohoforum, writing articles and doing frequent interviews on many libertarian podcasts. He is contemplating a second home in the Free State with wife and artists Hisako Kobayashi.. <a href=\"https://www.thesohoforum.org\"> Website </a>. <a href=\"https://images.squarespace-cdn.com/content/v1/58ac6b92414fb5aa5de25b89/1540759502298-Z8YOG2CTZ4PMJF87R4DR/HeadShot_Square.jpg?format=1000w\"> Image </a>\nWhen: Thu, 12:00P (120m)\nWhere: Pav: Pavillion, Field","location":"Pav","startDatetime":"2023-06-22T16:00:00Z","endDatetime":"2023-06-22T18:00:00Z","timestamp":"2023-04-30T22:11:16Z"},{"summary":"<b>Volunteer to Setup PorcFest</b> Constance Spencer [Pav]","description":"For Whom: Any attendees to the Porcupine Freedom Festival who really want to roll up their sleeves and help build freedom. This is a awesome way for newbies to meet people!\nDescription: Volunteer to help your PorcFest volunteers unpack the truck, and set up for the week of festival. The Porcupine Freedom Festival is created by volunteers like you, and you can become one of them! \n. . . Come down to the Pavillion and help us unload, unpack, setup.\n. . . Meet all the movers and shakers of the most successful freedom movement who volunteer to dedicate their time to create actual freedom in an all-too-authoritarian world\nOrganizer: Constance Spencer, Constance is our co-producer for PorcFest XX 2023.  Having volunteered to manage Registration for the last five years, Constance is stepping up this year PorcFest Operations Direct, responsible for all the internal operations of PorcFest (Registration, Free Aid, Facilities, PorcRangers, Inventory, Info, Costs, Rogers relations, etc.)\n. . . When not volunteering to manage the complex operations of the largest freedom festival in the world, Constance is the lead of Independence Realty Group which is a real estate team at Coldwell Banker Realty.\n. . . She is an early mover for the Free State Project moving from Alaska in 2014 with her four children. In Alaska she was learning self-reliance by turning her small acreage home into a homestead through permaculture and raising chickens, ducks, turkeys, and pigs. She was also active in the home birth community and has always allowed her children education freedom which has included homeschooling, trade schools, and charter schools.\n. . . She has also been a real estate investor since her early twenties when she rented her single family home in Ohio and moved to Alaska. She and her partner currently have 13 rental units. Her passion is helping others navigate home ownership and real estate investing. She’s just as comfortable talking about peaceful parenting as she is discussing holding real estate in retirement accounts and sees both as paths to liberty.\n. . . Visit her hub at \"Homeland\" on the field.. <a href=\"https://www.independencerealtynh.com\"> Website </a>. <a href=\"https://i4.moxi.onl/img-pr/a/4600e182-cc2c-4940-b9b8-8c8b30a1ba3d/0_2_full.jpg\"> Image </a>\nWhen: Mon, 1:00P (120m)\nWhere: Pav: Pavillion, Field\nNote: ( We'll need your help packing up as well on Sunday!! )","location":"Pav","startDatetime":"2023-06-19T17:00:00Z","endDatetime":"2023-06-19T19:00:00Z","timestamp":"2023-04-30T22:11:16Z"},{"summary":"<b>Pavilion Tear-down and Pack Up</b> Constance Spencer, Dennis Pratt [Pav]","description":"For Whom: Strong people. Folks who like organizing stuff. Tetras pros. Anyone who has ever moved anywhere.\nDescription: Help your exhausted Porcupine volunteers by lending your hand to pack up our trucks and send us back to our regions in the Free State to continue laying the foundations for the first Free State the world has ever seen. \nOrganizer: Constance Spencer, Constance is our co-producer for PorcFest XX 2023.  Having volunteered to manage Registration for the last five years, Constance is stepping up this year PorcFest Operations Direct, responsible for all the internal operations of PorcFest (Registration, Free Aid, Facilities, PorcRangers, Inventory, Info, Costs, Rogers relations, etc.)\n. . . When not volunteering to manage the complex operations of the largest freedom festival in the world, Constance is the lead of Independence Realty Group which is a real estate team at Coldwell Banker Realty.\n. . . She is an early mover for the Free State Project moving from Alaska in 2014 with her four children. In Alaska she was learning self-reliance by turning her small acreage home into a homestead through permaculture and raising chickens, ducks, turkeys, and pigs. She was also active in the home birth community and has always allowed her children education freedom which has included homeschooling, trade schools, and charter schools.\n. . . She has also been a real estate investor since her early twenties when she rented her single family home in Ohio and moved to Alaska. She and her partner currently have 13 rental units. Her passion is helping others navigate home ownership and real estate investing. She’s just as comfortable talking about peaceful parenting as she is discussing holding real estate in retirement accounts and sees both as paths to liberty.\n. . . Visit her hub at \"Homeland\" on the field.. <a href=\"https://www.independencerealtynh.com\"> Website </a>. <a href=\"https://www.amazon.com/photos/shared/nX5q1bAmRd-wZXaAjuXMOA.4R627B63-BjOzf19edUvRR\"> Image </a>\nChef de Village, PorcFest XX 2023: Dennis Pratt, This is Dennis' fifth and final year volunteering to coordinate PorcFest, and his third year as co-producer/\"Chef de Village\". He is in charge of positioning, events, hubs, speakers, sponsors, marketing, and revenues.\n. . . Dennis reimagined PorcFest in 2020 to align more with our FSP goals to attract liberty lovers to the Free State, and to connect and activate those liberty lovers to build greater liberty.\n. . . Dennis has found refuge in the Free State over the last four and a half years, having suffered decades in authoritarian states. Don't let his galootish looks fool you! Rolling up his sleeves, he has become one of the Free State's most entrepreneurial volunteers, starting up liberty clubhouses (including the famous SHELL), liberty bus tours, liberty events. a liberty inn. In a myriad other ways, he connects liberty lovers together and inspires them to build. He's an ethicist, well known amongst really nerdy circles. You can hear him talk in the Liberty 101 hub, when he's not driving around, with his wife Carol and his pup Ron Paw, making sure everything's copacetic.\n. . . He was this year's NH Liberty Activist of the Year, and the Keynote Speaker for NH Liberty Forum. He's a hugger, so warn him off if he gets too close!. <a href=\"https://twitter.com/DennisPrattFree\"> Website </a>. <a href=\"https://www.nhlibertyforum.com/images/speakers/Dennis_Pratt-e6842a6532f05875e4f99145c8123f14.png\"> Image </a>\nWhen: Sun, 9:00A (120m)\nWhere: Pav: Pavillion, Field\nNote: Volunteers meet every day at 9AM ","location":"Pav","startDatetime":"2023-06-25T13:00:00Z","endDatetime":"2023-06-25T15:00:00Z","timestamp":"2023-04-30T22:11:16Z"},{"summary":"<b>Soapbox Idol</b> Carla Gericke [Pav]","description":"For Whom: Those would enjoy the piss and vinegar of a great anti-authoritarian rant, and those who can deliver it!\nDescription: Bring YOUR best 3-minute rant to be judged by an esteemed panel of celebertarian judges, moderated by Queen Quill herself, Carla Gericke (usually in a compromised condition.)\n. . . Now in its 11th year, don't miss the ultimate crowd favorite SoapBox Idol! Prepare your best 3-minute rant on the topic of your choice. Whatever really bugs you, here is your chance to bitch to -- and convince -- a receptive audience.\n. . . The top Idolers will do their best to impress their passion and insight on the audience and a panel of esteemed judges. Your applause selects the final winner. \nQueen Quill: Carla Gericke, The Queen herself presides over the PorcFest favorite event that she invented and has presided over for more than a decade. Carla is a superb ranter herself - on the House floor, at traffic stops, and in courtrooms - she is looking for new raw talent, as well as inspiring older talent to new heights\nWhen: Sat, 6:00P (150m)\nWhere: Pav: Pavillion, Field\nNote: This event is not suitable for sensitive ears.\nLoud encouragement from the audience is appreciated.\nYou MUST audition (10A at the Queen Quill tent each day) to secure a coveted spot atop the soapbox on Saturday.","location":"Pav","startDatetime":"2023-06-24T22:00:00Z","endDatetime":"2023-06-25T00:30:00Z","timestamp":"2023-04-30T22:11:16Z"},{"summary":"<b>Welcome To PorcFest XX 2023</b> Dennis Pratt, Constance Spencer [Pav]","description":"For Whom: Everyone who has arrived. Come and get oriented meet people, and figure out (or update) your \"Must Dos\" for the week.\nDescription: The opening ceremonies of PorcFest XX 2023, the 20th consecutive Porcupine Freedom Festival, PorcFest XX! Join our Director of Operations and your Chef de Village to celebrate and overview PorcFest XX: Who is here, what are they planning, whom do you want to meet, and what will you be doing this week.\n\nChef de Village: Dennis Pratt, This is Dennis' fifth and final year volunteering to coordinate PorcFest, and his third year as co-producer/\"Chef de Village\". He is in charge of positioning, events, hubs, speakers, sponsors, marketing, and revenues.\n. . . Dennis reimagined PorcFest in 2020 to align more with our FSP goals to attract liberty lovers to the Free State, and to connect and activate those liberty lovers to build greater liberty.\n. . . Dennis has found refuge in the Free State over the last four and a half years, having suffered decades in authoritarian states. Don't let his galootish looks fool you! Rolling up his sleeves, he has become one of the Free State's most entrepreneurial volunteers, starting up liberty clubhouses (including the famous SHELL), liberty bus tours, liberty events. a liberty inn. In a myriad other ways, he connects liberty lovers together and inspires them to build. He's an ethicist, well known amongst really nerdy circles. You can hear him talk in the Liberty 101 hub, when he's not driving around, with his wife Carol and his pup Ron Paw, making sure everything's copacetic.\n. . . He was this year's NH Liberty Activist of the Year, and the Keynote Speaker for NH Liberty Forum. He's a hugger, so warn him off if he gets too close!. <a href=\"https://twitter.com/DennisPrattFree\"> Website </a>. <a href=\"https://www.fsp.org/wp-content/uploads/2019/03/Voluntaryist-Heart-only.jpg\"> Image </a>\nOrganizer: Constance Spencer, Constance is our co-producer for PorcFest XX 2023.  Having volunteered to manage Registration for the last five years, Constance is stepping up this year PorcFest Operations Direct, responsible for all the internal operations of PorcFest (Registration, Free Aid, Facilities, PorcRangers, Inventory, Info, Costs, Rogers relations, etc.)\n. . . When not volunteering to manage the complex operations of the largest freedom festival in the world, Constance is the lead of Independence Realty Group which is a real estate team at Coldwell Banker Realty.\n. . . She is an early mover for the Free State Project moving from Alaska in 2014 with her four children. In Alaska she was learning self-reliance by turning her small acreage home into a homestead through permaculture and raising chickens, ducks, turkeys, and pigs. She was also active in the home birth community and has always allowed her children education freedom which has included homeschooling, trade schools, and charter schools.\n. . . She has also been a real estate investor since her early twenties when she rented her single family home in Ohio and moved to Alaska. She and her partner currently have 13 rental units. Her passion is helping others navigate home ownership and real estate investing. She’s just as comfortable talking about peaceful parenting as she is discussing holding real estate in retirement accounts and sees both as paths to liberty.\n. . . Visit her hub at \"Homeland\" on the field.\nWhen: Tue, 12:00P _(60m)\nWhere: Pav: Pavillion, Field\nNote: If you are hosting a hub, or volunteering, please come so attendees can meet you.","location":"Pav","startDatetime":"2023-06-20T16:00:00Z","endDatetime":"2023-06-20T17:00:00Z","timestamp":"2023-04-30T22:11:16Z"},{"summary":"<b>Comedy Night</b>  [Pav]","description":"For Whom: Lovers of standup comedy with an anti-state, and a bit raunchy, slant.\nDescription: Come and enjoy local and not as local comedians as they rip the state.\n: \nWhen: Thu, 6:00P (150m)\nWhere: Pav: Pavillion, Field\nNote: Acts will be posted as they confirm.","location":"Pav","startDatetime":"2023-06-22T22:00:00Z","endDatetime":"2023-06-23T00:30:00Z","timestamp":"2023-04-30T22:11:16Z"},{"summary":"<b>Panel: NBC Producers on Free State Project</b> Shira Stoll, Dan Ferrigan, Erica Jorgensen, Dennis Pratt [Pav]","description":"For Whom: People interested in the Free State Project, in Main Stream Media press coverage of libertarianism, and in long-form documentaries of controversial subjects.\nDescription: Hear the expectations and the experiences of the Producers who embedded eight months for a documentary of the Free State Project, and ask questions.\n. . . \"Life, Liberty, and the Pursuit of New Hampshire follows a libertarian political migration known as the Free State Project. Twenty years ago, one man penned a manifesto encouraging 20,000 libertarians to sign a pledge and move to the Granite State for more freedom. Now “The Free State Project” is shaking up politics and communities in New Hampshire and growing in strength and numbers.\"\nCo-Director, Producer, Cinematographer: Shira Stoll, Shira Stoll is the Co-Director + Producer of Life, Liberty and the Pursuit of New Hampshire. She is a regional Emmy and Murrow award winning video producer and journalist on the Special Projects + Streaming unit at NBC10 Boston working on long form narratives and investigative stories.\n. . . Shira was awarded a 2022 Regional Edward R. Murrow Award for her role on the project “Where I’m Really From,” a 2022 New England Emmy for The Chinatown Massacre documentary and a 2019 New York Emmy for Where Life Leads You: Stories of Staten Island’s Holocaust survivors.. <a href=\"https://twitter.com/ShiraStoll \"> Website </a>. <a href=\"https://images.squarespace-cdn.com/content/v1/54fe09d2e4b051f652a08a19/6d59dc07-de83-4892-a135-11f98fb37987/image-asset.jpeg?format=1000w\"> Image </a>\nCo-Director, Producer, Cinematographer: Dan Ferrigan, Award-winning photojournalist and filmmaker Dan Ferrigan is the Co-Director + Producer of Life, Liberty and the Pursuit of New Hampshire.  \n. . . Dan has worked around the world in nonfiction storytelling. Traveling to India, Dan worked on India: A New Life, commissioned by PBS-Frontline World. In 2008, India: A New Life received three Telly awards. Dan worked with New England Cable News (NECN) in Norway to shoot the 2010 AP award-winning documentary, Unequal Justice? The Joseph Donovan Story. Dan was the cinematographer on the Emmy-nominated documentary THE WAY WE GET BY released theatrically in July 2009, playing in over 60 cities nationwide. The film had its world premiere at the South By Southwest Film Festival (SXSW) in March 2009 and won the Special Jury Award. THE WAY WE GET BY has won 18 festival awards to date. Dan grew up in Winslow, Maine, and currently resides in Needham, Massachusetts.. <a href=\"https://twitter.com/DanFerrigan\"> Website </a>\nExecutive Producer: Erica Jorgensen, Erica Jorgensen is the Executive Producer Special Projects + Streaming at NBC10 Boston I Telemundo Boston I NECN at NBCUniversal Media, LLC.\nModerator: Dennis Pratt, Dennis is the Chef de Village of PorcFest XX 2023, this year's NH's Liberty Activist of the Year, and the Keynote Speaker at NH Liberty Forum. He was the number 1 writer on libertarian topics on the competitive intellectual essay site Quora before moving to the Free State 4.5 years ago to become the consummate volunteer to create the Libertarian Homeland, starting liberty clubhouses including the famous SHELL, opening the Independence Inn, leading liberty bus tours, raising hell with the LPNH, and tweeting about liberarian ethics and the Free State. This is his fifth and last year volunteering to lead PorcFest. Catch his daily talks on libertarianism at Libety 101.. <a href=\"https://www.fsp.org/wp-content/uploads/2019/03/Voluntaryist-Heart-only.jpg\"> Website </a>. <a href=\"https://twitter.com/DennisPrattFree\"> Image </a>\nWhen: Fri, 7:00P (120m)\nWhere: Pav: Pavillion, Field\nNote: A 45 minute subset (three of 11 episodes) of the docuseries will be played at 6P on Friday to whet your appetite, watch together, and remind you before the panel discussion.\n. . . The full docuseries will be played on Wed night in the Liberty 101 at 6P.\n. . . And you may pre-view the series before you come to PorcFest by following the above link to NBC Boston for Free State Project docuseries.\n<a href=\"https://www.nbcboston.com/news/local/coming-soon-life-liberty-and-the-pursuit-of-new-hampshire/2961708/\">More Info </a>","location":"Pav","startDatetime":"2023-06-23T23:00:00Z","endDatetime":"2023-06-24T01:00:00Z","timestamp":"2023-04-30T22:11:16Z"},{"summary":"<b>Debate: LPNH </b>  [Pav]","description":"For Whom: Libertarian Party members, people who want LPNH to stop or to continue its edgy messaging.\nDescription: We'll hold a debate whose resolution and participants will be announced, but it will likely be something around the Libertarian Party of New Hampshire -- it's \"mean tweets\" or relationships to other organizations.\n. . . LPNH has made an international name for itself as the most libertarian affiliate in the country, and as such it has gotten into trouble on a bunch of fronts, not just with authoritarians but also with libertarians who are trying to stay camouflaged, or who cannot withstand the occassional misstep, or who think that LPNH should be just like all the affiliates in the Authoritarian-49.\n. . . Should LPNH tone itself down? Become like the Authoritarian-49 affiliates? \n. . . You decide.\n: \nWhen: Wed, 12:00P (120m)\nWhere: Pav: Pavillion, Field","location":"Pav","startDatetime":"2023-06-21T16:00:00Z","endDatetime":"2023-06-21T18:00:00Z","timestamp":"2023-04-30T22:11:16Z"},{"summary":"<b>NBC Docuseries Excerpt Before Panel</b> Dennis Pratt [Pav]","description":"For Whom: People interested in the Free State Project, in Main Stream Media press coverage of libertarianism, and in long-form documentaries of controversial subjects\nDescription: \"NBC Boston embedded itself with the Free State Project for eight months, including during PorcFest 2022. The result was an eleven episode documentary-series which has enjoyed critical, libertarian, Porcupine, and authoritarian acclaim (not an easy task).\n. . . We'll play three episodes to warm you up before the panel discussion at 7P.\n. . . Come, cheer the Free Staters and jeer the free haters, and then hang around to hear how the Producers threaded MSM and liberal Boston gauntlet to produce an even handed account.\nModerator: Dennis Pratt, Dennis is the Chef de Village of PorcFest XX 2023, this year's NH's Liberty Activist of the Year, and the Keynote Speaker at NH Liberty Forum. He was the number 1 writer on libertarian topics on the competitive intellectual essay site Quora before moving to the Free State 4.5 years ago to become the consummate volunteer to create the Libertarian Homeland, starting liberty clubhouses including the famous SHELL, opening the Independence Inn, leading liberty bus tours, raising hell with the LPNH, and tweeting about liberarian ethics and the Free State. This is his fifth and last year volunteering to lead PorcFest. Catch his daily talks on libertarianism at Libety 101.. <a href=\"https://twitter.com/DennisPrattFree\"> Website </a>. <a href=\"https://www.fsp.org/wp-content/uploads/2019/03/Voluntaryist-Heart-only.jpg\"> Image </a>\nWhen: Fri, 6:00P _(60m)\nWhere: Pav: Pavillion, Field\nNote: The entire eleven episode docu-series will be played on Wed evening at Liberty 101.\n. . . Three episodes will be repeated Friday 6P at the Pavilion followed by\na panel discussion with the producers at 7P.\n<a href=\"https://www.nbcboston.com/news/local/coming-soon-life-liberty-and-the-pursuit-of-new-hampshire/2961708/\">More Info </a>","location":"Pav","startDatetime":"2023-06-23T22:00:00Z","endDatetime":"2023-06-23T23:00:00Z","timestamp":"2023-04-30T22:11:16Z"},{"summary":"<b>Maj Toure - Black Guns Matter</b> Maj Touré [Pav]","description":"For Whom: Second amendment advocates and dissenters.\nDescription: Maj Toure, a native of North Philadelphia, founded the educational nonprofit organization Black Guns Matter in 2016. The organization advocates for the right to keep and bear arms and promotes responsible ownership of firearms within African-American and urban communities. \nSpeaker: Maj Touré, Maj Toure, a native of North Philadelphia, founded the educational nonprofit organization Black Guns Matter in 2016. The organization advocates for the right to keep and bear arms and promotes responsible ownership of firearms within African-American and urban communities. He has released three rap/hip hop recordings: Solutionary Vol. 1 (2005), Solutionary Vol. 2 (2014), and Solutionary Vol. 3 (2016). Toure was a candidate for an at-large seat in the Philadelphia City Council in the city's 2019 election. He ran as a Libertarian. In addition to his support for Second Amendment rights, his stated political priorities included: criminal justice reform; ending the practice of solitary confinement; legalization of cannabis; improved education in Philadelphia; and conflict resolution training for disconnected youths. <a href=\"https://solutionarylifestyle.org/\"> Website </a>. <a href=\"https://solutionarylifestyle.org/wp-content/uploads/2021/06/maj-shot.jpg\"> Image </a>\nWhen: Thu, 4:00P _(60m)\nWhere: Pav: Pavillion, Field\nNote: Maj Toure is rumored to be a potential VP candidate on the 2024 Libertarian ticket. \n<a href=\"https://www.facebook.com/profile.php?id=100015026555306\">More Info </a>","location":"Pav","startDatetime":"2023-06-22T20:00:00Z","endDatetime":"2023-06-22T21:00:00Z","timestamp":"2023-04-30T22:11:16Z"},{"summary":"<b>Malcolm X Influenced Me to Become a Libertarian</b> Maj Tourè [Pav]","description":"For Whom: Freedom loving libertarians.\nDescription: Maj Toure, a native of North Philadelphia, founded the educational nonprofit organization Black Guns Matter in 2016. The organization advocates for the right to keep and bear arms and promotes responsible ownership of firearms within African-American and urban communities. He is dedicated to spreading the libertarianism to urban communities.\nSpeaker: Maj Tourè, Maj Toure, a native of North Philadelphia, founded the educational nonprofit organization Black Guns Matter in 2016. The organization advocates for the right to keep and bear arms and promotes responsible ownership of firearms within African-American and urban communities. He has released three rap/hip hop recordings: Solutionary Vol. 1 (2005), Solutionary Vol. 2 (2014), and Solutionary Vol. 3 (2016). Toure was a candidate for an at-large seat in the Philadelphia City Council in the city's 2019 election. He ran as a Libertarian. In addition to his support for Second Amendment rights, his stated political priorities included: criminal justice reform; ending the practice of solitary confinement; legalization of cannabis; improved education in Philadelphia; and conflict resolution training for disconnected youths. . <a href=\"https://solutionarylifestyle.org/\"> Website </a>. <a href=\"https://solutionarylifestyle.org/wp-content/uploads/2021/06/Snapchat-29076284_1296x.jpg\"> Image </a>\nWhen: Sat, 1:00P _(60m)\nWhere: Pav: Pavillion, Field\nNote: Though Maj the urban communities are being educated about libertarian principles.\n<a href=\"https://solutionarylifestyle.org/\">More Info </a>","location":"Pav","startDatetime":"2023-06-24T17:00:00Z","endDatetime":"2023-06-24T18:00:00Z","timestamp":"2023-04-30T22:11:16Z"},{"summary":"<b>Anatomy of the Coup D'Etat </b> Jeffrey Tucker [Pav]","description":"For Whom: TBD\nDescription: The real history of our times is shrouded in secrecy but we know enough to piece it together. There was an overthrown of civilian government in this country and its replacement by a military-baed biomedical security state. The crisis is urgent and the solution must begin with knowledge. \nSpeaker: Jeffrey Tucker, Founder and President of the Brownstone Institute, Jeffrey is the author of many thousands of articles in the scholarly and popular press and ten books in 5 languages, most recently Liberty or Lockdown. He is also the editor of The Best of Mises. He speaks widely on topics of economics, technology, social philosophy, and culture.\n. <a href=\"https://brownstone.org/about/\"> Website </a>. <a href=\"https://www.aier.org/wp-content/webpc-passthru.php?src=https://www.aier.org/wp-content/uploads/2020/06/porcfest-2020-jeffrey-tucker.jpg\"> Image </a>\nWhen: Sat, 4:00P (120m)\nWhere: Pav: Pavillion, Field\n<a href=\"https://brownstone.org/about/\">More Info </a>","location":"Pav","startDatetime":"2023-06-24T20:00:00Z","endDatetime":"2023-06-24T22:00:00Z","timestamp":"2023-04-30T22:11:16Z"},{"summary":"<b>My Holiday with Meghan</b> Reed Coverdale [Pav]","description":"For Whom: Libertarian Party members, potential movers, lover of \"mean tweets\" and haters of mass murder.\nDescription: Reed Coverdale is a \"re-mover\" to the Free State and has spent his last year since moving <...>, helping run the Jeremy for Senate campaign, tormenting Meghan McCain and the Military Industrial complex, beating back take-over attempts, and learning about the transformation that has occurred in his home state.\n. . . Join Reed as he reflects about his re-integration into the Free State, a Libertarian Homeland that has advanced far further than he remembered it when he left.  \nSpeaker: Reed Coverdale. <a href=\"https://i0.wp.com/libertyspeaks.world/wp-content/uploads/2022/09/image-10.png?w=232&ssl=1\"> Image </a>\nWhen: Thu, 5:00P _(60m)\nWhere: Pav: Pavillion, Field","location":"Pav","startDatetime":"2023-06-22T21:00:00Z","endDatetime":"2023-06-22T22:00:00Z","timestamp":"2023-04-30T22:11:16Z"},{"summary":"<b>Lessons from the Croydon Budget Battle</b> Ian Underwood, Jody Underwood [Pav]","description":"For Whom: Interested in school reform, school choice, battles over property taxes and monied interests, breaking the indoctrination camps.\nDescription: The Croydon school budget battle was a surprise encounter with the forces of greater government. A question of why waste more money not improving children's education caused the town meeting to budget more than private schools, but far less than the cronies wanted. Union fund flowed in; citizens preferring $300, not $3000, property taxes were vilified, and the forces of evil triumphed\n. . . for now.\n. . . What have we learned about how to handle the next unexpected break-through, where liberty removes a manacle, and the cronies screech their fear of humans being freed?\nSpeaker: Ian Underwood, Ian Underwood has been a planetary scientist and artificial intelligence researcher for NASA, the director of the renowned Ask Dr. Math service, co-founder of Bardo Farm and Shaolin Rifleworks, and a popular speaker at liberty-related events. He is the author of a series of Bare Minimum Books, which expose the simplicity underlying complex issues like law, education, and gun rights. He lives in Croydon, New Hampshire.. <a href=\"https://www.bareminimumbooks.com/\"> Website </a>. <a href=\"https://www.nhlibertyforum.com/images/speakers/Ian_Underwood-2a83158be6e3275c2ac6d2951ac2d288.png\"> Image </a>\nSpeaker: Jody Underwood, Jody Underwood served on the Croydon School Board from 2010-2013. She shepherded a bill through the NH legislature to clarify the law to allow private schools to be included in town tuitioning agreements. She is a founding board member of the School District Governance Association of NH (sdganh.org), whose mission is to help school board members discover their powers so they don’t get overrun by administrators.\n. . . Jody has written research papers about how New Hampshire uses tax dollars for private schools and about how town tuitioning works in New Hampshire. She has delivered presentations about town tuitioning and school choice around the state.\n . . In her day job, from which she has recently retired, she has conducted research and development of technology to support learning and assessment in the classroom since 1988. \n . . She and her husband moved to New Hampshire in 2007, where they live on a large off-the-grid property.. <a href=\"https://www.nhlibertyforum.com/images/speakers/Jody_Underwood-46c5c206b2afe6563f6a6b0a821894b2.png\"> Image </a>\nWhen: Wed, 2:00P _(60m)\nWhere: Pav: Pavillion, Field\n<a href=\"https://granitegrok.com/blog/2022/03/budget-or-ransom\">More Info </a>","location":"Pav","startDatetime":"2023-06-21T18:00:00Z","endDatetime":"2023-06-21T19:00:00Z","timestamp":"2023-04-30T22:11:16Z"},{"summary":"<b>War on the Poor</b> Elizabeth Duffy [Pav]","description":"For Whom: Those interested in destroying false narratives, dark humor enthusiasts\nDescription: Elizabeth Duffy - TikTok comedy creator, model, and host of the Tax This Podcast - destroys the progressive empathy argument with the states impact on the poor and how economic freedom and individual sovereignty are the most helpful principles for those struggling financially. Wednesday 3PM-4PM PAV\nSpeaker: Elizabeth Duffy. <a href=\"https://pbs.twimg.com/ext_tw_video_thumb/1618654211796881410/pu/img/1yQp0AQa0f4a_1ye?format=jpg&name=large\"> Image </a>\nWhen: Wed, 3:00P _(60m)\nWhere: Pav: Pavillion, Field\nNote: Language may not be suitable for young audiences.\n<a href=\"https://www.youtube.com/@taxthispodcast\">More Info </a>","location":"Pav","startDatetime":"2023-06-21T19:00:00Z","endDatetime":"2023-06-21T20:00:00Z","timestamp":"2023-04-30T22:11:16Z"},{"summary":"<b>FSP: The Good, The Fab and the Fugly</b> Carla Gericke [Pav]","description":"For Whom: Free Staters, Wanna-be-Free Staters, and people who wish they could be Free Staters.\nDescription: Twenty years have come and gone, and we're only getting started! Where are we now and where are we going? Join Carla as she reflects on the end of the beginning, and what her vision is for the next 20 years in the Free State. Big goals require big dreams. Come discover how we can make New Hampshire our libertarian homeland. Live free and thrive!\nSpeaker: Carla Gericke, Carla is an early mover and OG, taking executive and volunteer roles within the FSP since 2008, as well as leading efforts to make New Hampshire more free by serving on boards and running for office. Carla is affectionately known as ‘Queen Quill’, is the Chair of the Free State Project, lead producer of numerous PorcFests, and constant volunteer. She spearheads innumerable liberty efforts in the Free State, including issues relating to 1st, 2nd, 4th and 10th Amendment issues, government accountability/transparency, and how to Live Free and Thrive!. <a href=\"https://www.carlagericke.com/\"> Website </a>\nWhen: Thu, 5:00P _(60m)\nWhere: Pav: Pavillion, Field\n<a href=\"https://www.carlagericke.com/\">More Info </a>","location":"Pav","startDatetime":"2023-06-22T21:00:00Z","endDatetime":"2023-06-22T22:00:00Z","timestamp":"2023-04-30T22:11:16Z"},{"summary":"<b>The Liberty Migration’s 20-Year Anniversary</b> Jason Sorens [Pav]","description":"For Whom: People who want to make Liberty in Our Lifetime happen\nDescription: October 1, 2003 was the date we announced New Hampshire’s selection as the Free State. Contrary to expectations, liberty lovers started moving right away. Thousands have now moved and gotten active. What impact have we had? What impact will we have over the next 20 years?\nSpeaker: Jason Sorens, The Free State Project was founded in 2001 by Jason Sorens, then a Ph.D. student at Yale University. Jason was studying independence movements in other countries and thinking about how liberty-minded folk could have an impact as a small minority in the world and the U.S. Jason published an article in The Libertarian Enterprise highlighting the failure of libertarians to elect any candidate to federal office and outlining his ideas for a migration movement that continues an American tradition of political migration, which includes groups such as Mormon settlers in Utah, Amish religious communities, and the \"Jamestown Seventy\", an earlier effort to influence the politics of a particular state through deliberate migration. Jason's essay eventually became the founding document of the Free State Project. In it, Jason proposed a mass migration, a voluntary resettlement of 20,000 libertarians, anarchists, anarcho-capitalists, pacifists, even freedom-minded Democrats and Republicans, to a single, relatively liberty-friendly state, where they could establish a beachhead of personal and economic freedom. Today, Jason is Senior Research Faculty at AIER and lives with his family in Amherst, New Hampshire.. <a href=\"https://www.cato.org/sites/cato.org/files/styles/bio_picture_desktop_3x/public/authors/crops/barcelona-cropped.jpg?itok=i_9t4HC2\"> Image </a>\nWhen: Fri, 5:00P _(60m)\nWhere: Pav: Pavillion, Field\n<a href=\"https://www.fsp.org\">More Info </a>","location":"Pav","startDatetime":"2023-06-23T21:00:00Z","endDatetime":"2023-06-23T22:00:00Z","timestamp":"2023-04-30T22:11:16Z"},{"summary":"<b>Doing What Must Be Done</b> Jeremy Kauffman [Pav]","description":"For Whom: People curious about the history and strategy of the Free State movement, Free State skeptics, Free State newbies, people who like bad jokes\nDescription: Libertarians are a dominated political minority. They are isolated, surrounded, and sometimes so depressed they think there is no hope.\n\nIn this talk, we'll look at why that is, why the Free State movement is a solution to these fundamental problems, and where the movement goes from here.\nSpeaker: Jeremy Kauffman, Founder of LBRY and Odysee, Jeremy is on the Board of the Free State Project. He ran for US Senate from NH, and is himself a Free State mover with his wife and 4 children.. <a href=\"kauffj.com\"> Website </a>\nWhen: Sat, 12:00P _(60m)\nWhere: Pav: Pavillion, Field\n<a href=\"twitter.com/jeremykauffman\">More Info </a>","location":"Pav","startDatetime":"2023-06-24T16:00:00Z","endDatetime":"2023-06-24T17:00:00Z","timestamp":"2023-04-30T22:11:16Z"},{"summary":"<b>Axis of (US) Deception: Iran-China-Russia</b> Connor Freeman [Pav]","description":"For Whom: Have you been scared of the threat to your security by the big bad boogeymen?\nDescription: \nSpeaker: Connor Freeman\nWhen: Tue, 3:00P _(60m)\nWhere: Pav: Pavillion, Field","location":"Pav","startDatetime":"2023-06-20T19:00:00Z","endDatetime":"2023-06-20T20:00:00Z","timestamp":"2023-04-30T22:11:16Z"},{"summary":"<b>Progressive Lies</b> Keith Knight [Pav]","description":"For Whom: Were you educated in government schools? Have you listened to Mainstream Media? Have you talked to normies at parties?  Then you have been lied to...\nDescription: \nSpeaker: Keith Knight\nWhen: Wed, 11:00A _(60m)\nWhere: Pav: Pavillion, Field","location":"Pav","startDatetime":"2023-06-21T15:00:00Z","endDatetime":"2023-06-21T16:00:00Z","timestamp":"2023-04-30T22:11:16Z"},{"summary":"<b>Scott Horton Special Project</b> Scott Horton [Pav]","description":"For Whom: \nDescription: \nSpeaker: Scott Horton. <a href=\"https://libertarianinstitute.org/scott/\"> Image </a>\nWhen: Wed, 4:00P _(60m)\nWhere: Pav: Pavillion, Field","location":"Pav","startDatetime":"2023-06-21T20:00:00Z","endDatetime":"2023-06-21T21:00:00Z","timestamp":"2023-04-30T22:11:16Z"},{"summary":"<b>Fake China-Russian Threat</b> Kyle Anzalone [Pav]","description":"For Whom: Do you fear China? Or Russia?\nMaybe you should be fearing your own government?\nDescription: \nSpeaker: Kyle Anzalone\nWhen: Thu, 2:00P _(60m)\nWhere: Pav: Pavillion, Field","location":"Pav","startDatetime":"2023-06-22T18:00:00Z","endDatetime":"2023-06-22T19:00:00Z","timestamp":"2023-04-30T22:11:16Z"},{"summary":"<b>Scott's big talk to widest audience</b> Scott Horton [Pav]","description":"For Whom: \nDescription: \nSpeaker: Scott Horton. <a href=\"https://libertarianinstitute.org/scott/\"> Image </a>\nWhen: Fri, 4:00P _(60m)\nWhere: Pav: Pavillion, Field","location":"Pav","startDatetime":"2023-06-23T20:00:00Z","endDatetime":"2023-06-23T21:00:00Z","timestamp":"2023-04-30T22:11:16Z"},{"summary":"<b>Emo Night Porcfest!</b> Ben Weir [Pav]","description":"For Whom: People who enjoy music that is counter-cultural and of the alternative variety will also enjoy this event. We will be performing some of the top emo and pop punk hits from the 2005-2010 era. Rock your heart out, enjoy the light show, dance, sing, and have a great time! We have a great set planned, including some secret special guest performances! Let’s rawk and have a good time!\nDescription: The LP Emo Caucus will be hosting an Emo Night DJ set at PorcFest this year! Come enjoy a light show, dancing, and good emo/pop punk music.\nDJ: Ben Weir, I have been a lifelong musician and formerly toured all over the US performing punk/emo music. I’ve been able to DJ several emo nights. Combined with my active stage presence, I will make Emo Night extremely entertaining for attendees. . <a href=\"https://www.facebook.com/groups/emocaucus/?ref=share&fs=e&s=cl\"> Website </a>. <a href=\"https://www.facebook.com/photo.php?fbid=5808195149278004&set=gm.174387815549902&type=3\"> Image </a>\nWhen: Thu, 8:30P _(90m)\nWhere: Pav: Pavillion, Field\nNote: The Libertarian Party Emo Caucus will also be selling $2 PBR’s for the duration of the event, with all proceeds being donated to the non-profit suicide prevention organization To Write Love On Her Arms.\n<a href=\"https://facebook.com/events/s/emo-night-porcfest/157801320541885/\">More Info </a>","location":"Pav","startDatetime":"2023-06-23T00:30:00Z","endDatetime":"2023-06-23T02:00:00Z","timestamp":"2023-04-30T22:11:16Z"},{"summary":"<b>Massachusetts Meetup</b> Dennis Pratt [FSP]","description":"For Whom: If you live in, once lived in, or have moved from, Massachusetts\nDescription: Come meet others currently living or from Massachusetts. You traveled far to get here and so did they!  \n . . Find out where they live. Look for someone who live(d) close to you. What liberty events they do/did there. What events are you looking forward to this week? Make plans to meet again at another event, and perhaps when you get back home.”\nFacilitator: Dennis Pratt, Chef de Village of PF 2023, 2022, 2021. Founder of The SHELL, Independence Inn, Free State Tours. blah blah blah Lived in Massachusetts for 40 years. MIT blah blah blah. <a href=\"https://twitter.com/DennisPrattFree\"> Website </a>. <a href=\"https://www.nhlibertyforum.com/images/speakers/Dennis_Pratt-e6842a6532f05875e4f99145c8123f14.png?vsn=d\"> Image </a>\nWhen: Wed, 10:00A _(30m)\nWhere: FSP: Free State Live Stage, Pennisula\nNote: We'll have regional meetings Wed morning -> early afternoon. If you're from multiple states, consider coming to other meetups.","location":"FSP","startDatetime":"2023-06-21T14:00:00Z","endDatetime":"2023-06-21T14:30:00Z","timestamp":"2023-04-30T22:11:16Z"},{"summary":"<b>All-Volunteer-Hands Meeting</b> Constance Spencer, Dennis Pratt [FSP]","description":"For Whom: If you have already volunteered to help out at PF2022.\n. . . If you would like to volunteer and help out at PF2022\n. . . If you are a coordinator of PF2022\nDescription: All volunteers of PorcFest XX 2023 gather together to appreciate the work we have done, and the gift we are about to bestow on three thousand liberty lovers yearning for freedom.\n\nOrganizer: Constance Spencer, Constance is our co-producer for PorcFest XX 2023.  Having volunteered to manage Registration for the last five years, Constance is stepping up this year PorcFest Operations Direct, responsible for all the internal operations of PorcFest (Registration, Free Aid, Facilities, PorcRangers, Inventory, Info, Costs, Rogers relations, etc.)\n. . . When not volunteering to manage the complex operations of the largest freedom festival in the world, Constance is the lead of Independence Realty Group which is a real estate team at Coldwell Banker Realty.\n. . . She is an early mover for the Free State Project moving from Alaska in 2014 with her four children. In Alaska she was learning self-reliance by turning her small acreage home into a homestead through permaculture and raising chickens, ducks, turkeys, and pigs. She was also active in the home birth community and has always allowed her children education freedom which has included homeschooling, trade schools, and charter schools.\n. . . She has also been a real estate investor since her early twenties when she rented her single family home in Ohio and moved to Alaska. She and her partner currently have 13 rental units. Her passion is helping others navigate home ownership and real estate investing. She’s just as comfortable talking about peaceful parenting as she is discussing holding real estate in retirement accounts and sees both as paths to liberty.\n. . . Visit her hub at \"Homeland\" on the field.. <a href=\"https://www.independencerealtynh.com\"> Website </a>. <a href=\"https://www.amazon.com/photos/shared/nX5q1bAmRd-wZXaAjuXMOA.4R627B63-BjOzf19edUvRR\"> Image </a>\nChef de Village, PorcFest XX 2023: Dennis Pratt, This is Dennis' fifth and final year volunteering to coordinate PorcFest, and his third year as co-producer/\"Chef de Village\". He is in charge of positioning, events, hubs, speakers, sponsors, marketing, and revenues.\n. . . Dennis reimagined PorcFest in 2020 to align more with our FSP goals to attract liberty lovers to the Free State, and to connect and activate those liberty lovers to build greater liberty.\n. . . Dennis has found refuge in the Free State over the last four and a half years, having suffered decades in authoritarian states. Don't let his galootish looks fool you! Rolling up his sleeves, he has become one of the Free State's most entrepreneurial volunteers, starting up liberty clubhouses (including the famous SHELL), liberty bus tours, liberty events. a liberty inn. In a myriad other ways, he connects liberty lovers together and inspires them to build. He's an ethicist, well known amongst really nerdy circles. You can hear him talk in the Liberty 101 hub, when he's not driving around, with his wife Carol and his pup Ron Paw, making sure everything's copacetic.\n. . . He was this year's NH Liberty Activist of the Year, and the Keynote Speaker for NH Liberty Forum. He's a hugger, so warn him off if he gets too close!. <a href=\"https://twitter.com/DennisPrattFree\"> Website </a>. <a href=\"https://www.nhlibertyforum.com/images/speakers/Dennis_Pratt-e6842a6532f05875e4f99145c8123f14.png\"> Image </a>\nWhen: Tue, 10:00A _(60m)\nWhere: FSP: Free State Live Stage, Pennisula\nNote: We will have a meeting of all volunteers each day at 9A at the Free State Live stage. This, being the official Opening Day, is our first meeting, and delayed an hour. \nFunctional groups meet right after this to prepare for opening at noon.","location":"FSP","startDatetime":"2023-06-20T14:00:00Z","endDatetime":"2023-06-20T15:00:00Z","timestamp":"2023-04-30T22:11:16Z"},{"summary":"<b>PorcFest Volunteer Gathering</b> Constance Spencer, Dennis Pratt [FSP]","description":"For Whom: PF volunteers, or those who want to help PF\nFind out what happened yesterday and what's coming up today.\nFacilities, PorcRangers, Fr33 Aid, Pavillion, Liberty 101, Pints, Registration, etc.\nDescription: If you're volunteering at PorcFest -- or want to volunteer at PorcFest -- come to our daily meetup to get the inside scoop on what's happening, and to coordinate with your coordinators.\nOrganizer: Constance Spencer, Constance is our co-producer for PorcFest XX 2023.  Having volunteered to manage Registration for the last five years, Constance is stepping up this year PorcFest Operations Direct, responsible for all the internal operations of PorcFest (Registration, Free Aid, Facilities, PorcRangers, Inventory, Info, Costs, Rogers relations, etc.)\n. . . When not volunteering to manage the complex operations of the largest freedom festival in the world, Constance is the lead of Independence Realty Group which is a real estate team at Coldwell Banker Realty.\n. . . She is an early mover for the Free State Project moving from Alaska in 2014 with her four children. In Alaska she was learning self-reliance by turning her small acreage home into a homestead through permaculture and raising chickens, ducks, turkeys, and pigs. She was also active in the home birth community and has always allowed her children education freedom which has included homeschooling, trade schools, and charter schools.\n. . . She has also been a real estate investor since her early twenties when she rented her single family home in Ohio and moved to Alaska. She and her partner currently have 13 rental units. Her passion is helping others navigate home ownership and real estate investing. She’s just as comfortable talking about peaceful parenting as she is discussing holding real estate in retirement accounts and sees both as paths to liberty.\n. . . Visit her hub at \"Homeland\" on the field.. <a href=\"https://www.independencerealtynh.com\"> Website </a>. <a href=\"https://www.amazon.com/photos/shared/nX5q1bAmRd-wZXaAjuXMOA.4R627B63-BjOzf19edUvRR\"> Image </a>\nChef de Village, PorcFest XX 2023: Dennis Pratt, This is Dennis' fifth and final year volunteering to coordinate PorcFest, and his third year as co-producer/\"Chef de Village\". He is in charge of positioning, events, hubs, speakers, sponsors, marketing, and revenues.\n. . . Dennis reimagined PorcFest in 2020 to align more with our FSP goals to attract liberty lovers to the Free State, and to connect and activate those liberty lovers to build greater liberty.\n. . . Dennis has found refuge in the Free State over the last four and a half years, having suffered decades in authoritarian states. Don't let his galootish looks fool you! Rolling up his sleeves, he has become one of the Free State's most entrepreneurial volunteers, starting up liberty clubhouses (including the famous SHELL), liberty bus tours, liberty events. a liberty inn. In a myriad other ways, he connects liberty lovers together and inspires them to build. He's an ethicist, well known amongst really nerdy circles. You can hear him talk in the Liberty 101 hub, when he's not driving around, with his wife Carol and his pup Ron Paw, making sure everything's copacetic.\n. . . He was this year's NH Liberty Activist of the Year, and the Keynote Speaker for NH Liberty Forum. He's a hugger, so warn him off if he gets too close!. <a href=\"https://twitter.com/DennisPrattFree\"> Website </a>. <a href=\"https://www.nhlibertyforum.com/images/speakers/Dennis_Pratt-e6842a6532f05875e4f99145c8123f14.png\"> Image </a>\nWhen: Wed, 9:00A _(30m)\nWhere: FSP: Free State Live Stage, Pennisula","location":"FSP","startDatetime":"2023-06-21T13:00:00Z","endDatetime":"2023-06-21T13:30:00Z","timestamp":"2023-04-30T22:11:16Z"},{"summary":"<b>PorcFest Volunteer Gathering</b> Constance Spencer, Dennis Pratt [FSP]","description":"For Whom: PF volunteers, or those who want to help PF\nFind out what happened yesterday and what's coming up today.\nFacilities, PorcRangers, Fr33 Aid, Pavillion, Liberty 101, Pints, Registration, etc.\nDescription: If you're volunteering at PorcFest -- or want to volunteer at PorcFest -- come to our daily meetup to get the inside scoop on what's happening, and to coordinate with your coordinators.\nOrganizer: Constance Spencer, Constance is our co-producer for PorcFest XX 2023.  Having volunteered to manage Registration for the last five years, Constance is stepping up this year PorcFest Operations Direct, responsible for all the internal operations of PorcFest (Registration, Free Aid, Facilities, PorcRangers, Inventory, Info, Costs, Rogers relations, etc.)\n. . . When not volunteering to manage the complex operations of the largest freedom festival in the world, Constance is the lead of Independence Realty Group which is a real estate team at Coldwell Banker Realty.\n. . . She is an early mover for the Free State Project moving from Alaska in 2014 with her four children. In Alaska she was learning self-reliance by turning her small acreage home into a homestead through permaculture and raising chickens, ducks, turkeys, and pigs. She was also active in the home birth community and has always allowed her children education freedom which has included homeschooling, trade schools, and charter schools.\n. . . She has also been a real estate investor since her early twenties when she rented her single family home in Ohio and moved to Alaska. She and her partner currently have 13 rental units. Her passion is helping others navigate home ownership and real estate investing. She’s just as comfortable talking about peaceful parenting as she is discussing holding real estate in retirement accounts and sees both as paths to liberty.\n. . . Visit her hub at \"Homeland\" on the field.. <a href=\"https://www.independencerealtynh.com\"> Website </a>. <a href=\"https://www.amazon.com/photos/shared/nX5q1bAmRd-wZXaAjuXMOA.4R627B63-BjOzf19edUvRR\"> Image </a>\nChef de Village, PorcFest XX 2023: Dennis Pratt, This is Dennis' fifth and final year volunteering to coordinate PorcFest, and his third year as co-producer/\"Chef de Village\". He is in charge of positioning, events, hubs, speakers, sponsors, marketing, and revenues.\n. . . Dennis reimagined PorcFest in 2020 to align more with our FSP goals to attract liberty lovers to the Free State, and to connect and activate those liberty lovers to build greater liberty.\n. . . Dennis has found refuge in the Free State over the last four and a half years, having suffered decades in authoritarian states. Don't let his galootish looks fool you! Rolling up his sleeves, he has become one of the Free State's most entrepreneurial volunteers, starting up liberty clubhouses (including the famous SHELL), liberty bus tours, liberty events. a liberty inn. In a myriad other ways, he connects liberty lovers together and inspires them to build. He's an ethicist, well known amongst really nerdy circles. You can hear him talk in the Liberty 101 hub, when he's not driving around, with his wife Carol and his pup Ron Paw, making sure everything's copacetic.\n. . . He was this year's NH Liberty Activist of the Year, and the Keynote Speaker for NH Liberty Forum. He's a hugger, so warn him off if he gets too close!. <a href=\"https://twitter.com/DennisPrattFree\"> Website </a>. <a href=\"https://www.nhlibertyforum.com/images/speakers/Dennis_Pratt-e6842a6532f05875e4f99145c8123f14.png\"> Image </a>\nWhen: Thu, 9:00A _(30m)\nWhere: FSP: Free State Live Stage, Pennisula","location":"FSP","startDatetime":"2023-06-22T13:00:00Z","endDatetime":"2023-06-22T13:30:00Z","timestamp":"2023-04-30T22:11:16Z"},{"summary":"<b>PorcFest Volunteer Gathering</b> Constance Spencer, Dennis Pratt [FSP]","description":"For Whom: PF volunteers, or those who want to help PF\nFind out what happened yesterday and what's coming up today.\nFacilities, PorcRangers, Fr33 Aid, Pavillion, Liberty 101, Pints, Registration, etc.\nDescription: If you're volunteering at PorcFest -- or want to volunteer at PorcFest -- come to our daily meetup to get the inside scoop on what's happening, and to coordinate with your coordinators.\nOrganizer: Constance Spencer, Constance is our co-producer for PorcFest XX 2023.  Having volunteered to manage Registration for the last five years, Constance is stepping up this year PorcFest Operations Direct, responsible for all the internal operations of PorcFest (Registration, Free Aid, Facilities, PorcRangers, Inventory, Info, Costs, Rogers relations, etc.)\n. . . When not volunteering to manage the complex operations of the largest freedom festival in the world, Constance is the lead of Independence Realty Group which is a real estate team at Coldwell Banker Realty.\n. . . She is an early mover for the Free State Project moving from Alaska in 2014 with her four children. In Alaska she was learning self-reliance by turning her small acreage home into a homestead through permaculture and raising chickens, ducks, turkeys, and pigs. She was also active in the home birth community and has always allowed her children education freedom which has included homeschooling, trade schools, and charter schools.\n. . . She has also been a real estate investor since her early twenties when she rented her single family home in Ohio and moved to Alaska. She and her partner currently have 13 rental units. Her passion is helping others navigate home ownership and real estate investing. She’s just as comfortable talking about peaceful parenting as she is discussing holding real estate in retirement accounts and sees both as paths to liberty.\n. . . Visit her hub at \"Homeland\" on the field.. <a href=\"https://www.independencerealtynh.com\"> Website </a>. <a href=\"https://www.amazon.com/photos/shared/nX5q1bAmRd-wZXaAjuXMOA.4R627B63-BjOzf19edUvRR\"> Image </a>\nChef de Village, PorcFest XX 2023: Dennis Pratt, This is Dennis' fifth and final year volunteering to coordinate PorcFest, and his third year as co-producer/\"Chef de Village\". He is in charge of positioning, events, hubs, speakers, sponsors, marketing, and revenues.\n. . . Dennis reimagined PorcFest in 2020 to align more with our FSP goals to attract liberty lovers to the Free State, and to connect and activate those liberty lovers to build greater liberty.\n. . . Dennis has found refuge in the Free State over the last four and a half years, having suffered decades in authoritarian states. Don't let his galootish looks fool you! Rolling up his sleeves, he has become one of the Free State's most entrepreneurial volunteers, starting up liberty clubhouses (including the famous SHELL), liberty bus tours, liberty events. a liberty inn. In a myriad other ways, he connects liberty lovers together and inspires them to build. He's an ethicist, well known amongst really nerdy circles. You can hear him talk in the Liberty 101 hub, when he's not driving around, with his wife Carol and his pup Ron Paw, making sure everything's copacetic.\n. . . He was this year's NH Liberty Activist of the Year, and the Keynote Speaker for NH Liberty Forum. He's a hugger, so warn him off if he gets too close!. <a href=\"https://twitter.com/DennisPrattFree\"> Website </a>. <a href=\"https://www.nhlibertyforum.com/images/speakers/Dennis_Pratt-e6842a6532f05875e4f99145c8123f14.png\"> Image </a>\nWhen: Fri, 9:00A _(30m)\nWhere: FSP: Free State Live Stage, Pennisula","location":"FSP","startDatetime":"2023-06-23T13:00:00Z","endDatetime":"2023-06-23T13:30:00Z","timestamp":"2023-04-30T22:11:16Z"},{"summary":"<b>PorcFest Volunteer Gathering</b> Constance Spencer, Dennis Pratt [FSP]","description":"For Whom: PF volunteers, or those who want to help PF\nFind out what happened yesterday and what's coming up today.\nFacilities, PorcRangers, Fr33 Aid, Pavillion, Liberty 101, Pints, Registration, etc.\nDescription: If you're volunteering at PorcFest -- or want to volunteer at PorcFest -- come to our daily meetup to get the inside scoop on what's happening, and to coordinate with your coordinators.\nOrganizer: Constance Spencer, Constance is our co-producer for PorcFest XX 2023.  Having volunteered to manage Registration for the last five years, Constance is stepping up this year PorcFest Operations Direct, responsible for all the internal operations of PorcFest (Registration, Free Aid, Facilities, PorcRangers, Inventory, Info, Costs, Rogers relations, etc.)\n. . . When not volunteering to manage the complex operations of the largest freedom festival in the world, Constance is the lead of Independence Realty Group which is a real estate team at Coldwell Banker Realty.\n. . . She is an early mover for the Free State Project moving from Alaska in 2014 with her four children. In Alaska she was learning self-reliance by turning her small acreage home into a homestead through permaculture and raising chickens, ducks, turkeys, and pigs. She was also active in the home birth community and has always allowed her children education freedom which has included homeschooling, trade schools, and charter schools.\n. . . She has also been a real estate investor since her early twenties when she rented her single family home in Ohio and moved to Alaska. She and her partner currently have 13 rental units. Her passion is helping others navigate home ownership and real estate investing. She’s just as comfortable talking about peaceful parenting as she is discussing holding real estate in retirement accounts and sees both as paths to liberty.\n. . . Visit her hub at \"Homeland\" on the field.. <a href=\"https://www.independencerealtynh.com\"> Website </a>. <a href=\"https://www.amazon.com/photos/shared/nX5q1bAmRd-wZXaAjuXMOA.4R627B63-BjOzf19edUvRR\"> Image </a>\nChef de Village, PorcFest XX 2023: Dennis Pratt, This is Dennis' fifth and final year volunteering to coordinate PorcFest, and his third year as co-producer/\"Chef de Village\". He is in charge of positioning, events, hubs, speakers, sponsors, marketing, and revenues.\n. . . Dennis reimagined PorcFest in 2020 to align more with our FSP goals to attract liberty lovers to the Free State, and to connect and activate those liberty lovers to build greater liberty.\n. . . Dennis has found refuge in the Free State over the last four and a half years, having suffered decades in authoritarian states. Don't let his galootish looks fool you! Rolling up his sleeves, he has become one of the Free State's most entrepreneurial volunteers, starting up liberty clubhouses (including the famous SHELL), liberty bus tours, liberty events. a liberty inn. In a myriad other ways, he connects liberty lovers together and inspires them to build. He's an ethicist, well known amongst really nerdy circles. You can hear him talk in the Liberty 101 hub, when he's not driving around, with his wife Carol and his pup Ron Paw, making sure everything's copacetic.\n. . . He was this year's NH Liberty Activist of the Year, and the Keynote Speaker for NH Liberty Forum. He's a hugger, so warn him off if he gets too close!. <a href=\"https://twitter.com/DennisPrattFree\"> Website </a>. <a href=\"https://www.nhlibertyforum.com/images/speakers/Dennis_Pratt-e6842a6532f05875e4f99145c8123f14.png\"> Image </a>\nWhen: Sat, 9:00A _(30m)\nWhere: FSP: Free State Live Stage, Pennisula","location":"FSP","startDatetime":"2023-06-24T13:00:00Z","endDatetime":"2023-06-24T13:30:00Z","timestamp":"2023-04-30T22:11:16Z"},{"summary":"<b>Vermont/Maine/NY State/Canada Meetup</b>  [FSP]","description":"For Whom: If you live in, once lived in, or have moved from Upper New York, Vermont, Maine, or Canada\nDescription: Come meet others currently living or from Vermont, Maine, NY, and Canada. You traveled far to get here and so did they!  \n . . Find out where they live. Look for someone who live(d) close to you. What liberty events they do/did there. What events are you looking forward to this week? Make plans to meet again at another event, and perhaps when you get back home.”\n: \nWhen: Wed, 10:30A _(30m)\nWhere: FSP: Free State Live Stage, Pennisula\nNote: We'll have US regional meetings Wed morning -> early afternoon. If you're from multiple states, consider coming to other meetups.","location":"FSP","startDatetime":"2023-06-21T14:30:00Z","endDatetime":"2023-06-21T15:00:00Z","timestamp":"2023-04-30T22:11:16Z"},{"summary":"<b>NYC/Westchester/Conneticut/Rhode Island Meetup</b>  [FSP]","description":"For Whom: If you live in, once lived in, or have moved from NYC metropolitan area, Connecticut, Rhode Island.\nDescription: Come meet others currently living or from NYC, CT, RI. You traveled far to get here and so did they!  \n . . Find out where they live. Look for someone who live(d) close to you. What liberty events they do/did there. What events are you looking forward to this week? Make plans to meet again at another event, and perhaps when you get back home.”\n: \nWhen: Wed, 11:00A _(30m)\nWhere: FSP: Free State Live Stage, Pennisula\nNote:  We'll have US regional meetings Wed morning -> early afternoon. If you're from multiple states, consider coming to other meetups.","location":"FSP","startDatetime":"2023-06-21T15:00:00Z","endDatetime":"2023-06-21T15:30:00Z","timestamp":"2023-04-30T22:11:16Z"},{"summary":"<b>Mid-Atlantic Meetup: NJ/PA/DC/VA/DE/MD </b>  [FSP]","description":"For Whom: If you live in, once lived in, or have moved from New Jersey, Pennsylvania, Delaware, Maryland, DC, Virginia\nDescription: Come meet others currently living or from mid-Atlantic. You traveled far to get here and so did they!  \n . . Find out where they live. Look for someone who live(d) close to you. What liberty events they do/did there. What events are you looking forward to this week? Make plans to meet again at another event, and perhaps when you get back home.”\n: \nWhen: Wed, 11:30A _(30m)\nWhere: FSP: Free State Live Stage, Pennisula\nNote: Note: We'll have US Regional meetings Wed morning -> early afternoon. If you're from multiple states, consider coming to other meetups.","location":"FSP","startDatetime":"2023-06-21T15:30:00Z","endDatetime":"2023-06-21T16:00:00Z","timestamp":"2023-04-30T22:11:16Z"},{"summary":"<b>South Meetup: FL/GA/AL/SC/MS/NC/WV/TN/KY/LA/TX/AR</b>  [FSP]","description":"For Whom: If you live in, once lived in, or have moved from North Carolina, South Carolina, Georgia, Florida, West Virginia , Kentucky, Tennessee, Alabama, Louisana, Mississippi, Arkansas, Texas.\nDescription: Come meet others currently living or from the South. You traveled far to get here and so did they!  \n . . Find out where they live. Look for someone who live(d) close to you. What liberty events they do/did there. What events are you looking forward to this week? Make plans to meet again at another event, and perhaps when you get back home.”\n: \nWhen: Wed, 12:00P _(30m)\nWhere: FSP: Free State Live Stage, Pennisula\nNote: We'll have regional meetings Wed morning -> early afternoon. If you're from multiple states, consider coming to other meetups.","location":"FSP","startDatetime":"2023-06-21T16:00:00Z","endDatetime":"2023-06-21T16:30:00Z","timestamp":"2023-04-30T22:11:16Z"},{"summary":"<b>MidWest: MI/OH/IL/IN/WI/MN/IA/MO/SD/ND/KS/NE/OK/CO</b>  [FSP]","description":"For Whom: If you ever lived in MI/OH/IL/IN/WI/MN/IA/MO/SD/ND/KS/NE/OK/CO\nDescription: Come meet others currently living or from the midWest. You traveled far to get here and so did they!  \n . . Find out where they live. Look for someone who live(d) close to you. What liberty events they do/did there. What events are you looking forward to this week? Make plans to meet again at another event, and perhaps when you get back home.”\n: \nWhen: Wed, 12:30P _(30m)\nWhere: FSP: Free State Live Stage, Pennisula\nNote: We'll have regional meetings Wed morning -> early afternoon. If you're from multiple states, consider coming to other meetups.","location":"FSP","startDatetime":"2023-06-21T16:30:00Z","endDatetime":"2023-06-21T17:00:00Z","timestamp":"2023-04-30T22:11:16Z"},{"summary":"<b>West Meetup: CA/WA/OR/NV/ID/UT/MT/WY/AZ/NM/HI/Al</b>  [FSP]","description":"For Whom: If you live in, once lived in, or have moved from California, Oregon, Washington, Idaho, Nevada, Utah, Montana, Wyoming, Arizona, New Mexico, Hawaii, Alaska\nDescription: Come meet others currently living or from the West. You traveled far to get here and so did they!  \n . . Find out where they live. Look for someone who live(d) close to you. What liberty events they do/did there. What events are you looking forward to this week? Make plans to meet again at another event, and perhaps when you get back home.”\n: \nWhen: Wed, 1:00P _(30m)\nWhere: FSP: Free State Live Stage, Pennisula\nNote: We'll have US regional meetings Wed morning -> early afternoon. If you're from multiple states, consider coming to other meetups.","location":"FSP","startDatetime":"2023-06-21T17:00:00Z","endDatetime":"2023-06-21T17:30:00Z","timestamp":"2023-04-30T22:11:16Z"},{"summary":"<b>Foreign Meetup: All countries outside US & Canada</b>  [FSP]","description":"For Whom: If you live in, once lived in, or have moved from a foreign country other than Canada.\nDescription: Come and say 'Bonjour', 'привет\", etc to others currently living or from the midWest. You traveled far to get here and so did they!  \n . . Find out where they live. Look for someone who live(d) close to you. What liberty events they do/did there. What events are you looking forward to this week? Make plans to meet again at another event, and perhaps when you get back home.”\"\n: \nWhen: Wed, 1:30P _(30m)\nWhere: FSP: Free State Live Stage, Pennisula\nNote: We'll have regional meetings Wed morning -> early afternoon. If you're from multiple states, consider coming to other meetups.","location":"FSP","startDatetime":"2023-06-21T17:30:00Z","endDatetime":"2023-06-21T18:00:00Z","timestamp":"2023-04-30T22:11:16Z"},{"summary":"<b>AMA with Jason Sorens & Mark Warden</b> Mrs Kin [FSP]","description":"For Whom: Visitors and newcomers curious about the Free State Project\nDescription: As a graduate student Jason Sorens wrote the article about libertarian concentration that sparked a movement called the Free State Project. Mark Warden was an early mover and through Porcupine Real Estate has helped many others follow him. Now they are both serving on the FSP board. Come with your questions!!\nModerator: Mrs Kin. <a href=\"https://www.cato.org/sites/cato.org/files/styles/bio_picture_desktop_3x/public/authors/crops/barcelona-cropped.jpg?itok=i_9t4HC2\"> Image </a>\nWhen: Wed, 2:00P _(60m)\nWhere: FSP: Free State Live Stage, Pennisula","location":"FSP","startDatetime":"2023-06-21T18:00:00Z","endDatetime":"2023-06-21T19:00:00Z","timestamp":"2023-04-30T22:11:16Z"},{"summary":"<b>Free State Live </b> Justin O'Donnell [FSP]","description":"For Whom: Free State Live Podcast Listeners\nDescription: Join Justin, Carla, Jeremy, Kevin, and Bill live from PorcFest for their weekly roundup on what's going on with The Free State Project in the Live Free or Die state of New Hampshire! \nPanelist: Justin O'Donnell\nWhen: Fri, 4:00P _(60m)\nWhere: FSP: Free State Live Stage, Pennisula\n<a href=\"https://www.youtube.com/@FreeStateProjectNH/podcasts\">More Info </a>","location":"FSP","startDatetime":"2023-06-23T20:00:00Z","endDatetime":"2023-06-23T21:00:00Z","timestamp":"2023-04-30T22:11:16Z"},{"summary":"<b>Welcome to PorcFest</b> Mrs.Kin [FSP]","description":"For Whom: First time attendees\nDescription: Feeling excited, and a little overwhelmed, by your first PorcFest? Wondering what's going on and where to go? Drop in and discover how to get the most out of your weekend! \nFacilitator: Mrs.Kin, Free State Project In-State Operations Director. <a href=\"porcfest.com\"> Website </a>\nWhen: Thu, 11:00A _(30m)\nWhere: FSP: Free State Live Stage, Pennisula","location":"FSP","startDatetime":"2023-06-22T15:00:00Z","endDatetime":"2023-06-22T15:30:00Z","timestamp":"2023-04-30T22:11:16Z"},{"summary":"<b>Welcome to PorcFest!</b> Mrs.Kin [FSP]","description":"For Whom: First time attendees\nDescription: Feeling excited, and a little overwhelmed, by your first PorcFest? Wondering what's going on and where to go? Drop in and discover how to get the most out of your weekend! \nFacilitator: Mrs.Kin, Free State Project In-State Operations Director\nWhen: Fri, 11:00A _(30m)\nWhere: FSP: Free State Live Stage, Pennisula\n<a href=\"porcfest.com\">More Info </a>","location":"FSP","startDatetime":"2023-06-23T15:00:00Z","endDatetime":"2023-06-23T15:30:00Z","timestamp":"2023-04-30T22:11:16Z"},{"summary":"<b>Welcome to PorcFest!</b> Mrs.Kin [FSP]","description":"For Whom: First time attendees\nDescription: Feeling excited, and a little overwhelmed, by your first PorcFest? Wondering what's going on and where to go? Drop in and discover how to get the most out of your weekend! \nFacilitator: Mrs.Kin, Free State Project In-State Operations Director\nWhen: Sat, 11:00A _(30m)\nWhere: FSP: Free State Live Stage, Pennisula\nNote: Check out PorcInfo [INFO] for more awesome tips!\n<a href=\"porcfest.com\">More Info </a>","location":"FSP","startDatetime":"2023-06-24T15:00:00Z","endDatetime":"2023-06-24T15:30:00Z","timestamp":"2023-04-30T22:11:16Z"},{"summary":"<b>Property as Self-Ownership</b> Dennis Pratt [101]","description":"For Whom: Concerned with arguments that you don't really own \"that\"?  Believe that maybe it would be better if everyone owned everything?  Confused as to how things are \"distributed\"?\nDescription: Authoritarians insist that you do not have full and exclusive use of any property -- their rulers always have a superior ownership right, such that can tax, regulate, and over-rule you. Nonlibertarians don't see a problem with this. \n. . . What is the ethical derivation for property rights?  When is property truly yours and why is it yours?  When is it your rulers, or \"the people's\"? To what extent may you protect your property? Libertarian thought problems on property.\nSpeaker: Dennis Pratt, Writing primarily about libertarian ethics, Dennis became the number 1 writer on libertarian topics on the competitive intellectual essay site Quora, before he was de-platformed.\n. . . By then, he had migrated to the Free State. He threw himself into creating communities within the Free State. Dennis founded SWELL, The SHELL liberty community center, the Independence Inn, and the Free State liberty bus tours. He is spearheading the formation of a necklace of liberty community centers throughout the state.\n. . . Dennis is the NH Liberty Activist of the Year, and was this year's NH Liberty Foum Keynote Speaker. His passion is explaining the beauty of libertarian ethics to anyone who will listen.\n. . . Dennis also plays as your Chef de Village for PorcFest 2023 (2022, 2021) and has volunteered coordinated PorcFest for the last five years. This is his last year and will be joining you in 2024 as just another attendee.. <a href=\"https://twitter.com/DennisPrattFree\"> Website </a>. <a href=\"https://www.nhlibertyforum.com/images/speakers/Dennis_Pratt-e6842a6532f05875e4f99145c8123f14.png?vsn=d\"> Image </a>\nWhen: Thu, 11:00A _(60m)\nWhere: 101: Liberty 101, OfficeBld\nNote: Once you correctly understand how to derive property rights, you will never get confused by socialists'' sophism again.\n<a href=\"https://www.quora.com/Libertarians-What-gives-me-a-right-to-my-property/answer/Dennis-Pratt-3\">More Info </a>","location":"101","startDatetime":"2023-06-22T15:00:00Z","endDatetime":"2023-06-22T16:00:00Z","timestamp":"2023-04-30T22:11:16Z"},{"summary":"<b>What Is a Libertarian?</b> Dennis Pratt [101]","description":"For Whom: New to libertarianism? Confused by its different forms? Unclear where you fit? Would like an overview of the different types of libertarians? Think that there is only one type of true libertarian? Come explore the multi-dimensional world of libertarianism -- what we have in common and where we differ.\n\nDescription: Throughout the campground you'll hear attendees refer to their beliefs using different terms.. What do they mean? What do these terms have in common and how do they differ, and why do the differences matter?\n. . . Several dimensions distinguish libertarians from one another. This intro class will go through the main dimensions that differentiate libertarians, what the alternative beliefs are, and the rationales behind those beliefs, and what (few things) we can say unifies libertarianism. This should rationalize for you an ethical, cultural, and political movement that can otherwise seem chaotic, especially at a festival like PorcFest, which attracts so many different types of libertarians.\nSpeaker: Dennis Pratt, Writing primarily about libertarian ethics, Dennis became the number 1 writer on libertarian topics on the competitive intellectual essay site Quora, before he was de-platformed.\n. . . By then, he had migrated to the Free State. He threw himself into creating communities within the Free State. Dennis founded SWELL, The SHELL liberty community center, the Independence Inn, and the Free State liberty bus tours. He is spearheading the formation of a necklace of liberty community centers throughout the state.\n. . . Dennis is the NH Liberty Activist of the Year, and was this year's NH Liberty Foum Keynote Speaker. His passion is explaining the beauty of libertarian ethics to anyone who will listen.\n. . . Dennis also plays as your Chef de Village for PorcFest 2023 (2022, 2021) and has volunteered coordinated PorcFest for the last five years. This is his last year and will be joining you in 2024 as just another attendee.. <a href=\"https://mobile.twitter.com/DennisPrattFree\"> Website </a>. <a href=\"https://www.fsp.org/wp-content/uploads/2019/03/Voluntaryist-Heart-only.jpg\"> Image </a>\nWhen: Tue, 3:00P _(60m)\nWhere: 101: Liberty 101, OfficeBld\nNote: There is a regular presentation each day about libertarianism in the Liberty 101. Take the stairs beside the Arcade.\n<a href=\"https://www.quora.com/Myself-being-a-young-libertarian-could-someone-tell-me-about-anarcho-capitalism-and-compare-it-with-other-branches-of-libertarianism/answer/Dennis-Pratt-3\">More Info </a>","location":"101","startDatetime":"2023-06-20T19:00:00Z","endDatetime":"2023-06-20T20:00:00Z","timestamp":"2023-04-30T22:11:16Z"},{"summary":"<b>Why is NH the successful libertarian movement?</b> Dennis Pratt [101]","description":"For Whom: If you are unclear why libertarianism has failed in the past and why it seems to be uniquely succeeding in New Hampshire.\nDescription: Libertarianism - the movement to free individuals to be their own person, and not a slave to any ruler - has been dreamt of, but hardly ever achieved.  What have been the main ways that it has tried to be instituted, why have these failed, and what is so different about what the Free State Project is doing in New Hampshire?  What challenges and successes are we having here, and how does that bode for the future?\nSpeaker: Dennis Pratt, Writing primarily about libertarian ethics, Dennis became the number 1 writer on libertarian topics on the competitive intellectual essay site Quora, before he was de-platformed.\n. . . By then, he had migrated to the Free State. He threw himself into creating communities within the Free State. Dennis founded SWELL, The SHELL liberty community center, the Independence Inn, and the Free State liberty bus tours. He is spearheading the formation of a necklace of liberty community centers throughout the state.\n. . . Dennis is the NH Liberty Activist of the Year, and was this year's NH Liberty Foum Keynote Speaker. His passion is explaining the beauty of libertarian ethics to anyone who will listen.\n. . . Dennis also plays as your Chef de Village for PorcFest 2023 (2022, 2021) and has volunteered coordinated PorcFest for the last five years. This is his last year and will be joining you in 2024 as just another attendee.. <a href=\"https://mobile.twitter.com/DennisPrattFree\"> Website </a>. <a href=\"https://www.fsp.org/wp-content/uploads/2019/03/Voluntaryist-Heart-only.jpg\"> Image </a>\nWhen: Sat, 11:00A _(60m)\nWhere: 101: Liberty 101, OfficeBld\nNote: There is a regular presentation each day about libertarianism in the Liberty 101. Take the stairs beside the Arcade.","location":"101","startDatetime":"2023-06-24T15:00:00Z","endDatetime":"2023-06-24T16:00:00Z","timestamp":"2023-04-30T22:11:16Z"},{"summary":"<b>Abortion, Bigotry, Suicide: 3 tough cases</b> Dennis Pratt [101]","description":"For Whom: Are you curious how robust libertarian ethics is? Where are its limitations and strengths? People who want to practice exercising libertarian ethics on the toughest questions.  interested in end of life? in the abortion issue? in libertarian ethics? Are you curious how libertarian ethics addresses controversial issues?\nDescription: How does libertarian ethics guide us in tough cases like abortion, suicide and bigotry? We'll look at these big issues through the prism of libertarian ethics, and discuss what is the \"libertarian answer\", if there is one!\nSpeaker: Dennis Pratt, Writing primarily about libertarian ethics, Dennis became the number 1 writer on libertarian topics on the competitive intellectual essay site Quora, before he was de-platformed.\n. . . By then, he had migrated to the Free State. He threw himself into creating communities within the Free State. Dennis founded SWELL, The SHELL liberty community center, the Independence Inn, and the Free State liberty bus tours. He is spearheading the formation of a necklace of liberty community centers throughout the state.\n. . . Dennis is the NH Liberty Activist of the Year, and was this year's NH Liberty Foum Keynote Speaker. His passion is explaining the beauty of libertarian ethics to anyone who will listen.\n. . . Dennis also plays as your Chef de Village for PorcFest 2023 (2022, 2021) and has volunteered coordinated PorcFest for the last five years. This is his last year and will be joining you in 2024 as just another attendee.. <a href=\"https://mobile.twitter.com/DennisPrattFree\"> Website </a>. <a href=\"https://www.fsp.org/wp-content/uploads/2019/03/Voluntaryist-Heart-only.jpg\"> Image </a>\nWhen: Wed, 3:00P _(60m)\nWhere: 101: Liberty 101, OfficeBld\nNote: There is a regular presentation each day about libertarianism in the Liberty 101. Take the stairs beside the Arcade.","location":"101","startDatetime":"2023-06-21T19:00:00Z","endDatetime":"2023-06-21T20:00:00Z","timestamp":"2023-04-30T22:11:16Z"},{"summary":"<b>NBC Docuseries: The Free State Project</b>  [101]","description":"For Whom: People interested in the Free State Project, in Main Stream Media press coverage of libertarianism, and in long-form documentaries of controversial subjects\nDescription: NBC Boston embedded itself with the Free State Project for eight months, including during PorcFest 2022. The result was an eleven episode documentary-series which has enjoyed critical, libertarian, Porcupine, and authoritarian acclaim (not an easy task).\n. . . \"Life, Liberty, and the Pursuit of New Hampshire follows a libertarian political migration known as the Free State Project. Twenty years ago, one man penned a manifesto encouraging 20,000 libertarians to sign a pledge and move to the Granite State for more freedom. Now “The Free State Project” is shaking up politics and communities in New Hampshire and growing in strength and numbers.\"\n: \nWhen: Wed, 6:00P (180m)\nWhere: 101: Liberty 101, OfficeBld\nNote: The entire eleven episode docu-series will be played on Wed evening at Liberty 101.\nThree episodes will be repeated Friday 6P at the Pavilion followed by\na panel discussion with the producers at 7P.\n<a href=\"https://www.nbcboston.com/news/local/coming-soon-life-liberty-and-the-pursuit-of-new-hampshire/2961708/\">More Info </a>","location":"101","startDatetime":"2023-06-21T22:00:00Z","endDatetime":"2023-06-22T01:00:00Z","timestamp":"2023-04-30T22:11:16Z"},{"summary":"<b>*New* FREE STATE Documentary - Screening of Scene</b> Reinita Sussman [101]","description":"For Whom: People interested in a new documentary being made about the Free State Project, potential investors, people who love documentaries, lovers of New Hampshire, freedom fighters. \nDescription: Come see a never before seen section of the upcoming documentary, \"FREE STATE\". Visit freestatedoc.com to view a trailer and donate to the documentary. \nSpeaker: Reinita Sussman, Reinita Susman in a documentarian and recent mover to New Hampshire. She produced a documentary in 2021 about lockdowns in southern CA. Her documentary about the Free State is meant as the antidote to the dark and sad story of her previous documentary. . <a href=\"freestatedoc.com\"> Website </a>\nWhen: Thu, 6:00P _(90m)\nWhere: 101: Liberty 101, OfficeBld\nNote: Please come for a sneak peak!\n<a href=\"freestatedoc.com\">More Info </a>","location":"101","startDatetime":"2023-06-22T22:00:00Z","endDatetime":"2023-06-22T23:30:00Z","timestamp":"2023-04-30T22:11:16Z"},{"summary":"<b>NHLA--Eternally Vigilant</b> Melissa Creem Chair NHLA [101]","description":"For Whom: Those who are curious at the nuts and bolts of HOW the Free State has become more and more free while the Authoritarian-49 have slipped more and more into tyranny. Those who are ready to help make New Hampshire even more free.\nDescription: The New Hampshire Liberty Alliance is an organization run by volunteers like you, that review almost every bill going through the New Hampshire State House, for its impact on liberty, advises legislators whether bills are pro- or anti- human freedom, and rates NH legislators to let voters know which are trying to free them versus enslave them. If the price of Liberty is eternal vigilance, then NHLA intends to be eternally vigilant!\nSpeaker: Melissa Creem Chair NHLA, Chair of NHLA\nWhen: Sat, 12:00P _(60m)\nWhere: 101: Liberty 101, OfficeBld\n<a href=\"https://www.nhliberty.org/about/\">More Info </a>","location":"101","startDatetime":"2023-06-24T16:00:00Z","endDatetime":"2023-06-24T17:00:00Z","timestamp":"2023-04-30T22:11:16Z"},{"summary":"<b>AFP-NH: Not Your Parents' AFP</b> Ross Connolly [101]","description":"For Whom: Interested in how to get major liberty legislation through New Hampshire\nDescription: Americans for Prosperity provides training, support, inspiration, and guidance to get some of the biggest liberty initiatives in front of and passed by NH legislators, and to ensure those legislators are some of the biggest liberty activists in North America.\n\nSpeaker: Ross Connolly, Ross currently serves as the Northeast Regional State Director for AFP.  He oversees operations and strategy in 9 east coast states. He formerly served as Deputy State Director of Americans for Prosperity-New Hampshire. Ross is a native Granite Stater; born and raised in Hollis. He is a graduate of Bishop Guertin High School in Nashua. Ross is an alumnus of the University of Rhode Island in Kingston, RI. In his former role, Ross oversaw AFP-NH’s efforts to reform our occupational licensing regime, protect Granite Staters’ digital privacy, spur innovation through regulatory relief, and reform our criminal justice system.\n. <a href=\"https://twitter.com/ConnollyRoss\"> Website </a>. <a href=\"https://bloximages.newyork1.vip.townnews.com/unionleader.com/content/tncms/assets/v3/editorial/3/05/3051ab5b-27df-5030-b326-324322cd8f89/60ca1089d321d.image.jpg\"> Image </a>\nWhen: Thu, 2:00P _(60m)\nWhere: 101: Liberty 101, OfficeBld\n<a href=\"https://americansforprosperity.org/\">More Info </a>","location":"101","startDatetime":"2023-06-22T18:00:00Z","endDatetime":"2023-06-22T19:00:00Z","timestamp":"2023-04-30T22:11:16Z"},{"summary":"<b>Why Porcupines Run as Republicans</b> Ian Underwood [101]","description":"For Whom: Liberty folks who want to get involved in the political system, especially in NH. \nDescription: Looking to make changes in the law, but scared of the \"Republican\" label that many Porcupine legislators use? \n. . . Learn why even the hardest core libertarians in NH do not -- and should not -- shy away from running as \"Republicans\".\nSpeaker: Ian Underwood, Ian Underwood has been a planetary scientist and artificial intelligence researcher for NASA, the director of the renowned Ask Dr. Math service, co-founder of Bardo Farm and Shaolin Rifleworks, and a popular speaker at liberty-related events. He is the author of a series of Bare Minimum Books, which expose the simplicity underlying complex issues like law, education, and gun rights. He lives in Croydon, New Hampshire.. <a href=\"https://www.bareminimumbooks.com/\"> Website </a>\nWhen: Wed, 11:00A _(60m)\nWhere: 101: Liberty 101, OfficeBld","location":"101","startDatetime":"2023-06-21T15:00:00Z","endDatetime":"2023-06-21T16:00:00Z","timestamp":"2023-04-30T22:11:16Z"},{"summary":"<b>A Free Marketeer's Guide to Economic Data</b> Gene Epstein [101]","description":"For Whom: Fans of free market economics; liberty lovers & investors who care about the state of the economy & concerns that workers are getting shafted.. \nDescription: Though use of official data, I puncture various myths about the state of the economy (like what caused the price inflation).\nSpeaker: Gene Epstein, In 2018. Gene stepped down from a 25-year stint as Economics & Books Editor at Barron's Financial Weekly, where he wrote a widely-followed weekly column called \"Economic Beat.\" Since then, Gene has been actively directing his debate society, www.thesohoforum.org, maintaining an active Twitter account @genesohoforum, writing articles and doing frequent interviews on many libertarian podcasts. . <a href=\"https://images.squarespace-cdn.com/content/v1/58ac6b92414fb5aa5de25b89/1540759502298-Z8YOG2CTZ4PMJF87R4DR/HeadShot_Square.jpg?format=1000w\"> Image </a>\nWhen: Sat, 10:00A _(60m)\nWhere: 101: Liberty 101, OfficeBld","location":"101","startDatetime":"2023-06-24T14:00:00Z","endDatetime":"2023-06-24T15:00:00Z","timestamp":"2023-04-30T22:11:16Z"},{"summary":"<b>Free State Food Network: Securing Our Own Food</b> Stephen Nass [101]","description":"For Whom: People interested in eating food, even when the masses are starving\nDescription: We're pushing back on government interference in New Hampshire, but in the food industry we have a long way to go. We all saw how in 2020 the state shut down businesses and tasked them with arbitrary rules and fines. For restaurants and food producers this level of bureaucracy is nothing new. Learn how we can team up to help free our farmers, chefs and food professionals in our Free State quest for liberty.\n\n\n\nSpeaker: Stephen Nass, Restaurant owner, chef, and one of the founders behind the Shell community center.. <a href=\"freestatefood.net\"> Website </a>. <a href=\"https://freestatefood.net/wp-content/uploads/2021/08/cropped-Copy-of-FSFN-Logo.png\"> Image </a>\nWhen: Wed, 4:00P _(60m)\nWhere: 101: Liberty 101, OfficeBld\n<a href=\"https://freestatefood.net/\">More Info </a>","location":"101","startDatetime":"2023-06-21T20:00:00Z","endDatetime":"2023-06-21T21:00:00Z","timestamp":"2023-04-30T22:11:16Z"},{"summary":"<b>The SHELL: A Liberty Community Center</b> Stephen, Scott [101]","description":"For Whom: People who feel that liberty is lonely, because in the Free State, it ain't.\n\nDescription: The SHELL opened right as CoVid lockdown happened -- two weeks later 70 Free Staters were attending a Robbie The Fire comedy night. It has become the Free State's premiere liberty clubhouse, with more events than all the other clubhouses combined. \n. . . We'll describe The SHELL, its history, its importance to the Free State, and how it, and other Free State liberty clubhouses like it, are a key reason why you should be moving here.\n\n: Stephen\n: Scott, \nWhen: Thu, 3:00P _(60m)\nWhere: 101: Liberty 101, OfficeBld\n<a href=\"shellnh.org\">More Info </a>","location":"101","startDatetime":"2023-06-22T19:00:00Z","endDatetime":"2023-06-22T20:00:00Z","timestamp":"2023-04-30T22:11:16Z"},{"summary":"<b>Defend the Guard: Uphold the Constitution</b> Derek Proux [101]","description":"For Whom: Military. Anti-War. Free Staters. People concerned with overbearing Federal Government being able to bully states. How to nullify Fed gov.\n\nDescription: What can a Free State do to impede an overbearing Federal Government? Nullification.\n. . . Defend the Guard is the just one example of the type of nullification that we would execute to stop government over-reach -- in this case, the warfare state.\n. . . Defend the Guard says that the state will not contribute its National Guard to undeclared overseas. Learn the history, current status, and prospects of this historic nullification.\nSpeaker: Derek Proux\nWhen: Fri, 2:00P _(60m)\nWhere: 101: Liberty 101, OfficeBld","location":"101","startDatetime":"2023-06-23T18:00:00Z","endDatetime":"2023-06-23T19:00:00Z","timestamp":"2023-04-30T22:11:16Z"},{"summary":"<b>A Not-So-Brief History of the Free State</b> Carla Gericke [101]","description":"For Whom: People new to the Free State, or who don't know how we got here.\nDescription: Dirty laundry, you say? Who has better behind-the-scenes scoops than Queen Quill herself? Between major milestones and major dramas, the story of the Free State Project is a story of human action, and how a group of tireless volunteers took a quaint idea and turned it into the world's most historic movement for freedom in the world today. \nSpeaker: Carla Gericke, Carla is an early mover and OG, taking executive and volunteer roles within the FSP since 2008, as well as leading efforts to make New Hampshire more free by serving on boards and running for office. Carla is affectionately known as ‘Queen Quill’, is the Chair of the Free State Project, lead producer of numerous PorcFests, and constant volunteer. She spearheads innumerable liberty efforts in the Free State, including issues relating to 1st, 2nd, 4th and 10th Amendment issues, government accountability/transparency, and how to Live Free and Thrive!. <a href=\"https://www.carlagericke.com/\"> Website </a>\nWhen: Tue, 2:00P _(60m)\nWhere: 101: Liberty 101, OfficeBld\n<a href=\"https://www.carlagericke.com/\">More Info </a>","location":"101","startDatetime":"2023-06-20T18:00:00Z","endDatetime":"2023-06-20T19:00:00Z","timestamp":"2023-04-30T22:11:16Z"},{"summary":"<b>Zoning and the Housing Crisis</b> Jason Sorens [101]","description":"For Whom: People interested in the housing market, anyone interested in local government, anyone who wants to help NH rise in the freedom rankings\nDescription: How are zoning regulations causing a scarcity of housing in much of the country? Could the free market provide affordable housing to all? What are the alternatives to zoning, and should we try to abolish zoning completely?\nSpeaker: Jason Sorens\nWhen: Thu, 10:00A _(60m)\nWhere: 101: Liberty 101, OfficeBld","location":"101","startDatetime":"2023-06-22T14:00:00Z","endDatetime":"2023-06-22T15:00:00Z","timestamp":"2023-04-30T22:11:16Z"},{"summary":"<b>Introduction to Economics</b> Ryan Yonk [101]","description":"For Whom: This is an introductory session for attendees interesting the ideas associated withal a free and prosperous society. \nDescription: Economics for the free stater— How good economic understanding supports liberty.\nSpeaker: Ryan Yonk, Libertarian economist affiliated with AIER\nWhen: Tue, 4:00P _(60m)\nWhere: 101: Liberty 101, OfficeBld","location":"101","startDatetime":"2023-06-20T20:00:00Z","endDatetime":"2023-06-20T21:00:00Z","timestamp":"2023-04-30T22:11:16Z"},{"summary":"<b>FDR's New Deal Reset</b> Robert E. Wright [101]","description":"For Whom: Anyone who wants to rid themselves of the notion that FDR and the New Deal did anything to help revive the national economy or help even the most vulnerable Americans.\nDescription: 2023 is the 90th anniversary of the New Deal put in place by \"that man in the White House.\" The standard story taught in government schools is akin to Soviet disinformation. Come to this session to learn the REAL DEAL about the New Deal, America's first Great Reset.\nSpeaker: Robert E. Wright, Wright is a published lyricist (Independent Review) as well as the author of Liberty Lost (AIER 2023) and 23 other liberty rockin' books.. <a href=\"https://www.aier.org/people/robert-e-wright/\"> Website </a>. <a href=\"https://www.aier.org/wp-content/webpc-passthru.php?src=https://www.aier.org/wp-content/uploads/2019/02/Robert-E-Wright.jpg&nocache=1\"> Image </a>\nWhen: Wed, 10:00A _(60m)\nWhere: 101: Liberty 101, OfficeBld\nNote: Bob promises a raucous rant grounded in his forthcoming book, FDR's Great Reset.\n<a href=\"https://www.aier.org/article/fdrs-raw-deal-for-african-americans/\">More Info </a>","location":"101","startDatetime":"2023-06-21T14:00:00Z","endDatetime":"2023-06-21T15:00:00Z","timestamp":"2023-04-30T22:11:16Z"},{"summary":"<b>ESG on the Chopping Block</b> Pete Earle [101]","description":"For Whom: Lovers of liberty, innovation, and free markets disturbed by the infection of corporate America by wokism. \nDescription: A look at some of the current moves being made against the spread of ESG in the corporate world. (Hint: We're winning!)\nSpeaker: Pete Earle, Economist who spent over 20 years in financial markets. <a href=\"https://www.aier.org/people/peter-c-earle/\"> Website </a>. <a href=\"https://www.aier.org/people/peter-c-earle/\"> Image </a>\nWhen: Fri, 10:00A _(60m)\nWhere: 101: Liberty 101, OfficeBld","location":"101","startDatetime":"2023-06-23T14:00:00Z","endDatetime":"2023-06-23T15:00:00Z","timestamp":"2023-04-30T22:11:16Z"},{"summary":"<b>Why Taxation is Literally Theft</b> Dan Taxation Is Theft Behrman [101]","description":"For Whom: If you even mildly dislike taxes.\nIf you love taxes and believe \"It's the price we voluntarily pay for society.\"\nDescription: You'll hear Porcupine libertarians often say, \"Taxation is Theft\". In the NH House, many state liberty [R] representatives will remind the Chair, \"Taxation is Theft\".  But is it? Why is it? And if it is, what can you do about it?\n. . . Dan Taxation Is Theft Behrman has toured the country as part of multiple presidential campaigns with his message, and he will explain why taxation is theft, how the IRS works, and how millions of people are legally avoiding the income tax.\nSpeaker: Dan Taxation Is Theft Behrman. <a href=\"https://TaxationIsTheft.info\"> Website </a>. <a href=\"https://taxationistheft.info/wp-content/uploads/2020/09/dan-behrman-for-governor-of-texas_540x.jpg\"> Image </a>\nWhen: Thu, 3:00P _(60m)\nWhere: 101: Liberty 101, OfficeBld\n<a href=\"https://taxationistheft.info\">More Info </a>","location":"101","startDatetime":"2023-06-22T19:00:00Z","endDatetime":"2023-06-22T20:00:00Z","timestamp":"2023-04-30T22:11:16Z"},{"summary":"<b>Historic Lies My Teacher Told Me</b> Keith Knight [101]","description":"For Whom: Anyone interested in combatting the statism of academia.\nDescription: 10 historical, economics, and philosophical lies I learned from elementary school to college. \nSpeaker: Keith Knight, My primary motive for starting my podcast was to give people access to a free alternative to college education regarding history, economics, politics, and philosophy. . <a href=\"https://libertarianinstitute.org/author/keith-knight/\"> Website </a>\nWhen: Fri, 11:00A _(60m)\nWhere: 101: Liberty 101, OfficeBld\n<a href=\"https://libertarianinstitute.org/author/keith-knight/\">More Info </a>","location":"101","startDatetime":"2023-06-23T15:00:00Z","endDatetime":"2023-06-23T16:00:00Z","timestamp":"2023-04-30T22:11:16Z"},{"summary":"<b>Privacy: How to reclaim your digital life</b> Naomi Brockwell [101]","description":"For Whom: This presentation is for anyone who wants to learn how to be more empowered in their digital life, and better understand the technology that they use. It's for those who understand why privacy is essential for a free society, but who don't know where to begin in their privacy journey.\nDescription: Naomi Brockwell is a tech journalist, and creator of \"NBTV.media\", a tech channel with 700k subscribers across platforms. In this presentation she'll walk people through how to reclaim control of their lives in the digital age. She'll go through basic and more advanced tools that people can use to take back their data, money, and free online expression.\n\nDate: Friday, 5pm\nLocation: Liberty 101 room (the old media room above the arcade)\nSpeaker: Naomi Brockwell\nLeader: Naomi Brockwell, Naomi Brockwell is a tech journalist, and creator of \"NBTV.media\".\n\nNBTV teaches people how to reclaim control of their lives in the digital age. The channel gives people the tools they need to take back their data, money, and free online expression. \n\nFrom 2013 - 2015 she worked as a policy associate at the New York Bitcoin Center. From 2015 - 2021 she has worked as a producer for 19-times Emmy-Award-Winning Journalist John Stossel. From 2021 to 2022 she hosted the CoinDesk series “Break it Down”, and the CoinDesk daily show “The Hash”.\n\nNaomi was a producer for the 2015 feature documentary Bitcoin: The End of Money as We Know It (Best International Documentary, Anthem Film Festival; Winner of Special Jury Prize, Amsterdam Film Festival), and producer of the 2018 award-winning documentary about the housing crash The Bubble.\n\nNaomi is the co-founder of “The Soho Forum”, a NY debate series. She is on the Advisory Council at the “Mannkal Economic Education Foundation”, and is author of “Beginner's Introduction To Privacy”, and the children's book “Billy's Bitcoin”.. <a href=\"NBTV.media\"> Website </a>. <a href=\"https://m.media-amazon.com/images/S/amzn-author-media-prod/ockcs7k43oovh301vo09s7a2mn._SY600_.jpg\"> Image </a>\nWhen: Fri, 5:00P _(60m)\nWhere: 101: Liberty 101, OfficeBld\n<a href=\"NBTV.media\">More Info </a>","location":"101","startDatetime":"2023-06-23T21:00:00Z","endDatetime":"2023-06-23T22:00:00Z","timestamp":"2023-04-30T22:11:16Z"},{"summary":"<b>ReopenNH-RebuildNH. Opposing Covid tyranny-future </b> Melissa Balsek [101]","description":"For Whom: Activists, medical freedom, anti-covid fascism, reducing bureaucracy\nDescription: A 101 on the grassroots organization RebuildNH. How they began opposing Covid tyranny and evolved.\nSpeaker: Melissa Balsek, Executive Director RebuildNH. <a href=\"www.rebuildnh.com\"> Website </a>\nWhen: Fri, 2:00P _(60m)\nWhere: 101: Liberty 101, OfficeBld\n<a href=\"www.rebuildnh.com\">More Info </a>","location":"101","startDatetime":"2023-06-23T18:00:00Z","endDatetime":"2023-06-23T19:00:00Z","timestamp":"2023-04-30T22:11:16Z"},{"summary":"<b>SoapBox Idol Audition</b> Carla Gericke [QQ]","description":"For Whom: Anyone with a really strong belief about some aspect of liberty in the world, which they can passionately express in three minutes, and which they would like to share with the entire festival in our concluding event on Saturday.\nDescription: The SoapBox Idol competition is the penultimate event of PorcFest. It ends our formal program on Saturday afternoon. And it's your opportunity to share your three minute rant for freedom and against tyranny. But so great is the desire of our Porcupines and Porcupine-wannabes to cry out for freedom, that we hold auditions at which you practice your rant with Queen Quill. The Queen is looking for an assortment of rant topics and of ranting Porcupines to entertain and inspire us on Saturday, and she offers helpful advice. So, come share your piss and vinegar.\nQueen Quill: Carla Gericke, Carla designed, and has been organizing and moderating, the SoapBox Idol since its inception. A passionate speaker herself, who has wowed audiences and media with her rants for freedom, she seeks to give you a platform to let your inner freedom spirit cry out!\nWhen: Wed, 10:00A _(60m)\nWhere: QQ: Queen Quill Tent, Behind Green Cabin\nNote: Rants will be held Wed, Thur, Fri, and Sat at 10A at the Queen Quill tent. You MUST audition if you would like to rant on the soapbox Saturday night. Preference given to those who audition early!","location":"QQ","startDatetime":"2023-06-21T14:00:00Z","endDatetime":"2023-06-21T15:00:00Z","timestamp":"2023-04-30T22:11:16Z"},{"summary":"<b>Soapbox Idol Audition</b> Carla Gericke [QQ]","description":"For Whom: Anyone with a really strong belief about some aspect of liberty in the world, which they can passionately express in three minutes, and which they would like to share with the entire festival in our concluding event on Saturday.\nDescription: The SoapBox Idol competition is the penultimate event of PorcFest. It ends our formal program on Saturday afternoon. And it's your opportunity to share your three minute rant for freedom and against tyranny. But so great is the desire of our Porcupines and Porcupine-wannabes to cry out for freedom, that we hold auditions at which you practice your rant with Queen Quill. The Queen is looking for an assortment of rant topics and of ranting Porcupines to entertain and inspire us on Saturday, and she offers helpful advice. So, come share your piss and vinegar.\nQueen Quill: Carla Gericke, Carla designed, and has been organizing and moderating, the SoapBox Idol since its inception. A passionate speaker herself, who has wowed audiences and media with her rants for freedom, she seeks to give you a platform to let your inner freedom spirit cry out!\nWhen: Thu, 10:00A _(60m)\nWhere: QQ: Queen Quill Tent, Behind Green Cabin\nNote: Rants will be held Wed, Thur, Fri, and Sat at 10A at the Queen Quill tent. You MUST audition if you would like to rant on the soapbox Saturday night. Preference given to those who audition early!","location":"QQ","startDatetime":"2023-06-22T14:00:00Z","endDatetime":"2023-06-22T15:00:00Z","timestamp":"2023-04-30T22:11:16Z"},{"summary":"<b>Soapbox Idol Audition</b> Carla Gericke [QQ]","description":"For Whom: Anyone with a really strong belief about some aspect of liberty in the world, which they can passionately express in three minutes, and which they would like to share with the entire festival in our concluding event on Saturday.\nDescription: The SoapBox Idol competition is the penultimate event of PorcFest. It ends our formal program on Saturday afternoon. And it's your opportunity to share your three minute rant for freedom and against tyranny. But so great is the desire of our Porcupines and Porcupine-wannabes to cry out for freedom, that we hold auditions at which you practice your rant with Queen Quill. The Queen is looking for an assortment of rant topics and of ranting Porcupines to entertain and inspire us on Saturday, and she offers helpful advice. So, come share your piss and vinegar.\nQueen Quill: Carla Gericke, Carla designed, and has been organizing and moderating, the SoapBox Idol since its inception. A passionate speaker herself, who has wowed audiences and media with her rants for freedom, she seeks to give you a platform to let your inner freedom spirit cry out!\nWhen: Fri, 10:00A _(60m)\nWhere: QQ: Queen Quill Tent, Behind Green Cabin\nNote: Rants will be held Wed, Thur, Fri, and Sat at 10A at the Queen Quill tent. You MUST audition if you would like to rant on the soapbox Saturday night. Preference given to those who audition early!","location":"QQ","startDatetime":"2023-06-23T14:00:00Z","endDatetime":"2023-06-23T15:00:00Z","timestamp":"2023-04-30T22:11:16Z"},{"summary":"<b>Soapbox Idol Audition</b> Carla Gericke [QQ]","description":"For Whom: Anyone with a really strong belief about some aspect of liberty in the world, which they can passionately express in three minutes, and which they would like to share with the entire festival in our concluding event on Saturday.\nDescription: The SoapBox Idol competition is the penultimate event of PorcFest. It ends our formal program on Saturday afternoon. And it's your opportunity to share your three minute rant for freedom and against tyranny. But so great is the desire of our Porcupines and Porcupine-wannabes to cry out for freedom, that we hold auditions at which you practice your rant with Queen Quill. The Queen is looking for an assortment of rant topics and of ranting Porcupines to entertain and inspire us on Saturday, and she offers helpful advice. So, come share your piss and vinegar.\nQueen Quill: Carla Gericke, Carla designed, and has been organizing and moderating, the SoapBox Idol since its inception. A passionate speaker herself, who has wowed audiences and media with her rants for freedom, she seeks to give you a platform to let your inner freedom spirit cry out!\nWhen: Sat, 10:00A _(60m)\nWhere: QQ: Queen Quill Tent, Behind Green Cabin\nNote: Rants will be held Wed, Thur, Fri, and Sat at 10A at the Queen Quill tent. You MUST audition if you would like to rant on the soapbox Saturday night. Preference given to those who audition early!","location":"QQ","startDatetime":"2023-06-24T14:00:00Z","endDatetime":"2023-06-24T15:00:00Z","timestamp":"2023-04-30T22:11:16Z"},{"summary":"<b>PorcInfo Tent!!</b> Shanna Garry [INFO]","description":"For Whom: Porcfest Attendees looking for information and cool things\nDescription: Make sure to stop by the PorcInfo Tent, which will be right next door to Registration for all your Porcfest Informational Needs! There will be Information Ambassadors available daily to help answer questions and give guidance. This year we will also be partnering with featured New Hampshire vendors, so come back daily!\nOrganizer: Shanna Garry\nWhen: Mon, 10:00A (420m)\nWhere: INFO: PorcInfo, Peninsula\nNote: Reach out if you want to be an Information Ambassador or featured vendor!","location":"INFO","startDatetime":"2023-06-19T14:00:00Z","endDatetime":"2023-06-19T21:00:00Z","timestamp":"2023-04-30T22:11:16Z"},{"summary":"<b>Free Pancakes at the PorcuPint Hall</b> Tony Olsen [PINT]","description":"For Whom: Anyone who likes pancakes, especially people who believe in extreme levels of social & economic freedom, who believe that taxation is theft, and who want to leave the next generation with freedoms that were stolen from us before we were born.\nDescription: Tony Olsen brings pancakes and Freedom Haven project to the PorcuPint hall.\n. . . Just eat pancakes and socialize or discuss how the Free-Market at Freedom Haven project can benefit the next generation.\n. . . Come discover more about what today's high seas industries can offer all members of your families and support our marketing campaign if this is a path you would like for us to take. Help us reach our $2,000 marketing campaign goal for 2023.\n: Tony Olsen, Chief Architect: Tony Olsen, This guy loves making pancakes and loves meeting fellow pro-freedom people. <a href=\"FreedomHaven.org\"> Website </a>\nWhen: Thu, 12:00P (120m)\nWhere: PINT: Porcupints, Bingo\n<a href=\"FreedomHaven.org\">More Info </a>","location":"PINT","startDatetime":"2023-06-22T16:00:00Z","endDatetime":"2023-06-22T18:00:00Z","timestamp":"2023-04-30T22:11:16Z"},{"summary":"<b>Education Freedom Chat</b> Michelle Levell [Hive]","description":"For Whom: Parents/guardians of children age approx 5 to 16\nDescription: Join Michelle Levell, director of Granite State Home Educators (GSHE), for an open chat on all things about education freedom in NH. GSHE has extensive resources to help you maximize the freedom and flexibility of home education while minimizing government interference. We have tips to keep costs down and help you find your \"tribe\" and make new friends. Join Michelle on Friday 6/23 at noon and again on Saturday 6/24 at 1pm. Stop by her hub at RV site 118 Thursday through Sunday anytime you want to talk more.\nFacilitator: Michelle Levell, Michelle Levell has been active in state-level education issues and policy for nearly 20 years. She is the director and co-founder of Granite State Home Educators, an all-volunteer 501c4, statewide support organization with over 15,000 members. The GSHE website is widely considered the most extensive resource for New Hampshire homeschoolers with over 700 articles and nearly 50 pages. GSHE also manages seven different social media groups to support our community. Michelle has extensive experience as a volunteer-advocate working with legislators, national organizations, and grassroots activists on a wide range of education issues. She served as a full-time volunteer for the largest scholarship organization in the state for five years, helped launch a chartered public school, served on the board of a nonpublic school, and served on additional boards of directors for other NH-based nonprofits. She has first-hand experience with home education, online learning, gifted and 2e education, as well as private education. Her three children are now college graduates and employed in their chosen careers -- a public-school math teacher, a PhD candidate and research assistant in computational material science engineering, and another as a civil engineer.. <a href=\"https://granitestatehomeeducators.org/\"> Website </a>\nWhen: Fri, 12:00P _(60m)\nWhere: Hive: Anie's Hive, Bingo\n<a href=\"https://granitestatehomeeducators.org/\">More Info </a>","location":"Hive","startDatetime":"2023-06-23T16:00:00Z","endDatetime":"2023-06-23T17:00:00Z","timestamp":"2023-04-30T22:11:16Z"},{"summary":"<b>Education Freedom Chat</b> Michelle Levell [Hive]","description":"For Whom: Parents/guardians of children age approx 5 to 16\nDescription: Join Michelle Levell, director of Granite State Home Educators (GSHE), for an open chat on all things about education freedom in NH. GSHE has extensive resources to help you maximize the freedom and flexibility of home education while minimizing government interference. We have tips to keep costs down and help you find your \"tribe\" and make new friends. Join Michelle on Friday 6/23 at noon and again on Saturday 6/24 at 1pm. Stop by her hub at RV site 118 Thursday through Sunday anytime you want to talk more.\nFacilitator: Michelle Levell, Michelle Levell has been active in state-level education issues and policy for nearly 20 years. She is the director and co-founder of Granite State Home Educators, an all-volunteer 501c4, statewide support organization with over 15,000 members. The GSHE website is widely considered the most extensive resource for New Hampshire homeschoolers with over 700 articles and nearly 50 pages. GSHE also manages seven different social media groups to support our community. Michelle has extensive experience as a volunteer-advocate working with legislators, national organizations, and grassroots activists on a wide range of education issues. She served as a full-time volunteer for the largest scholarship organization in the state for five years, helped launch a chartered public school, served on the board of a nonpublic school, and served on additional boards of directors for other NH-based nonprofits. She has first-hand experience with home education, online learning, gifted and 2e education, as well as private education. Her three children are now college graduates and employed in their chosen careers -- a public-school math teacher, a PhD candidate and research assistant in computational material science engineering, and another as a civil engineer.. <a href=\"https://granitestatehomeeducators.org/\"> Website </a>\nWhen: Sat, 1:00P _(60m)\nWhere: Hive: Anie's Hive, Bingo","location":"Hive","startDatetime":"2023-06-24T17:00:00Z","endDatetime":"2023-06-24T18:00:00Z","timestamp":"2023-04-30T22:11:16Z"},{"summary":"<b>Porcupint Market- Children vending to serve you!</b> StephAnie Buzzell [PINT]","description":"For Whom: EVERYONE! Seriously though… ANYONE who wants to support the children of PorcFest as they learn the ropes of agorism should stop by this market. Don’t miss it! You’ll make a child’s day and may find something you love in the process!\nDescription: Come support our growing porcupines at the 3rd Annual PorcuPint Children's Market- Stop by the market to shop from our youngest entrepreneurs. Make a purchase for yourself, for a gift or just browse and pass on a word of encouragement! You never know what you'll be able to find at this creative market. Past endeavors have included: plant seedlings, garden gnomes, sweet treats, bug spray, painted rocks & crystals, crafts, and more!\n. . . (Have children at PorcFest who want to vend at this market? Set up is 10:30-11a. Children are encouraged to be creative with their wares)...\nOrganizer: StephAnie Buzzell\nWhen: Thu, 11:00A _(90m)\nWhere: PINT: Porcupints, Bingo","location":"PINT","startDatetime":"2023-06-22T15:00:00Z","endDatetime":"2023-06-22T16:30:00Z","timestamp":"2023-04-30T22:11:16Z"},{"summary":"<b>Based & Beautiful</b> Jess Pelletier [FSB]","description":"For Whom: All women are welcome! We will be hosting events daily in the afternoon Tuesday through Saturday at the FSB hub, RV59/60. Meet and greets, panels, discussions, mixers. Liberty ladies will be vending their goods.\nDescription: Based and beautiful will be a series presented by the women of LPNH. Topics may include education, libertarianism, entrepreneurship and more. \nOrganizer: Jess Pelletier\nWhen: Tue, 3:00P _(90m)\nWhere: FSB: Free State Based, RV59\nNote: The FSB hub will have drinks available for a suggested donation. They would appreciate your support so they are able to continue to offer a great space for events. ","location":"FSB","startDatetime":"2023-06-20T19:00:00Z","endDatetime":"2023-06-20T20:30:00Z","timestamp":"2023-04-30T22:11:16Z"},{"summary":"<b>Hip Hop In the Freestate </b> Active Debutante  [FSB]","description":"For Whom: Hip hop heads! Join us for a live DJ set featuring Active Debutante while partying at the FSB tent after fishbowl Friday!\nDescription: Come enjoy a hip hop set featuring Active Debutante including live visuals! \nDJ : Active Debutante , Subversive lakes resident\nWhen: Fri, 8:00P _(60m)\nWhere: FSB: Free State Based, RV59","location":"FSB","startDatetime":"2023-06-24T00:00:00Z","endDatetime":"2023-06-24T01:00:00Z","timestamp":"2023-04-30T22:11:16Z"},{"summary":"<b>Throwback Thursday</b> Nolan Pelletier  [FSB]","description":"For Whom: Hip hop heads!\nDescription: Celebrate the 20th year of Porcfest by traveling back in time to 2004 and beyond! Enjoy classic hip hop jams from the 90's and 2000's at the FSB hub! \nOrganizer: Nolan Pelletier \nWhen: Thu, 7:00P (240m)\nWhere: FSB: Free State Based, RV59","location":"FSB","startDatetime":"2023-06-22T23:00:00Z","endDatetime":"2023-06-23T03:00:00Z","timestamp":"2023-04-30T22:11:16Z"},{"summary":"<b>Fishbowl Friday</b> Nolan Pelletier [FSB]","description":"For Whom: Adults only\nDescription: Come join us at the FSB hub at 4pm. Make sure to arrive by 4:20 before the sides of the tent are rolled down. BYOW💨 Reggae and 420 themed music will be accompanying this event! \nOrganizer: Nolan Pelletier, 420 aficionado\nWhen: Fri, 4:20P (240m)\nWhere: FSB: Free State Based, RV59","location":"FSB","startDatetime":"2023-06-23T20:20:00Z","endDatetime":"2023-06-24T00:20:00Z","timestamp":"2023-04-30T22:11:16Z"},{"summary":"<b>Last Call!!</b> Nolan Pelletier [FSB]","description":"For Whom: Party People!\nDescription: Celebrate the last night of Porcfest XX at the FSB hub! Help us clear out the bar! There will be music and dancing!  \nOrganizer: Nolan Pelletier, Party People Aficionado!!\nWhen: Sat, 9:00P (180m)\nWhere: FSB: Free State Based, RV59\n<a href=\"https://twitter.com/freeStateBased\">More Info </a>","location":"FSB","startDatetime":"2023-06-25T01:00:00Z","endDatetime":"2023-06-25T04:00:00Z","timestamp":"2023-04-30T22:11:16Z"},{"summary":"<b>Fire, Beer, and Shitty Jokes🔥🍻😆</b> Nolan Pelletier [FSB]","description":"For Whom: Those who enjoy the based messaging of NH porcs and shitty joke enthusiasts!\nDescription: Shitty jokes contest! Bring your shitty jokes, grab a beer or two, and enjoy some shitty jokes! Prizes will be awarded for the shittiest jokes! Categories to be announced shortly.\nOrganizer: Nolan Pelletier, Shitty Jokes Aficionado \nWhen: Wed, 9:00P _(90m)\nWhere: FSB: Free State Based, RV59\nNote: *This event is NOT endorsed by Jeff Douglas*\n<a href=\"https://twitter.com/FreeStateBased\">More Info </a>","location":"FSB","startDatetime":"2023-06-22T01:00:00Z","endDatetime":"2023-06-22T02:30:00Z","timestamp":"2023-04-30T22:11:16Z"},{"summary":"<b>Glow Dance Party</b>  [PINT]","description":"For Whom: Children, teens, families \nDescription: DJ, glow sticks, dancing, games…come join the fun!\n: \nWhen: Thu, 7:00P (210m)\nWhere: PINT: Porcupints, Bingo","location":"PINT","startDatetime":"2023-06-22T23:00:00Z","endDatetime":"2023-06-23T02:30:00Z","timestamp":"2023-04-30T22:11:16Z"},{"summary":"<b>Not Without Peril</b> Derek Proulx [FSB]","description":"For Whom: Hikers, nature lovers, outdoor enthusiasts, preparedness\nDescription: Join experienced NH hiker Derek Proulx as we look into the risks associated with hiking in the White Mountains and how to mitigate them.\nSpeaker: Derek Proulx, Derek Proulx is a NH native. Growing up in the Lakes Region of the state provided easy access to the wilderness of New Hampshire's White Mountains. He is a avid outdoorsman, experienced in backpacking, rock climbing, nordic skiing, snowboarding, snowshoeing, kayaking, and mountain biking. Derek is Wilderness First Aid certified, a veteran sergeant of the NH Army National Guard, and a three times finisher of the challenging NH 48 4000 Footer List. With many miles and days logged in the Whites, Derek has seen and heard it all.\n\nWhen: Thu, 1:00P _(60m)\nWhere: FSB: Free State Based, RV59\nNote: Among the most dangerous mountains in the world, Mount Washington has challenged adventurers for centuries with its severe weather. From the days when gentlefolk ascended the heights in hoop skirts and wool suits to today's high-tech assaults on wintry summits. \n\nThe White Mountains of New Hampshire consist of a series of mountains whose maximum elevation reaches 6,288 feet (1,917 m) and represent some of the highest mountains in the United States east of the Mississippi River. Fatalities in this area are dominated by those that occur on Mount Washington, the highest peak in the range. It is notorious for its unpredictable and inclement weather, making it one of the deadliest mountains in the continental United States. Due to its unique location relative to other geographic features, it holds the world record for highest recorded surface wind speed not within a tropical cyclone. The New Hampshire Fish and Game Department conducts an average of 200 rescues a year for hikers in need of assistance. Mt. Washington has had more fatalities per vertical foot than any other mountain in the world.\n\nWe'll be taking a look at a few notable cases of disasterous climbs in the White Mountains, why these catastophes occur, details of the unique geography and weather, and steps YOU can take to make sure your hike doesn't end tragically.","location":"FSB","startDatetime":"2023-06-22T17:00:00Z","endDatetime":"2023-06-22T18:00:00Z","timestamp":"2023-04-30T22:11:16Z"},{"summary":"<b>Hiking Gear Shakedown</b> Derek Proulx [FSB]","description":"For Whom: Hikers, nature lovers, outdoor enthusiasts\nDescription: Join experienced hiker, Derek Proulx, as he unpacks his bag and shows off the essential hiking gear he uses to camp and summit some of the most dangerous mountains in the world.\nSpeaker: Derek Proulx, Derek Proulx is a NH native. Growing up in the Lakes Region of the state provided easy access to the wilderness of New Hampshire's White Mountains. He is a avid outdoorsman, experienced in backpacking, rock climbing, nordic skiing, snowboarding, snowshoeing, kayaking, and mountain biking. Derek is Wilderness First Aid certified, a veteran sergeant of the NH Army National Guard, and a three times finisher of the challenging NH 48 4000 Footer List. With many miles and days logged in the Whites, Derek has seen and heard it all.\nWhen: Sat, 1:00P _(60m)\nWhere: FSB: Free State Based, RV59","location":"FSB","startDatetime":"2023-06-24T17:00:00Z","endDatetime":"2023-06-24T18:00:00Z","timestamp":"2023-04-30T22:11:16Z"},{"summary":"<b>Tie Dye - Bring something white to dye</b> Kathryn Michelotti [PINT]","description":"For Whom: Anyone who enjoys tie dying! Children, teens, families\nDescription: An annual favorite – come tie dye with friends!\n. . . Bring something white to tie dye (shirt, bandana, etc.) Dye and elastics will be supplied. First come, first served so come early before the dye runs dry...\nSponsored by Latitude Learning\n: Kathryn Michelotti. <a href=\"https://www.latitudelearning.org/\"> Website </a>\nWhen: Fri, 1:00P (120m)\nWhere: PINT: Porcupints, Bingo","location":"PINT","startDatetime":"2023-06-23T17:00:00Z","endDatetime":"2023-06-23T19:00:00Z","timestamp":"2023-04-30T22:11:16Z"},{"summary":"<b>Homeschooling 102</b> Kathryn Michelotti [PINT]","description":"For Whom: \nDescription: \n: Kathryn Michelotti\nWhen: Wed, 3:30P _(60m)\nWhere: PINT: Porcupints, Bingo","location":"PINT","startDatetime":"2023-06-21T19:30:00Z","endDatetime":"2023-06-21T20:30:00Z","timestamp":"2023-04-30T22:11:16Z"},{"summary":"<b>Welcome \"home\" PorcuPints</b>  [PINT]","description":"For Whom: Families, Children, Teens, Parents\nDescription: PorcuPints is the place to be for families, children, and parents during PorcFest. Start the week off right meeting new (and old) friends. Stop by to get a copy of the schedule. Balloon animals, crafts, games, activities, LEGOs, and more.\n: \nWhen: Mon, 2:30P (240m)\nWhere: PINT: Porcupints, Bingo","location":"PINT","startDatetime":"2023-06-19T18:30:00Z","endDatetime":"2023-06-19T22:30:00Z","timestamp":"2023-04-30T22:11:16Z"},{"summary":"<b>Picnic Dinner at the Playground</b>  [play]","description":"For Whom: Families, children\nDescription: Getting to PorcFest is always an adventure of its own! Traveling and setting up your site while the kids are ready to Gooooo!!! leads to \"oh noooo, it's dinner!\" Plan ahead- pack a simple dinner and join your friends at the playground for a picnic and some climbing/leg stretching (rain location: PINT). We've missed you or we can't wait to meet you!\n: \nWhen: Mon, 5:00P (120m)\nWhere: play: Playground, Playground","location":"play","startDatetime":"2023-06-19T21:00:00Z","endDatetime":"2023-06-19T23:00:00Z","timestamp":"2023-04-30T22:11:16Z"},{"summary":"<b>Humans vs Zombies</b> Kathryn Michelotti [PINT]","description":"For Whom: Children, teens and zombies\nDescription: Come gather and play Humans vs Zombies. Can you remain human or will you become a zombie too?\nBring a bandana or t-shirt to tie around your head/arm (required) and Boffers (optional if you have them) to play this zombie rendition of tag around the campground. (no nerf guns please)\n: Kathryn Michelotti\nWhen: Tue, 3:00P (120m)\nWhere: PINT: Porcupints, Bingo","location":"PINT","startDatetime":"2023-06-20T19:00:00Z","endDatetime":"2023-06-20T21:00:00Z","timestamp":"2023-04-30T22:11:16Z"},{"summary":"<b>Humans vs Zombies</b> Kathryn Michelotti [PINT]","description":"For Whom: Children, teens, and zombies\nDescription: Come gather and play Humans vs Zombies. Can you remain human or will you become a zombie too?\nBring a bandana or t-shirt to tie around your head/arm (required) and Boffers (optional if you have them) to play this zombie rendition of tag around the campground. (no nerf guns please)\n: Kathryn Michelotti\nWhen: Wed, 3:00P (120m)\nWhere: PINT: Porcupints, Bingo","location":"PINT","startDatetime":"2023-06-21T19:00:00Z","endDatetime":"2023-06-21T21:00:00Z","timestamp":"2023-04-30T22:11:16Z"},{"summary":"<b>Humans vs Zombies</b>  [PINT]","description":"For Whom: Children, teens and zombies\nDescription: Come gather and play Humans vs Zombies. Can you remain human or will you become a zombie too?\nBring a bandana or t-shirt to tie around your head/arm (required) and Boffers (optional if you have them) to play this zombie rendition of tag around the campground. (no nerf guns please)\n: \nWhen: Thu, 3:00P (120m)\nWhere: PINT: Porcupints, Bingo","location":"PINT","startDatetime":"2023-06-22T19:00:00Z","endDatetime":"2023-06-22T21:00:00Z","timestamp":"2023-04-30T22:11:16Z"},{"summary":"<b>Humans vs Zombies</b>  [PINT]","description":"For Whom: Children, teens and zombies\nDescription: Come gather and play Humans vs Zombies. Can you remain human or will you become a zombie too?\nBring a bandana or t-shirt to tie around your head/arm (required) and Boffers (optional if you have them) to play this zombie rendition of tag around the campground. (no nerf guns please)\n: \nWhen: Fri, 3:00P (120m)\nWhere: PINT: Porcupints, Bingo","location":"PINT","startDatetime":"2023-06-23T19:00:00Z","endDatetime":"2023-06-23T21:00:00Z","timestamp":"2023-04-30T22:11:16Z"},{"summary":"<b>Based & Beautiful Series</b> Jess Pelletier [FSB]","description":"For Whom: All women are welcome!\nDescription: Panel/discussion, liberty ladies vending their goods. \nOrganizer: Jess Pelletier\nWhen: Wed, 3:00P _(90m)\nWhere: FSB: Free State Based, RV59","location":"FSB","startDatetime":"2023-06-21T19:00:00Z","endDatetime":"2023-06-21T20:30:00Z","timestamp":"2023-04-30T22:11:16Z"},{"summary":"<b>Based & Beautiful Series</b> Jess Pelletier [FSB]","description":"For Whom: All women are welcome!\nDescription: Panel/discussion, liberty ladies vending their goods. \nOrganizer: Jess Pelletier\nWhen: Thu, 3:00P (120m)\nWhere: FSB: Free State Based, RV59","location":"FSB","startDatetime":"2023-06-22T19:00:00Z","endDatetime":"2023-06-22T21:00:00Z","timestamp":"2023-04-30T22:11:16Z"},{"summary":"<b>Based & Beautiful Series </b> Jess Pelletier [FSB]","description":"For Whom: All women are welcome!\nDescription: Panel/discussion, liberty ladies vending their goods. \nOrganizer: Jess Pelletier\nWhen: Fri, 1:00P (120m)\nWhere: FSB: Free State Based, RV59","location":"FSB","startDatetime":"2023-06-23T17:00:00Z","endDatetime":"2023-06-23T19:00:00Z","timestamp":"2023-04-30T22:11:16Z"},{"summary":"<b>Based & Beautiful Series</b> Jess Pelletier [FSB]","description":"For Whom: All women are welcome!\nDescription: Social mixer\nOrganizer: Jess Pelletier\nWhen: Sat, 4:00P _(60m)\nWhere: FSB: Free State Based, RV59","location":"FSB","startDatetime":"2023-06-24T20:00:00Z","endDatetime":"2023-06-24T21:00:00Z","timestamp":"2023-04-30T22:11:16Z"},{"summary":"<b>Stop Talking About Constitutions</b> Ian Underwood [FSB]","description":"For Whom: People who like to quote constitutions\nDescription: Because they assume powers that cannot be delegated, the federal and state constitutions are ultimately unsuitable as foundations for liberty. I will explain why basing arguments on them is not effective and is likely to be counterproductive. \nSpeaker: Ian Underwood, Ian Underwood has been a planetary scientist and artificial intelligence researcher for NASA, the director of the renowned Ask Dr. Math service, co-founder of Bardo Farm and Shaolin Rifleworks, and a popular speaker at liberty-related events. He is the author of a series of Bare Minimum Books, which expose the simplicity underlying complex issues like law, education, and gun rights. He lives in Croydon, New Hampshire.. <a href=\"https://www.bareminimumbooks.com/\"> Website </a>\nWhen: Wed, 5:00P _(60m)\nWhere: FSB: Free State Based, RV59\n<a href=\"https://www.bareminimumbooks.com/\">More Info </a>","location":"FSB","startDatetime":"2023-06-21T21:00:00Z","endDatetime":"2023-06-21T22:00:00Z","timestamp":"2023-04-30T22:11:16Z"},{"summary":"<b>Burning Porcupine</b> Dennis Pratt, Constance Spencer [Field]","description":"For Whom: Attendees of the historic, largest ever, most baed PorcFest XX 2023!\nDescription: The closing of the official  festival takes place with the Burning of the Porcupine. Come, share a light, say farewell to the festival, talk with your fellow porcupines about how you can advance liberty in your lifetime -- outside of PorcFest… \n…and prepare for the night.\n\n\nWhen: Sat, 8:30P _(90m)\n\nWhere: Field: Field, Field\n\nMore Info: https://freemarketanarchist.files.wordpress.com/2008/06/burning_porc1.jpg?w=444&h=598\nChef de Village: Dennis Pratt, One of your principal guides over the last five years, our Chef de Village Dennis is hanging up his official leadership with XX.  Give him a big hug!\nOrganizer: Constance Spencer, Constance is our co-producer for PorcFest XX 2023.  Having volunteered to manage Registration for the last five years, Constance is stepping up this year PorcFest Operations Direct, responsible for all the internal operations of PorcFest (Registration, Free Aid, Facilities, PorcRangers, Inventory, Info, Costs, Rogers relations, etc.)\n. . . When not volunteering to manage the complex operations of the largest freedom festival in the world, Constance is the lead of Independence Realty Group which is a real estate team at Coldwell Banker Realty.\n. . . She is an early mover for the Free State Project moving from Alaska in 2014 with her four children. In Alaska she was learning self-reliance by turning her small acreage home into a homestead through permaculture and raising chickens, ducks, turkeys, and pigs. She was also active in the home birth community and has always allowed her children education freedom which has included homeschooling, trade schools, and charter schools.\n. . . She has also been a real estate investor since her early twenties when she rented her single family home in Ohio and moved to Alaska. She and her partner currently have 13 rental units. Her passion is helping others navigate home ownership and real estate investing. She’s just as comfortable talking about peaceful parenting as she is discussing holding real estate in retirement accounts and sees both as paths to liberty.\n. . . Visit her hub at \"Homeland\" on the field.\nWhen: Sat, 8:30P (100m)\nWhere: Field: Field, Field","location":"Field","startDatetime":"2023-06-25T00:30:00Z","endDatetime":"2023-06-25T02:10:00Z","timestamp":"2023-04-30T22:11:16Z"},{"summary":"<b>Photo Shoot: Official PorcFest XX Group Photo</b> Constance Spencer [Field]","description":"For Whom: Every PorcFest attendee of 2023 -- old and young; newbie and old-timer,' sober or not; politicos, agorists, ancaps, beltways, preppers, curious, spouses; Christians, Jews, Muslims, atheists; speakers and listeners; campers and hotelers; \n. . . The only people who should not be down in the field for this photo are Feds.\n\nDescription: Attention! Attention! All attendees gather on the field for our annual group photo, so that we can tell the world there exists a small group - which is far larger than they think - of freedom lovers willing to travel -- and some even migrate -- to create Liberty in our Lifetime. \nDirector of Operations: Constance Spencer, Constance is our co-producer for PorcFest XX 2023.  Having volunteered to manage Registration for the last five years, Constance is stepping up this year PorcFest Operations Direct, responsible for all the internal operations of PorcFest (Registration, Free Aid, Facilities, PorcRangers, Inventory, Info, Costs, Rogers relations, etc.)\n. . . When not volunteering to manage the complex operations of the largest freedom festival in the world, Constance is the lead of Independence Realty Group which is a real estate team at Coldwell Banker Realty.\n. . . She is an early mover for the Free State Project moving from Alaska in 2014 with her four children. In Alaska she was learning self-reliance by turning her small acreage home into a homestead through permaculture and raising chickens, ducks, turkeys, and pigs. She was also active in the home birth community and has always allowed her children education freedom which has included homeschooling, trade schools, and charter schools.\n. . . She has also been a real estate investor since her early twenties when she rented her single family home in Ohio and moved to Alaska. She and her partner currently have 13 rental units. Her passion is helping others navigate home ownership and real estate investing. She’s just as comfortable talking about peaceful parenting as she is discussing holding real estate in retirement accounts and sees both as paths to liberty.\n. . . Visit her hub at \"Homeland\" on the field.\nWhen: Sat, 2:30P _(30m)\nWhere: Field: Field, Field\nNote: This photo shares with the world the number and type of attendees. It is the culmination of our festival. If you don't like your photo taken, turn backwards, or wear a disguise. But please do attend to show the world how many there are of us who really don't like the State and are willing to explore migrating to create on small region for Liberty In Our Lifetime.\n. . . NO FEDS though.","location":"Field","startDatetime":"2023-06-24T18:30:00Z","endDatetime":"2023-06-24T19:00:00Z","timestamp":"2023-04-30T22:11:16Z"},{"summary":"<b>Call to the Clans</b> Dennis Pratt [Field]","description":"For Whom: Everyone who has attended this PorcFest: Vendor and vendee; hub organizers and hub attendees; speakers and listeners; families and singles.\nDescription: Find and gather your campsite, your hubs, your friends, your associates all together and make your way down to the field for our annual photo. Bring symbols of your clan -- matching t-shirts, banners, signs, etc. And surround yourself with your clan and your friends for our annual PorcFest (XX) photoshoot.\n. . . Themes of similar shirts, hats, colors etc are always good. Banners, signs, etc.\n\nChef de Village: Dennis Pratt, Will be traipsing around the campground calling out you guys, as he has done in past years.. Please head down to field early -- so he can actually make it into this year's picture (He was too busy corralling laggards in 2021 that he missed the photo entirely!). <a href=\"https://mobile.twitter.com/DennisPrattFree\"> Website </a>. <a href=\"https://www.fsp.org/wp-content/uploads/2019/03/Voluntaryist-Heart-only.jpg\"> Image </a>\nWhen: Sat, 2:00P _(30m)\nWhere: Field: Field, Field\nNote: Make sure the people you care about know about the upcoming photoshoot and herd them down to the field so they can mark this historic moment with you.","location":"Field","startDatetime":"2023-06-24T18:00:00Z","endDatetime":"2023-06-24T18:30:00Z","timestamp":"2023-04-30T22:11:16Z"},{"summary":"<b>Frisbee in the Field</b>  [Field]","description":"For Whom: Frisbee newbies, frisbee oldies, and frisbee wannabes\nDescription: Bring your best fris, and your best fris moves, and let the frisbees fly.\n: \nWhen: Tue, 3:00P _(60m)\nWhere: Field: Field, Field\nNote: Frisbee in the Field occurs every day in the field at 3P. Come down and stretch out. Feel free to organize a game of Ultimate Frisbee afterwards if the field is not being used.","location":"Field","startDatetime":"2023-06-20T19:00:00Z","endDatetime":"2023-06-20T20:00:00Z","timestamp":"2023-04-30T22:11:16Z"},{"summary":"<b>Frisbee in the Field</b>  [Field]","description":"For Whom: Frisbee newbies, frisbee oldies, and frisbee wannabes\nDescription: Bring your best fris, and your best fris moves, and let the frisbees fly.\n: \nWhen: Wed, 3:00P _(60m)\nWhere: Field: Field, Field\nNote: Frisbee in the Field occurs every day in the field at 3P. Come down and stretch out. Feel free to organize a game of Ultimate Frisbee afterwards if the field is not being used.","location":"Field","startDatetime":"2023-06-21T19:00:00Z","endDatetime":"2023-06-21T20:00:00Z","timestamp":"2023-04-30T22:11:16Z"},{"summary":"<b>Frisbee in the Field</b>  [Field]","description":"For Whom: Frisbee newbies, frisbee oldies, and frisbee wannabes\nDescription: Bring your best fris, and your best fris moves, and let the frisbees fly.\n: \nWhen: Thu, 4:00P _(60m)\nWhere: Field: Field, Field\nNote: Frisbee in the Field occurs every day in the field at 3P. Come down and stretch out. Feel free to organize a game of Ultimate Frisbee afterwards if the field is not being used.","location":"Field","startDatetime":"2023-06-22T20:00:00Z","endDatetime":"2023-06-22T21:00:00Z","timestamp":"2023-04-30T22:11:16Z"},{"summary":"<b>Frisbee in the Field</b>  [Field]","description":"For Whom: Frisbee newbies, frisbee oldies, and frisbee wannabes\nDescription: Bring your best fris, and your best fris moves, and let the frisbees fly.\n: \nWhen: Fri, 3:00P _(60m)\nWhere: Field: Field, Field\nNote: Frisbee in the Field occurs every day in the field at 3P. Come down and stretch out. Feel free to organize a game of Ultimate Frisbee afterwards if the field is not being used.","location":"Field","startDatetime":"2023-06-23T19:00:00Z","endDatetime":"2023-06-23T20:00:00Z","timestamp":"2023-04-30T22:11:16Z"},{"summary":"<b>Doggy Meetup on the Field</b> Ron Paw [Field]","description":"For Whom: Four legged. Tail (cropped acceptable) but ever-wagging. Ears pointy, or floppy. Friendly. Greeting. Licks and belly rubs acceptable Responsible owners only please!\nDescription: A classic of PF. Police the field while your dog meets his best tail-wagging buds. Please have your dog under control, and pick up any poop immediately. While you're chatting, do help clear the field of bottles, etc that the less-than-responsible may have left last night. Leave the field ready for the day!\nBelgian Tervuren: Ron Paw, Ron Paw has sniffed around the Free State for two and a half years now, and declares it is safe for all Porcupines. His first PF was 2021, but he was only a pup. Last year, was his teenage experience. This year he comes in as a young adult. He reclaims his title as Chef du Jeu of PF 2023, along with his 5 year old cockapoo companion, Queen Janey.. <a href=\"https://www.facebook.com/photo.php?fbid=2429056339595&set=t.1393626648&type=3\"> Image </a>\nWhen: Tue, 8:00A _(60m)\nWhere: Field: Field, Field\nNote: Doggies play 8A and 5P on the field each day.","location":"Field","startDatetime":"2023-06-20T12:00:00Z","endDatetime":"2023-06-20T13:00:00Z","timestamp":"2023-04-30T22:11:16Z"},{"summary":"<b>Doggy Meetup on the Field</b> Ron Paw [Field]","description":"For Whom: Four legged. Tail (cropped acceptable) but ever-wagging. Ears pointy, or floppy. Friendly. Greeting. Licks and belly rubs acceptable Responsible owners only please!\nDescription: A classic of PF. Police the field while your dog meets his best tail-wagging buds. Please have your dog under control, and pick up any poop immediately. While you're chatting, do help clear the field of bottles, etc that the less-than-responsible may have left last night. Leave the field ready for the day!\nBelgian Tervuren: Ron Paw, Ron Paw has sniffed around the Free State for two and a half years now, and declares it is safe for all Porcupines. His first PF was 2021, but he was only a pup. Last year, was his teenage experience. This year he comes in as a young adult. He reclaims his title as Chef du Jeu of PF 2023, along with his 5 year old cockapoo companion, Queen Janey.. <a href=\"https://www.facebook.com/photo.php?fbid=2429056339595&set=t.1393626648&type=3\"> Image </a>\nWhen: Tue, 5:00P _(60m)\nWhere: Field: Field, Field\nNote: Doggies play 8A and 5P on the field each day.","location":"Field","startDatetime":"2023-06-20T21:00:00Z","endDatetime":"2023-06-20T22:00:00Z","timestamp":"2023-04-30T22:11:16Z"},{"summary":"<b>Doggy Meetup on the Field</b> Ron Paw [Field]","description":"For Whom: Four legged. Tail (cropped acceptable) but ever-wagging. Ears pointy, or floppy. Friendly. Greeting. Licks and belly rubs acceptable Responsible owners only please!\nDescription: A classic of PF. Police the field while your dog meets his best tail-wagging buds. Please have your dog under control, and pick up any poop immediately. While you're chatting, do help clear the field of bottles, etc that the less-than-responsible may have left last night. Leave the field ready for the day!\nBelgian Tervuren: Ron Paw, Ron Paw has sniffed around the Free State for two and a half years now, and declares it is safe for all Porcupines. His first PF was 2021, but he was only a pup. Last year, was his teenage experience. This year he comes in as a young adult. He reclaims his title as Chef du Jeu of PF 2023, along with his 5 year old cockapoo companion, Queen Janey.. <a href=\"https://www.facebook.com/photo.php?fbid=2429056339595&set=t.1393626648&type=3\"> Image </a>\nWhen: Wed, 8:00A _(60m)\nWhere: Field: Field, Field\nNote: Doggies play 8A and 5P on the field each day.","location":"Field","startDatetime":"2023-06-21T12:00:00Z","endDatetime":"2023-06-21T13:00:00Z","timestamp":"2023-04-30T22:11:16Z"},{"summary":"<b>Doggy Meetup on the Field</b> Ron Paw [Field]","description":"For Whom: Four legged. Tail (cropped acceptable) but ever-wagging. Ears pointy, or floppy. Friendly. Greeting. Licks and belly rubs acceptable Responsible owners only please!\nDescription: A classic of PF. Police the field while your dog meets his best tail-wagging buds. Please have your dog under control, and pick up any poop immediately. While you're chatting, do help clear the field of bottles, etc that the less-than-responsible may have left last night. Leave the field ready for the day!\nBelgian Tervuren: Ron Paw, Ron Paw has sniffed around the Free State for two and a half years now, and declares it is safe for all Porcupines. His first PF was 2021, but he was only a pup. Last year, was his teenage experience. This year he comes in as a young adult. He reclaims his title as Chef du Jeu of PF 2023, along with his 5 year old cockapoo companion, Queen Janey.. <a href=\"https://www.facebook.com/photo.php?fbid=2429056339595&set=t.1393626648&type=3\"> Image </a>\nWhen: Wed, 5:00P _(60m)\nWhere: Field: Field, Field\nNote: Doggies play 8A and 5P on the field each day.","location":"Field","startDatetime":"2023-06-21T21:00:00Z","endDatetime":"2023-06-21T22:00:00Z","timestamp":"2023-04-30T22:11:16Z"},{"summary":"<b>Doggy Meetup on the Field</b> Ron Paw [Field]","description":"For Whom: Four legged. Tail (cropped acceptable) but ever-wagging. Ears pointy, or floppy. Friendly. Greeting. Licks and belly rubs acceptable Responsible owners only please!\nDescription: A classic of PF. Police the field while your dog meets his best tail-wagging buds. Please have your dog under control, and pick up any poop immediately. While you're chatting, do help clear the field of bottles, etc that the less-than-responsible may have left last night. Leave the field ready for the day!\nBelgian Tervuren: Ron Paw, Ron Paw has sniffed around the Free State for two and a half years now, and declares it is safe for all Porcupines. His first PF was 2021, but he was only a pup. Last year, was his teenage experience. This year he comes in as a young adult. He reclaims his title as Chef du Jeu of PF 2023, along with his 5 year old cockapoo companion, Queen Janey.. <a href=\"https://www.facebook.com/photo.php?fbid=2429056339595&set=t.1393626648&type=3\"> Image </a>\nWhen: Thu, 8:00A _(60m)\nWhere: Field: Field, Field\nNote: Doggies play 8A and 5P on the field each day.","location":"Field","startDatetime":"2023-06-22T12:00:00Z","endDatetime":"2023-06-22T13:00:00Z","timestamp":"2023-04-30T22:11:16Z"},{"summary":"<b>Doggy Meetup on the Field</b> Ron Paw [Field]","description":"For Whom: Four legged. Tail (cropped acceptable) but ever-wagging. Ears pointy, or floppy. Friendly. Greeting. Licks and belly rubs acceptable Responsible owners only please!\nDescription: A classic of PF. Police the field while your dog meets his best tail-wagging buds. Please have your dog under control, and pick up any poop immediately. While you're chatting, do help clear the field of bottles, etc that the less-than-responsible may have left last night. Leave the field ready for the day!\nBelgian Tervuren: Ron Paw, Ron Paw has sniffed around the Free State for two and a half years now, and declares it is safe for all Porcupines. His first PF was 2021, but he was only a pup. Last year, was his teenage experience. This year he comes in as a young adult. He reclaims his title as Chef du Jeu of PF 2023, along with his 5 year old cockapoo companion, Queen Janey.. <a href=\"https://www.facebook.com/photo.php?fbid=2429056339595&set=t.1393626648&type=3\"> Image </a>\nWhen: Thu, 5:00P _(60m)\nWhere: Field: Field, Field\nNote: Doggies play 8A and 5P on the field each day.","location":"Field","startDatetime":"2023-06-22T21:00:00Z","endDatetime":"2023-06-22T22:00:00Z","timestamp":"2023-04-30T22:11:16Z"},{"summary":"<b>Doggy Meetup on the Field</b> Ron Paw [Field]","description":"For Whom: Four legged. Tail (cropped acceptable) but ever-wagging. Ears pointy, or floppy. Friendly. Greeting. Licks and belly rubs acceptable Responsible owners only please!\nDescription: A classic of PF. Police the field while your dog meets his best tail-wagging buds. Please have your dog under control, and pick up any poop immediately. While you're chatting, do help clear the field of bottles, etc that the less-than-responsible may have left last night. Leave the field ready for the day!\nBelgian Tervuren: Ron Paw, Ron Paw has sniffed around the Free State for two and a half years now, and declares it is safe for all Porcupines. His first PF was 2021, but he was only a pup. Last year, was his teenage experience. This year he comes in as a young adult. He reclaims his title as Chef du Jeu of PF 2023, along with his 5 year old cockapoo companion, Queen Janey.. <a href=\"https://www.facebook.com/photo.php?fbid=2429056339595&set=t.1393626648&type=3\"> Image </a>\nWhen: Fri, 8:00A _(60m)\nWhere: Field: Field, Field\nNote: Doggies play 8A and 5P on the field each day.","location":"Field","startDatetime":"2023-06-23T12:00:00Z","endDatetime":"2023-06-23T13:00:00Z","timestamp":"2023-04-30T22:11:16Z"},{"summary":"<b>Doggy Meetup on the Field</b> Ron Paw [Field]","description":"For Whom: Four legged. Tail (cropped acceptable) but ever-wagging. Ears pointy, or floppy. Friendly. Greeting. Licks and belly rubs acceptable Responsible owners only please!\nDescription: A classic of PF. Police the field while your dog meets his best tail-wagging buds. Please have your dog under control, and pick up any poop immediately. While you're chatting, do help clear the field of bottles, etc that the less-than-responsible may have left last night. Leave the field ready for the day!\nBelgian Tervuren: Ron Paw, Ron Paw has sniffed around the Free State for two and a half years now, and declares it is safe for all Porcupines. His first PF was 2021, but he was only a pup. Last year, was his teenage experience. This year he comes in as a young adult. He reclaims his title as Chef du Jeu of PF 2023, along with his 5 year old cockapoo companion, Queen Janey.. <a href=\"https://www.facebook.com/photo.php?fbid=2429056339595&set=t.1393626648&type=3\"> Image </a>\nWhen: Fri, 5:00P _(60m)\nWhere: Field: Field, Field\nNote: Doggies play 8A and 5P on the field each day.","location":"Field","startDatetime":"2023-06-23T21:00:00Z","endDatetime":"2023-06-23T22:00:00Z","timestamp":"2023-04-30T22:11:16Z"},{"summary":"<b>Doggy Meetup on the Field</b> Ron Paw [Field]","description":"For Whom: Four legged. Tail (cropped acceptable) but ever-wagging. Ears pointy, or floppy. Friendly. Greeting. Licks and belly rubs acceptable Responsible owners only please!\nDescription: A classic of PF. Police the field while your dog meets his best tail-wagging buds. Please have your dog under control, and pick up any poop immediately. While you're chatting, do help clear the field of bottles, etc that the less-than-responsible may have left last night. Leave the field ready for the day!\nBelgian Tervuren: Ron Paw, Ron Paw has sniffed around the Free State for two and a half years now, and declares it is safe for all Porcupines. His first PF was 2021, but he was only a pup. Last year, was his teenage experience. This year he comes in as a young adult. He reclaims his title as Chef du Jeu of PF 2023, along with his 5 year old cockapoo companion, Queen Janey.. <a href=\"https://www.facebook.com/photo.php?fbid=2429056339595&set=t.1393626648&type=3\"> Image </a>\nWhen: Sat, 8:00A _(60m)\nWhere: Field: Field, Field\nNote: Doggies play 8A and 5P on the field each day.","location":"Field","startDatetime":"2023-06-24T12:00:00Z","endDatetime":"2023-06-24T13:00:00Z","timestamp":"2023-04-30T22:11:16Z"},{"summary":"<b>Life is Good: Tuesday Morning AA meeting</b> Mark Hansen [FS]","description":"For Whom: For anybody who is sober or trying to stay sober during the week, and for anybody who might be having a difficult time with substances and trying to stop. Are alcohol or other substances becoming overwhelming,  consuming, or taking over your life? Habits can become addictions for some people, and when it becomes a problem, it may be time to stop. When your body gets used to having foreign substances in it every day (such as alcohol), it may be physiologically very difficult to stop or change the habit/addiction. I’ve found it more helpful to talk with others who have actually gone through it, than to talk with counselors who haven’t. —Mark\nDescription: A morning group for those who will not be drinking and/or participating in extracurricular substances who would like to have a coffee, chat, or support and encourage each other to stay sober. \nOrganizer: Mark Hansen, Mark Hansen, Mark has been sober for over 8 years. He realized that alcohol was becoming a problem in his life, and didn’t want to be remembered as being an alcoholic. He didn’t want his children to remember him that way, and he didn’t want alcohol to take his life. As a former park ranger and security officer at a hospital, he has seen his fair share of what alcohol addiction can do to a person. He has witnessed people going through detox. He has seen the physical and psychological effects of it, and he has seen people die from alcoholism and drug overdose. He didn’t want alcohol to win, so he decided to be a warrior to defeat it. \nMark is teaching special education again, hiking, riding motorcycles, and enjoying the 2A and shooting sports these days. He is truly grateful to God (his higher power) for saving his life, and he’s giving credit where credit is due. Be a warrior. Life is Good. \nWhen: Tue, 9:00A _(60m)\nWhere: FS: The FireSteel.com Event Canopy, RV13","location":"FS","startDatetime":"2023-06-20T13:00:00Z","endDatetime":"2023-06-20T14:00:00Z","timestamp":"2023-04-30T22:11:16Z"},{"summary":"<b>Life is Good: Monday Morning AA Meeting</b> Mark Hansen [FS]","description":"For Whom: For anybody who is sober or trying to stay sober during the week. For anybody who might be having a difficult time with alcohol and trying to stop. Are alcohol or other substances becoming overwhelming,  consuming, or taking over your life? Habits can become addictions for some people, and when it becomes a problem, it may be time to stop. When your body gets used to having foreign substances in it every day (such as alcohol), it may be physiologically very difficult to stop or change the habit/addiction. I’ve found it most helpful to talk with others who have actually gone through it, than to talk with some counselors who haven’t. —Mark\nDescription: Life is Good Morning AA Meeting:\n\nIf you are sober, trying to get sober, and/or interested in AA, please join us each morning for a coffee and open conversation about stopping alcohol and how life is better without it. Let’s support and encourage each other. \n\nOrganizer: Mark Hansen, Mark Hansen: Mark has been sober for over 8 years. He realized that alcohol was becoming a problem in his life, and didn’t want to be remembered as being an alcoholic. He didn’t want his children to remember him that way, and he didn’t want alcohol to take his life. As a former park ranger and security officer at a hospital, he has seen his fair share of what alcohol addiction can do to a person. He has witnessed people going through detox. He has seen the physical and psychological effects of it, and he has seen people die from alcoholism and drug overdose. He didn’t want alcohol to win, so he decided to be a warrior to defeat it. \nMark is teaching special education again, hiking, riding motorcycles, and enjoying the 2A and shooting sports these days. He is truly grateful to God (his higher power) for saving his life, and he’s giving credit where credit is due. Be a warrior. Life is Good. . <a href=\"https://t.me/+Zk2A-hjc67kwOTdh\"> Website </a>\nWhen: Mon, 9:00A _(60m)\nWhere: FS: The FireSteel.com Event Canopy, RV13\nNote: (please complete)\n<a href=\"https://t.me/+Zk2A-hjc67kwOTdh\">More Info </a>","location":"FS","startDatetime":"2023-06-19T13:00:00Z","endDatetime":"2023-06-19T14:00:00Z","timestamp":"2023-04-30T22:11:16Z"},{"summary":"<b>Bardo Farm Pig Roast</b> Emily & Neil Smith [Field]","description":"For Whom: Hungry porcupines interested in pork and other farm products.\nDescription: Come and enjoy the traditional all-community dinner, hosted by Bardo Farms, interweaving sustainable gardening and livestock practices, self-sufficiency skills, energy conservation and production, self-discovery, and economic development as one path to freedom in the Upper Valley of NH.\n. . . $20 per plate. \n\nOrganizer: Emily & Neil Smith, Farmers/Owners of Bardo Farm\nWhen: Sat, 3:00P _(60m)\nWhere: Field: Field, Field\nNote: Come early,  we sell out quickly","location":"Field","startDatetime":"2023-06-24T19:00:00Z","endDatetime":"2023-06-24T20:00:00Z","timestamp":"2023-04-30T22:11:16Z"},{"summary":"<b>Rave Free or Die, Part Deux</b> Super Best Friends [FS]","description":"For Whom: The Super Best Friends present the second annual Rave Free or Die dance party! Join us to enjoy some carefully curated dance tunes of yesterday and today, and dance the night away. If you love electronic music and dancing, make sure to stop by. This is a no-cost event, and all are welcome who abide by the tenets of PLUR!\nDescription: A free dance party for anyone who loves electronic music!\nHost: Super Best Friends, (please complete)\nWhen: Fri, 7:00P (240m)\nWhere: FS: The FireSteel.com Event Canopy, RV13","location":"FS","startDatetime":"2023-06-23T23:00:00Z","endDatetime":"2023-06-24T03:00:00Z","timestamp":"2023-04-30T22:11:16Z"},{"summary":"<b>Life Is Good: Weds Morning AA Meeting</b> Mark Hansen [FS]","description":"For Whom: For anybody who is sober or trying to stay sober during the week, and for anybody who might be having a difficult time with substances and trying to stop. Is alcohol or other substances becoming overwhelming,  consuming, or taking over your life? Habits can become addictions for some people, and when it becomes a problem, it may be time to stop. When your body gets used to having foreign substances in it every day (such as alcohol), it may be physiologically very difficult to stop or change the habit/addiction. I’ve found it more helpful to talk with others who have actually gone through it, than to talk with counselors who haven’t. —Mark\nDescription: A morning group for those who will not be drinking and/or participating in extracurricular substances who would like to have a coffee, chat, or support and encourage each other to stay sober. \nOrganizer: Mark Hansen, Mark Hansen, Mark has been sober for over 8 years. He realized that alcohol was becoming a problem in his life, and didn’t want to be remembered as being an alcoholic. He didn’t want his children to remember him that way, and he didn’t want alcohol to take his life. As a former park ranger and security officer at a hospital, he has seen his fair share of what alcohol addiction can do to a person. He has witnessed people going through detox. He has seen the physical and psychological effects of it, and he has seen people die from alcoholism and drug overdose. He didn’t want alcohol to win, so he decided to be a warrior to defeat it. \nMark is teaching special education again, hiking, riding motorcycles, and enjoying the 2A and shooting sports these days. He is truly grateful to God (his higher power) for saving his life, and he’s giving credit where credit is due. Be a warrior. Life is Good. . <a href=\"https://t.me/+Zk2A-hjc67kwOTdh\"> Website </a>\nWhen: Wed, 9:00A _(60m)\nWhere: FS: The FireSteel.com Event Canopy, RV13","location":"FS","startDatetime":"2023-06-21T13:00:00Z","endDatetime":"2023-06-21T14:00:00Z","timestamp":"2023-04-30T22:11:16Z"},{"summary":"<b>Life Is Good: Thus Morning AA Meeting</b> Mark Hansen [FS]","description":"For Whom: For anybody who is sober or trying to stay sober during the week, and for anybody who might be having a difficult time with substances and trying to stop. Is alcohol or other substances becoming overwhelming,  consuming, or taking over your life? Habits can become addictions for some people, and when it becomes a problem, it may be time to stop. When your body gets used to having foreign substances in it every day (such as alcohol), it may be physiologically very difficult to stop or change the habit/addiction. I’ve found it more helpful to talk with others who have actually gone through it, than to talk with counselors who haven’t. —Mark\nDescription: A morning group for those who will not be drinking and/or participating in extracurricular substances who would like to have a coffee, chat, or support and encourage each other to stay sober. \nOrganizer: Mark Hansen, Mark Hansen, Mark has been sober for over 8 years. He realized that alcohol was becoming a problem in his life, and didn’t want to be remembered as being an alcoholic. He didn’t want his children to remember him that way, and he didn’t want alcohol to take his life. As a former park ranger and security officer at a hospital, he has seen his fair share of what alcohol addiction can do to a person. He has witnessed people going through detox. He has seen the physical and psychological effects of it, and he has seen people die from alcoholism and drug overdose. He didn’t want alcohol to win, so he decided to be a warrior to defeat it. \nMark is teaching special education again, hiking, riding motorcycles, and enjoying the 2A and shooting sports these days. He is truly grateful to God (his higher power) for saving his life, and he’s giving credit where credit is due. Be a warrior. Life is Good. . <a href=\"https://t.me/+Zk2A-hjc67kwOTdh\"> Website </a>\nWhen: Thu, 9:00A _(60m)\nWhere: FS: The FireSteel.com Event Canopy, RV13","location":"FS","startDatetime":"2023-06-22T13:00:00Z","endDatetime":"2023-06-22T14:00:00Z","timestamp":"2023-04-30T22:11:16Z"},{"summary":"<b>Life Is Good: Fri Morning AA Meeting</b> Mark Hansen [FS]","description":"For Whom: For anybody who is sober or trying to stay sober during the week, and for anybody who might be having a difficult time with substances and trying to stop. Is alcohol or other substances becoming overwhelming,  consuming, or taking over your life? Habits can become addictions for some people, and when it becomes a problem, it may be time to stop. When your body gets used to having foreign substances in it every day (such as alcohol), it may be physiologically very difficult to stop or change the habit/addiction. I’ve found it more helpful to talk with others who have actually gone through it, than to talk with counselors who haven’t. —Mark\nDescription: A morning group for those who will not be drinking and/or participating in extracurricular substances who would like to have a coffee, chat, or support and encourage each other to stay sober. \nOrganizer: Mark Hansen, Mark Hansen, Mark has been sober for over 8 years. He realized that alcohol was becoming a problem in his life, and didn’t want to be remembered as being an alcoholic. He didn’t want his children to remember him that way, and he didn’t want alcohol to take his life. As a former park ranger and security officer at a hospital, he has seen his fair share of what alcohol addiction can do to a person. He has witnessed people going through detox. He has seen the physical and psychological effects of it, and he has seen people die from alcoholism and drug overdose. He didn’t want alcohol to win, so he decided to be a warrior to defeat it. \nMark is teaching special education again, hiking, riding motorcycles, and enjoying the 2A and shooting sports these days. He is truly grateful to God (his higher power) for saving his life, and he’s giving credit where credit is due. Be a warrior. Life is Good. . <a href=\"https://t.me/+Zk2A-hjc67kwOTdh\"> Website </a>\nWhen: Fri, 9:00A _(60m)\nWhere: FS: The FireSteel.com Event Canopy, RV13","location":"FS","startDatetime":"2023-06-23T13:00:00Z","endDatetime":"2023-06-23T14:00:00Z","timestamp":"2023-04-30T22:11:16Z"},{"summary":"<b>Life Is Good:  Sat Morning AA Meeting</b> Mark Hansen [FS]","description":"For Whom: For anybody who is sober or trying to stay sober during the week, and for anybody who might be having a difficult time with substances and trying to stop. Is alcohol or other substances becoming overwhelming,  consuming, or taking over your life? Habits can become addictions for some people, and when it becomes a problem, it may be time to stop. When your body gets used to having foreign substances in it every day (such as alcohol), it may be physiologically very difficult to stop or change the habit/addiction. I’ve found it more helpful to talk with others who have actually gone through it, than to talk with counselors who haven’t. —Mark\nDescription: A morning group for those who will not be drinking and/or participating in extracurricular substances who would like to have a coffee, chat, or support and encourage each other to stay sober. \n\nOrganizer: Mark Hansen, Mark Hansen, Mark has been sober for over 8 years. He realized that alcohol was becoming a problem in his life, and didn’t want to be remembered as being an alcoholic. He didn’t want his children to remember him that way, and he didn’t want alcohol to take his life. As a former park ranger and security officer at a hospital, he has seen his fair share of what alcohol addiction can do to a person. He has witnessed people going through detox. He has seen the physical and psychological effects of it, and he has seen people die from alcoholism and drug overdose. He didn’t want alcohol to win, so he decided to be a warrior to defeat it. \nMark is teaching special education again, hiking, riding motorcycles, and enjoying the 2A and shooting sports these days. He is truly grateful to God (his higher power) for saving his life, and he’s giving credit where credit is due. Be a warrior. Life is Good. . <a href=\"https://t.me/+Zk2A-hjc67kwOTdh\"> Website </a>\nWhen: Sat, 9:00A _(60m)\nWhere: FS: The FireSteel.com Event Canopy, RV13","location":"FS","startDatetime":"2023-06-24T13:00:00Z","endDatetime":"2023-06-24T14:00:00Z","timestamp":"2023-04-30T22:11:16Z"},{"summary":"<b>Life Is Good: Sunday Morning AA Meeting</b> Mark Hansen [FS]","description":"For Whom: For anybody who is sober or trying to stay sober during the week, and for anybody who might be having a difficult time with substances and trying to stop. Is alcohol or other substances becoming overwhelming,  consuming, or taking over your life? Habits can become addictions for some people, and when it becomes a problem, it may be time to stop. When your body gets used to having foreign substances in it every day (such as alcohol), it may be physiologically very difficult to stop or change the habit/addiction. I’ve found it more helpful to talk with others who have actually gone through it, than to talk with counselors who haven’t. —Mark\nDescription: A morning group for those who will not be drinking and/or participating in extracurricular substances who would like to have a coffee, chat, or support and encourage each other to stay sober. \nOrganizer: Mark Hansen, Mark Hansen, Mark has been sober for over 8 years. He realized that alcohol was becoming a problem in his life, and didn’t want to be remembered as being an alcoholic. He didn’t want his children to remember him that way, and he didn’t want alcohol to take his life. As a former park ranger and security officer at a hospital, he has seen his fair share of what alcohol addiction can do to a person. He has witnessed people going through detox. He has seen the physical and psychological effects of it, and he has seen people die from alcoholism and drug overdose. He didn’t want alcohol to win, so he decided to be a warrior to defeat it. \nMark is teaching special education again, hiking, riding motorcycles, and enjoying the 2A and shooting sports these days. He is truly grateful to God (his higher power) for saving his life, and he’s giving credit where credit is due. Be a warrior. Life is Good. . <a href=\"https://t.me/+Zk2A-hjc67kwOTdh\"> Website </a>\nWhen: Sun, 9:00A _(60m)\nWhere: FS: The FireSteel.com Event Canopy, RV13","location":"FS","startDatetime":"2023-06-25T13:00:00Z","endDatetime":"2023-06-25T14:00:00Z","timestamp":"2023-04-30T22:11:16Z"},{"summary":"<b>The Daily Stitch & Bitch (Mon)</b> Ilma & Friends [FS]","description":"For Whom: Knitters, Crocheters, Embroiderers, Tatters, Felters, Leatherworkers, Cross Stitchers, Needlepointers, Sewers, Spinners, Crafters, Beaders, etc, etc, etc, are all welcome to join us for some good old fashioned \"Stitchin' an' Bitchin'\". Bring a project and a drinking mug. We'll have hot water for tea, coffee, and maybe a sewing machine or two to use. Want to learn how to do these things? Come on over and we'll answer your questions and offer suggestions, but know that this is meant to be an informal hangout group, not a formal teaching class. Check out the separate teaching classes scattered throughout the schedule or watch a bunch of tutorials online so you can have a basic idea of what's involved. What are you waiting for? Come meet your new BFFs at this year's \"Daily Stitch & Bitch\"!\nDescription: \"Stitch and Bitch\" groups have been around since before WWII, when they were composed primarily of knitters. In modern times, the S&B movement has gradually expanded to include all manner of crafters and fiber artists. Our PorcFest edition will of the modern type and will be a daily happening from noon to 2 PM at the FireSteel.com Canopy located at RV13 (or 13 Anarchy Isle, Bottom).\nOrganizer: Ilma & Friends, Ilma (the organizer) first learned how to crochet at the age of 8, and then 20 years later she learned how to knit in order to teach an actor to look legit while performing in a play that required knitting. She then proceeded to forget all about both of these techniques until about 12 years ago when her daughter needed help with some crochet stitches and she took up her hooks again. Then she took up her needles. Now she's got more projects than time. It's a certainty that all the other S&B-ers have similar stories. Come join us and tell us your own!. <a href=\"https://t.me/+Ap_JN5REOxY2OTlh\"> Website </a>\nWhen: Mon, 12:00P (120m)\nWhere: FS: The FireSteel.com Event Canopy, RV13\n<a href=\"https://t.me/+Ap_JN5REOxY2OTlh\">More Info </a>","location":"FS","startDatetime":"2023-06-19T16:00:00Z","endDatetime":"2023-06-19T18:00:00Z","timestamp":"2023-04-30T22:11:16Z"},{"summary":"<b>The Daily Stitch & Bitch (Tues)</b> Ilma & Friends [FS]","description":"For Whom: Knitters, Crocheters, Embroiderers, Tatters, Felters, Leatherworkers, Cross Stitchers, Needlepointers, Sewers, Spinners, Crafters, Beaders, etc, etc, etc, are all welcome to join us for some good old fashioned \"Stitchin' an' Bitchin'\". Bring a project and a drinking mug. We'll have hot water for tea, coffee, and maybe a sewing machine or two to use. Want to learn how to do these things? Come on over and we'll answer your questions and offer suggestions, but know that this is meant to be an informal hangout group, not a formal teaching class. Check out the separate teaching classes scattered throughout the schedule or watch a bunch of tutorials online so you can have a basic idea of what's involved. What are you waiting for? Come meet your new BFFs at this year's \"Daily Stitch & Bitch\"!\nDescription: \"Stitch and Bitch\" groups have been around since before WWII, when they were composed primarily of knitters. In modern times, the S&B movement has gradually expanded to include all manner of crafters and fiber artists. Our PorcFest edition will of the modern type and will be a daily happening from noon to 2 PM at the FireSteel.com Canopy located at RV13 (or 13 Anarchy Isle, Bottom).\nOrganizer: Ilma & Friends, Ilma (the organizer) first learned how to crochet at the age of 8, and then 20 years later she learned how to knit in order to teach an actor to look legit while performing in a play that required knitting. She then proceeded to forget all about both of these techniques until about 12 years ago when her daughter needed help with some crochet stitches and she took up her hooks again. Then she took up her needles. Now she's got more projects than time. It's a certainty that all the other S&B-ers have similar stories. Come join us and tell us your own!. <a href=\"https://t.me/+Ap_JN5REOxY2OTlh\"> Website </a>\nWhen: Tue, 12:00P (120m)\nWhere: FS: The FireSteel.com Event Canopy, RV13\n<a href=\"https://t.me/+Ap_JN5REOxY2OTlh\">More Info </a>","location":"FS","startDatetime":"2023-06-20T16:00:00Z","endDatetime":"2023-06-20T18:00:00Z","timestamp":"2023-04-30T22:11:16Z"},{"summary":"<b>The Daily Stitch & Bitch (Weds)</b> Ilma & Friends [FS]","description":"For Whom: Knitters, Crocheters, Embroiderers, Tatters, Felters, Leatherworkers, Cross Stitchers, Needlepointers, Sewers, Spinners, Crafters, Beaders, etc, etc, etc, are all welcome to join us for some good old fashioned \"Stitchin' an' Bitchin'\". Bring a project and a drinking mug. We'll have hot water for tea, coffee, and maybe a sewing machine or two to use. Want to learn how to do these things? Come on over and we'll answer your questions and offer suggestions, but know that this is meant to be an informal hangout group, not a formal teaching class. Check out the separate teaching classes scattered throughout the schedule or watch a bunch of tutorials online so you can have a basic idea of what's involved. What are you waiting for? Come meet your new BFFs at this year's \"Daily Stitch & Bitch\"!\nDescription: \"Stitch and Bitch\" groups have been around since before WWII, when they were composed primarily of knitters. In modern times, the S&B movement has gradually expanded to include all manner of crafters and fiber artists. Our PorcFest edition will of the modern type and will be a daily happening from noon to 2 PM at the FireSteel.com Canopy located at RV13 (or 13 Anarchy Isle, Bottom).\nOrganizer: Ilma & Friends, Ilma (the organizer) first learned how to crochet at the age of 8, and then 20 years later she learned how to knit in order to teach an actor to look legit while performing in a play that required knitting. She then proceeded to forget all about both of these techniques until about 12 years ago when her daughter needed help with some crochet stitches and she took up her hooks again. Then she took up her needles. Now she's got more projects than time. It's a certainty that all the other S&B-ers have similar stories. Come join us and tell us your own!. <a href=\"https://t.me/+Ap_JN5REOxY2OTlh\"> Website </a>\nWhen: Wed, 12:00P (120m)\nWhere: FS: The FireSteel.com Event Canopy, RV13\n<a href=\"https://t.me/+Ap_JN5REOxY2OTlh\">More Info </a>","location":"FS","startDatetime":"2023-06-21T16:00:00Z","endDatetime":"2023-06-21T18:00:00Z","timestamp":"2023-04-30T22:11:16Z"},{"summary":"<b>The Daily Stitch & Bitch (Thurs)</b> Ilma & Friends [FS]","description":"For Whom: Knitters, Crocheters, Embroiderers, Tatters, Felters, Leatherworkers, Cross Stitchers, Needlepointers, Sewers, Spinners, Crafters, Beaders, etc, etc, etc, are all welcome to join us for some good old fashioned \"Stitchin' an' Bitchin'\". Bring a project and a drinking mug. We'll have hot water for tea, coffee, and maybe a sewing machine or two to use. Want to learn how to do these things? Come on over and we'll answer your questions and offer suggestions, but know that this is meant to be an informal hangout group, not a formal teaching class. Check out the separate teaching classes scattered throughout the schedule or watch a bunch of tutorials online so you can have a basic idea of what's involved. What are you waiting for? Come meet your new BFFs at this year's \"Daily Stitch & Bitch\"!\nDescription: \"Stitch and Bitch\" groups have been around since before WWII, when they were composed primarily of knitters. In modern times, the S&B movement has gradually expanded to include all manner of crafters and fiber artists. Our PorcFest edition will of the modern type and will be a daily happening from noon to 2 PM at the FireSteel.com Canopy located at RV13 (or 13 Anarchy Isle, Bottom).\nOrganizer: Ilma & Friends, Ilma (the organizer) first learned how to crochet at the age of 8, and then 20 years later she learned how to knit in order to teach an actor to look legit while performing in a play that required knitting. She then proceeded to forget all about both of these techniques until about 12 years ago when her daughter needed help with some crochet stitches and she took up her hooks again. Then she took up her needles. Now she's got more projects than time. It's a certainty that all the other S&B-ers have similar stories. Come join us and tell us your own!. <a href=\"https://t.me/+Ap_JN5REOxY2OTlh\"> Website </a>\nWhen: Thu, 12:00P (120m)\nWhere: FS: The FireSteel.com Event Canopy, RV13\n<a href=\"https://t.me/+Ap_JN5REOxY2OTlh\">More Info </a>","location":"FS","startDatetime":"2023-06-22T16:00:00Z","endDatetime":"2023-06-22T18:00:00Z","timestamp":"2023-04-30T22:11:16Z"},{"summary":"<b>The Daily Stitch & Bitch (Fri)</b> Ilma & Friends [FS]","description":"For Whom: Knitters, Crocheters, Embroiderers, Tatters, Felters, Leatherworkers, Cross Stitchers, Needlepointers, Sewers, Spinners, Crafters, Beaders, etc, etc, etc, are all welcome to join us for some good old fashioned \"Stitchin' an' Bitchin'\". Bring a project and a drinking mug. We'll have hot water for tea, coffee, and maybe a sewing machine or two to use. Want to learn how to do these things? Come on over and we'll answer your questions and offer suggestions, but know that this is meant to be an informal hangout group, not a formal teaching class. Check out the separate teaching classes scattered throughout the schedule or watch a bunch of tutorials online so you can have a basic idea of what's involved. What are you waiting for? Come meet your new BFFs at this year's \"Daily Stitch & Bitch\"!\nDescription: \"Stitch and Bitch\" groups have been around since before WWII, when they were composed primarily of knitters. In modern times, the S&B movement has gradually expanded to include all manner of crafters and fiber artists. Our PorcFest edition will of the modern type and will be a daily happening from noon to 2 PM at the FireSteel.com Canopy located at RV13 (or 13 Anarchy Isle, Bottom).\nOrganizer: Ilma & Friends, Ilma (the organizer) first learned how to crochet at the age of 8, and then 20 years later she learned how to knit in order to teach an actor to look legit while performing in a play that required knitting. She then proceeded to forget all about both of these techniques until about 12 years ago when her daughter needed help with some crochet stitches and she took up her hooks again. Then she took up her needles. Now she's got more projects than time. It's a certainty that all the other S&B-ers have similar stories. Come join us and tell us your own!. <a href=\"https://t.me/+Ap_JN5REOxY2OTlh\"> Website </a>\nWhen: Fri, 12:00P (120m)\nWhere: FS: The FireSteel.com Event Canopy, RV13\n<a href=\"https://t.me/+Ap_JN5REOxY2OTlh\">More Info </a>","location":"FS","startDatetime":"2023-06-23T16:00:00Z","endDatetime":"2023-06-23T18:00:00Z","timestamp":"2023-04-30T22:11:16Z"},{"summary":"<b>The Daily Stitch & Bitch (Sat)</b> Ilma & Friends [FS]","description":"For Whom: Knitters, Crocheters, Embroiderers, Tatters, Felters, Leatherworkers, Cross Stitchers, Needlepointers, Sewers, Spinners, Crafters, Beaders, etc, etc, etc, are all welcome to join us for some good old fashioned \"Stitchin' an' Bitchin'\". Bring a project and a drinking mug. We'll have hot water for tea, coffee, and maybe a sewing machine or two to use. Want to learn how to do these things? Come on over and we'll answer your questions and offer suggestions, but know that this is meant to be an informal hangout group, not a formal teaching class. Check out the separate teaching classes scattered throughout the schedule or watch a bunch of tutorials online so you can have a basic idea of what's involved. What are you waiting for? Come meet your new BFFs at this year's \"Daily Stitch & Bitch\"!\nDescription: \"Stitch and Bitch\" groups have been around since before WWII, when they were composed primarily of knitters. In modern times, the S&B movement has gradually expanded to include all manner of crafters and fiber artists. Our PorcFest edition will of the modern type and will be a daily happening from noon to 2 PM at the FireSteel.com Canopy located at RV13 (or 13 Anarchy Isle, Bottom).\nOrganizer: Ilma & Friends, Ilma (the organizer) first learned how to crochet at the age of 8, and then 20 years later she learned how to knit in order to teach an actor to look legit while performing in a play that required knitting. She then proceeded to forget all about both of these techniques until about 12 years ago when her daughter needed help with some crochet stitches and she took up her hooks again. Then she took up her needles. Now she's got more projects than time. It's a certainty that all the other S&B-ers have similar stories. Come join us and tell us your own!. <a href=\"https://t.me/+Ap_JN5REOxY2OTlh\"> Website </a>\nWhen: Sat, 12:00P (120m)\nWhere: FS: The FireSteel.com Event Canopy, RV13\n<a href=\"https://t.me/+Ap_JN5REOxY2OTlh\">More Info </a>","location":"FS","startDatetime":"2023-06-24T16:00:00Z","endDatetime":"2023-06-24T18:00:00Z","timestamp":"2023-04-30T22:11:16Z"},{"summary":"<b>Rocket Launch</b> Brian Becker [Field]","description":"For Whom: Children, teens\nDescription: Rocket Launch....to the moon! A huge hit last year and back again. Come watch as everyone launches their rockets. If you'd like to launch a rocket be sure to build your rocket Wednesday ($25, may be reserved in advance or first come, first served).\n: Brian Becker\nWhen: Sat, 3:00P (120m)\nWhere: Field: Field, Field\n<a href=\"https://www.signupgenius.com/go/10C094AAFA923A7FCC52-reserve\">More Info </a>","location":"Field","startDatetime":"2023-06-24T19:00:00Z","endDatetime":"2023-06-24T21:00:00Z","timestamp":"2023-04-30T22:11:16Z"},{"summary":"<b>Porcfest Military Veterans Group Photo</b> Derek Proulx [Field]","description":"For Whom: Military service members and veterans\nDescription: Group photo of all those who have served or currently serving in the military. Immediately following the Photo Shoot: Official PorcFest XX Group Photo.\nHost: Derek Proulx, Derek Proulx - Former NH Army National Guard SGT E5 MOS-13M, Defend The Guard NH State Organizer.\nWhen: Sat, 3:00P _(30m)\nWhere: Field: Field, Field","location":"Field","startDatetime":"2023-06-24T19:00:00Z","endDatetime":"2023-06-24T19:30:00Z","timestamp":"2023-04-30T22:11:16Z"},{"summary":"<b>Political Activism: Croydon Budget Battle</b> Ian Underwood, Jody Underwood [FS]","description":"For Whom: Political activists, people with ideas about how to leverage the Croydon Budget Battle experience\nDescription: After the presentation about the Croydon Budget Battle (Pavilion, 2pm), we invite people to brainstorm how lessons learned from our experience can be used for other people's political activism. A newly published book about the Croydon Budget Battle will also be available for purchase and autograph by the author. \nLeader: Ian Underwood, Ian Underwood was the person who instigated the Croydon Budget Battle. \nLeader: Jody Underwood, Jody Underwood, then chair of the Croydon school board, had to clean up the mess that Ian instigated. \nWhen: Wed, 3:00P _(60m)\nWhere: FS: The FireSteel.com Event Canopy, RV13\n<a href=\"https://www.bareminimumbooks.com/\">More Info </a>","location":"FS","startDatetime":"2023-06-21T19:00:00Z","endDatetime":"2023-06-21T20:00:00Z","timestamp":"2023-04-30T22:11:16Z"},{"summary":"<b>First Annual Book Signing Party!</b> Ian Underwood, Jody Underwood [FS]","description":"For Whom: Anyone who knows Ian, has attended any of his talks over the years, have read any of his books, and anyone interested in supporting liberty authors. \nDescription: Ian Underwood, via BareMinimumBooks, has published 12 books in the first year.  Come celebrate this milestone with us, share a toast, and buy some books and get them signed by the author! \nAuthor: Ian Underwood, Ian has written and illustrated a dozen Bare Minimum Books, each based on liberty talks he's given over the years. \nModerator: Jody Underwood, Jody does all the backend work for Bare Minimum Books.\nWhen: Wed, 7:00P _(60m)\nWhere: FS: The FireSteel.com Event Canopy, RV13\n<a href=\"https://www.bareminimumbooks.com/\">More Info </a>","location":"FS","startDatetime":"2023-06-21T23:00:00Z","endDatetime":"2023-06-22T00:00:00Z","timestamp":"2023-04-30T22:11:16Z"},{"summary":"<b>DAILY Football game (weather permitting?)</b> Alu Axelman [Field]","description":"For Whom: Athletic people, football fans, those interested in learning how to play football, anyone who likes fun and hates communism, anyone wanting a workout\nDescription: Join Alu and others in a pickup game of casual (or intense) football - we'll figure out the rules on the spot and we'll have a blast! \nOrganizer: Alu Axelman\nWhen: Tue, 1:00P _(60m)\nWhere: Field: Field, Field\nNote: Bring cleats, athletic wear, and anything else you want (mouthguard, cup, football, etc.)","location":"Field","startDatetime":"2023-06-20T17:00:00Z","endDatetime":"2023-06-20T18:00:00Z","timestamp":"2023-04-30T22:11:16Z"},{"summary":"<b>Project Appleseed</b> Brent Buddensee [FS]","description":"For Whom: \nDescription: \nSpeaker: Brent Buddensee\nWhen: Sat, 10:00A (120m)\nWhere: FS: The FireSteel.com Event Canopy, RV13","location":"FS","startDatetime":"2023-06-24T14:00:00Z","endDatetime":"2023-06-24T16:00:00Z","timestamp":"2023-04-30T22:11:16Z"},{"summary":"<b>Yoga Talk with Andrew Noveske</b> Andrew Noveske [FS]","description":"For Whom: \nDescription: \nSpeaker: Andrew Noveske\nWhen: Thu, 7:00P (120m)\nWhere: FS: The FireSteel.com Event Canopy, RV13","location":"FS","startDatetime":"2023-06-22T23:00:00Z","endDatetime":"2023-06-23T01:00:00Z","timestamp":"2023-04-30T22:11:16Z"},{"summary":"<b>Alu Axelman book signing/secession Q&A/chat</b> Elliot Axelman [FS]","description":"For Whom: If you have an interest in secession, liberty books, due process, corona-fascism, or want to chat with Alu about anything, or if you want a personalized signed copy of one of his books, this event is for you!\nDescription: \nSpeaker: Elliot Axelman, Alu is the founder and editor-in-chief of LibertyBlock.com and President of the Foundation for NH Independence. He has been speaking and writing about peaceful separation since 2017, and he has written 8 books about liberty and secession.. <a href=\"LibertyBlock.com\"> Website </a>\nWhen: Wed, 8:00P _(60m)\nWhere: FS: The FireSteel.com Event Canopy, RV13\n<a href=\"AluAxelman.com\">More Info </a>","location":"FS","startDatetime":"2023-06-22T00:00:00Z","endDatetime":"2023-06-22T01:00:00Z","timestamp":"2023-04-30T22:11:16Z"},{"summary":"<b>Alu Axleman Book Signing Extravaganza</b> Alu Axleman [FS]","description":"For Whom: \nDescription: \nAuthor: Alu Axleman\nWhen: Wed, 8:00P _(60m)\nWhere: FS: The FireSteel.com Event Canopy, RV13","location":"FS","startDatetime":"2023-06-22T00:00:00Z","endDatetime":"2023-06-22T01:00:00Z","timestamp":"2023-04-30T22:11:16Z"},{"summary":"<b>NH Gun Laws and PorcFest Carrying Etiquette</b> Tony Lekas [FS]","description":"For Whom: \nDescription: \nSpeaker: Tony Lekas\nWhen: Tue, 4:00P (120m)\nWhere: FS: The FireSteel.com Event Canopy, RV13","location":"FS","startDatetime":"2023-06-20T20:00:00Z","endDatetime":"2023-06-20T22:00:00Z","timestamp":"2023-04-30T22:11:16Z"},{"summary":"<b>NH Gun Laws and PorcFest Carrying Etiquette</b> Tony Lekas [FS]","description":"For Whom: \nDescription: \nSpeaker: Tony Lekas\nWhen: Thu, 10:00A (120m)\nWhere: FS: The FireSteel.com Event Canopy, RV13","location":"FS","startDatetime":"2023-06-22T14:00:00Z","endDatetime":"2023-06-22T16:00:00Z","timestamp":"2023-04-30T22:11:16Z"},{"summary":"<b>Girls With Guns</b> Kate Ziegler [FS]","description":"For Whom: \nDescription: \nOrganizer: Kate Ziegler\nWhen: Sat, 3:00P _(60m)\nWhere: FS: The FireSteel.com Event Canopy, RV13","location":"FS","startDatetime":"2023-06-24T19:00:00Z","endDatetime":"2023-06-24T20:00:00Z","timestamp":"2023-04-30T22:11:16Z"},{"summary":"<b>(Beginner's) Knitting For Liberty</b> Karen [FS]","description":"For Whom: People who want to learn to knit. If you know how to knit, come hang out and/or help the beginners. \nDescription: Have you always wanted to try knitting or want to get re-acquainted? Join us for a beginner class. We will learn the basics, and when you're done you can keep going to make a garter stitch scarf! We will also talk about how knitting is not just a fun hobby, but can be a useful skill for survival and self-sufficiency. \nInstructor: Karen, Karen has been a knitter for many years and likes teaching people things.\nWhen: Tue, 10:00A _(60m)\nWhere: FS: The FireSteel.com Event Canopy, RV13\nNote: What to bring: \n- Knitting needles in size US 7 or larger, \n- A ball of *light colored* yarn that works with your needles. \n- Willingness to learn, patience, and acceptance of mistakes\nNote: We will have a very limited amount of supplies to try with, but you will not be able to take them with you. \n<a href=\"https://t.me/+Ap_JN5REOxY2OTlh\">More Info </a>","location":"FS","startDatetime":"2023-06-20T14:00:00Z","endDatetime":"2023-06-20T15:00:00Z","timestamp":"2023-04-30T22:11:16Z"},{"summary":"<b>Beginner's Crochet</b> Kristin Alpert [FS]","description":"For Whom: Curious about Crochet? Then come to this basic class/overview of the foundation techniques. If you have them, bring those crochet hooks that have been taunting you in the corner gathering dust. If you don't have a kit, we'll have some with which to practice during the class and some others you can purchase so you can continue to practice after the class or at one of our many \"Stitch & Bitch\" gatherings throughout the week.\n. . .Alternately, you can get your own yarn, hooks and/or a basic kit at the Walmart in Littleton, which is on the way to Roger's. If you're buying your own kit to bring, just:\n1. Select a small skein of a light colored acrylic or cotton material (easier to see the stitches than with a dark color) in a worsted or sport weight (look on the label for the yarn weight). Number 4 is best.\n2. Look at the yarn's label to see what size hook is recommended. You should see a picture of a hook with the size next to it. Bring that size hook or buy one if you don't have one already.\n3. Ask an attendant at the store for help if you're not sure what to get.\n4. Watch some beginner YouTube videos or buy a beginner \"How to Crochet\" book. It'll all make sense quicker if you've prepared before you come to PorcFest. \n5. Show up to class on Tuesday with your kit and say Hi!!!\nDescription: This is a beginner class where your fabulous instructor will teach you (or help you relearn) the basics. You will learn how to do a chain stitch and a \"single crochet\" stitch in this class.  Master these stitches and you can start making crochet hats, scarves, blankets, and the like.  See you there!\nInstructor: Kristin Alpert, Kristin learned to crochet when she was a pre-teen from her grandmother. She then let it slide while she attended Nursing school and started raising a family. In 2005, Kristin started crocheting again and found it was like riding a bike; everything came back to her! She finds it very relaxing and rewarding and especially enjoys making items which she gifts or donates to various causes. She hopes this class will spark interest and future learning for others.. <a href=\"https://t.me/+Ap_JN5REOxY2OTlh\"> Website </a>\nWhen: Tue, 11:00P _(60m)\nWhere: FS: The FireSteel.com Event Canopy, RV13\nNote: Join us for the \"Daily Stitch & Bitch\" from noon-2 all week (Monday to Saturday), and practice what you'll learn in this class!\n<a href=\"https://t.me/+Ap_JN5REOxY2OTlh\">More Info </a>","location":"FS","startDatetime":"2023-06-21T03:00:00Z","endDatetime":"2023-06-21T04:00:00Z","timestamp":"2023-04-30T22:11:16Z"},{"summary":"<b>Introduction to Using a Cricut Machine</b> Trista [FS]","description":"For Whom: \nDescription: \nSpeaker: Trista\nWhen: Tue, 2:00P _(60m)\nWhere: FS: The FireSteel.com Event Canopy, RV13","location":"FS","startDatetime":"2023-06-20T18:00:00Z","endDatetime":"2023-06-20T19:00:00Z","timestamp":"2023-04-30T22:11:16Z"},{"summary":"<b>Making Friends in the Free State</b> Liz [FS]","description":"For Whom: People who are looking to make new friends, or a friend in general! \nDescription: Ready to make some friends for the rest of the weekend? Trying to find your tribe? Want to just straight up make a friend? Come on down! We’ll bring the conversation starters, you bring yourself! \nOrganizer: Liz, Liz Going is a passionate people person who always seems to make a friend where ever she goes! Porcfest is such a large event, it’s Liz’s goal to help every person find their newest friend! \nWhen: Fri, 2:00P _(60m)\nWhere: FS: The FireSteel.com Event Canopy, RV13","location":"FS","startDatetime":"2023-06-23T18:00:00Z","endDatetime":"2023-06-23T19:00:00Z","timestamp":"2023-04-30T22:11:16Z"},{"summary":"<b>TBA T6 (Tony Olsen)</b> Tony Olsen [FS]","description":"For Whom: \nDescription: \nSpeaker: Tony Olsen\nWhen: Tue, 6:00P _(60m)\nWhere: FS: The FireSteel.com Event Canopy, RV13","location":"FS","startDatetime":"2023-06-20T22:00:00Z","endDatetime":"2023-06-20T23:00:00Z","timestamp":"2023-04-30T22:11:16Z"},{"summary":"<b>TBA W4</b>  [FS]","description":"For Whom: \nDescription: \nSpeaker: \nWhen: Wed, 4:00P _(60m)\nWhere: FS: The FireSteel.com Event Canopy, RV13","location":"FS","startDatetime":"2023-06-21T20:00:00Z","endDatetime":"2023-06-21T21:00:00Z","timestamp":"2023-04-30T22:11:16Z"},{"summary":"<b>W9 TBA</b>  [FS]","description":"For Whom: \nDescription: TBA\n: \nWhen: Wed, 9:00P _(60m)\nWhere: FS: The FireSteel.com Event Canopy, RV13","location":"FS","startDatetime":"2023-06-22T01:00:00Z","endDatetime":"2023-06-22T02:00:00Z","timestamp":"2023-04-30T22:11:16Z"},{"summary":"<b>W10 TBA</b>  [FS]","description":"For Whom: \nDescription: TBA\n: \nWhen: Wed, 10:00P _(60m)\nWhere: FS: The FireSteel.com Event Canopy, RV13","location":"FS","startDatetime":"2023-06-22T02:00:00Z","endDatetime":"2023-06-22T03:00:00Z","timestamp":"2023-04-30T22:11:16Z"},{"summary":"<b>Th10 TBA</b>  [FS]","description":"For Whom: \nDescription: TBA\n: \nWhen: Thu, 10:00P _(60m)\nWhere: FS: The FireSteel.com Event Canopy, RV13","location":"FS","startDatetime":"2023-06-23T02:00:00Z","endDatetime":"2023-06-23T03:00:00Z","timestamp":"2023-04-30T22:11:16Z"},{"summary":"<b>S9 TBA</b>  [FS]","description":"For Whom: \nDescription: TBA\n: \nWhen: Sat, 9:00P _(60m)\nWhere: FS: The FireSteel.com Event Canopy, RV13","location":"FS","startDatetime":"2023-06-25T01:00:00Z","endDatetime":"2023-06-25T02:00:00Z","timestamp":"2023-04-30T22:11:16Z"},{"summary":"<b>S10 TBA</b>  [FS]","description":"For Whom: \nDescription: TBA\n: \nWhen: Sat, 10:00P _(60m)\nWhere: FS: The FireSteel.com Event Canopy, RV13","location":"FS","startDatetime":"2023-06-25T02:00:00Z","endDatetime":"2023-06-25T03:00:00Z","timestamp":"2023-04-30T22:11:16Z"},{"summary":"<b>Pine Tree Radio Society Meetup</b> Jack [FS]","description":"For Whom: \nDescription: TBA\nOrganizer: Jack\nWhen: Mon, 9:00P (120m)\nWhere: FS: The FireSteel.com Event Canopy, RV13","location":"FS","startDatetime":"2023-06-20T01:00:00Z","endDatetime":"2023-06-20T03:00:00Z","timestamp":"2023-04-30T22:11:16Z"},{"summary":"<b>2A Meet & Greet</b> All 2A Peeps [FS]","description":"For Whom: \nDescription: \n: All 2A Peeps\nWhen: Mon, 7:00P (120m)\nWhere: FS: The FireSteel.com Event Canopy, RV13","location":"FS","startDatetime":"2023-06-19T23:00:00Z","endDatetime":"2023-06-20T01:00:00Z","timestamp":"2023-04-30T22:11:16Z"},{"summary":"<b>T10 TBA</b>  [FS]","description":"For Whom: \nDescription: TBA\n: \nWhen: Tue, 10:00P _(60m)\nWhere: FS: The FireSteel.com Event Canopy, RV13","location":"FS","startDatetime":"2023-06-21T02:00:00Z","endDatetime":"2023-06-21T03:00:00Z","timestamp":"2023-04-30T22:11:16Z"},{"summary":"<b>T9 TBA</b>  [FS]","description":"For Whom: \nDescription: TBA\n: \nWhen: Tue, 9:00P _(60m)\nWhere: FS: The FireSteel.com Event Canopy, RV13","location":"FS","startDatetime":"2023-06-21T01:00:00Z","endDatetime":"2023-06-21T02:00:00Z","timestamp":"2023-04-30T22:11:16Z"},{"summary":"<b>Hand Sewing for Beginners</b> Colleen [FS]","description":"For Whom: \nDescription: \nInstructor: Colleen\nWhen: Wed, 2:00P _(60m)\nWhere: FS: The FireSteel.com Event Canopy, RV13","location":"FS","startDatetime":"2023-06-21T18:00:00Z","endDatetime":"2023-06-21T19:00:00Z","timestamp":"2023-04-30T22:11:16Z"},{"summary":"<b>Good Night Alt-Right and Hello Liberty+!</b> William Bardon [FS]","description":"For Whom: Those who desire non-violent communication concerning how values such as race, nationhood, and tradition redound on the quest for liberty in our lifetime.\nDescription: Fascists hate liberty as much as globalists do. How then, did the \"libertarian to alt-right pipeline\" become a thing? Join Will and learn of his journey along the pipeline, why he came to repudiate the authoritarians of the right, and why he started his own organization dedicated to defeating fascism and globalism both.\nSpeaker: William Bardon. <a href=\"https://libertypl.us/\"> Website </a>. <a href=\"https://i0.wp.com/libertypl.us/wp-content/uploads/2023/02/gold-black-2@0.1x.png?w=185&ssl=1\"> Image </a>\nWhen: Sat, 8:00P _(60m)\nWhere: FS: The FireSteel.com Event Canopy, RV13\n<a href=\"https://libertypl.us/\">More Info </a>","location":"FS","startDatetime":"2023-06-25T00:00:00Z","endDatetime":"2023-06-25T01:00:00Z","timestamp":"2023-04-30T22:11:16Z"},{"summary":"<b>FireSteel.com Canopy Strike</b> Ilma [FS]","description":"For Whom: Checking out later in the day and have all your stuff packed and ready to go? If so, please consider stopping by and checking if we need a hand to take things down and pack things up. We'll have coffee/tea and snacks to share. For those of you unable to help or who are heading out today, safe travels to you and may we see you all again next year! (P.S. Toot your horn as you drive by so we can wave goodbye!)\nDescription: We sure could use some help to take down the FireSteel.com canopy and the FireSteel.com Shop (what we affectionately call our \"compound\"). It's been an amazing and unforgettable Porcfest; we've met so many cool new people and reconnected with our old friends, but now it's time to pack up and get back to all the other things that make life in NH awesome. Thanks for another unforgettable Porcfest and see you next year!!!\nOrganizer: Ilma, Ilma is the person who organized and scheduled all the 90 or so hours of events held at the FireSteel.com Canopy. Unlike Dennis, she doesn't have the energy of a toddler, and is probably really pooped by now. She sure could use a hand with the strike and will be eternally grateful for any help you are willing to offer.. <a href=\"https://FireSteel.com\"> Website </a>. <a href=\"https://cdn11.bigcommerce.com/s-474c8/product_images/uploaded_images/website-logo.jpg\"> Image </a>\nWhen: Sun, 10:00P (240m)\nWhere: FS: The FireSteel.com Event Canopy, RV13\nNote: Thanks for lending a hand and see you all next year!\n<a href=\"https://t.me/+jjYtMnPVq4wzYTEx\">More Info </a>","location":"FS","startDatetime":"2023-06-26T02:00:00Z","endDatetime":"2023-06-26T06:00:00Z","timestamp":"2023-04-30T22:11:16Z"},{"summary":"<b>Improv Comedy Jam</b> Jon Pawelko [HOME]","description":"For Whom: This is a live comedy event targeted towards adults.  Improv scenes may contain foul language and explicit material.\nDescription: The Improv Comedy Jam is a Porcfest tradition where you, the audience, gets to participate in various Improv games on stage.  Come on out and laugh at your friends or get into a Liberty-themed game yourself.  We’ll have at least one sketch comedy scene read off scripts and a few competitive Improv games at the end.  This event is usually held Wednesday nights in the “Creating Community” tents.  Last year it was 9 PM which worked well.\nHost: Jon Pawelko, Jon has hosted the Improv Jam at Porcfest for almost 10 years.\nWhen: Wed, 9:00P _(90m)\nWhere: HOME: HOMELAND, Field","location":"HOME","startDatetime":"2023-06-22T01:00:00Z","endDatetime":"2023-06-22T02:30:00Z","timestamp":"2023-04-30T22:11:16Z"},{"summary":"<b>Karaoke by Game Time Trivia</b> Whitney Rossman, Marc Cumberland, Donna Slopey [HOME]","description":"For Whom: If you love to entertain, or want to step out of your comfort zone and do something fun.  Parental supervision advised.  \nDescription: Karaoke by Game Time Trivia, Hosted by Marc Cumberland, Whitney Rossman and Donna Slopey.  Saturday night at 9:00 pm, in the Homeland tent\nHost: Whitney Rossman\nHost: Marc Cumberland, . <a href=\"gametimetrivia.com\"> Website </a>\nHost: Donna Slopey, \nWhen: Sat, 9:00P (120m)\nWhere: HOME: HOMELAND, Field","location":"HOME","startDatetime":"2023-06-25T01:00:00Z","endDatetime":"2023-06-25T03:00:00Z","timestamp":"2023-04-30T22:11:16Z"},{"summary":"<b>\"The Royal Flush\" Uncovering the Mystery of Septic</b> Kurtis Grassett, Jack Garber, Constance Spencer [HOME]","description":"For Whom: Those who want to understand the Do's and Don'ts of owning a septic system.\nDescription: Septic systems unearthed. Discover what makes your septic system tick. We are going to get to the \"bottom\" of it. So to speak!\nSpeaker: Kurtis Grassett, Kurtis Grassett, certified septic evaluator, is from Norway Hill Home Inspections a leader in the field of home inspections. Norway Hill Home Inspections has multiple Inspectors that are licensed by the state of New Hampshire to evaluate residential septic systems. In New Hampshire septic evaluators must be certified as of January of 2018. They are also able to evaluate in the state of Vermont and Maine.. <a href=\"https://norwayhillhomeinspections.com/\"> Website </a>\nWhen: Fri, 11:00A _(60m)\nWhere: HOME: HOMELAND, Field\n<a href=\"https://norwayhillhomeinspections.com/\">More Info </a>","location":"HOME","startDatetime":"2023-06-23T15:00:00Z","endDatetime":"2023-06-23T16:00:00Z","timestamp":"2023-04-30T22:11:16Z"},{"summary":"<b>Maj Toure - Meet, Greet and Graze</b> Maj Toure, Jack Garber, TBD [HOME]","description":"For Whom: Those at PorcFest who would like to meet Maj Toure in a casual setting.\nDescription: Maj Toure, a native of North Philadelphia, founded the educational nonprofit organization Black Guns Matter in 2016. The organization advocates for the right to keep and bear arms and promotes responsible ownership of firearms within African-American and urban communities. Toure was a candidate for an at-large seat in the Philadelphia City Council in the city's 2019 election. He ran as a Libertarian. In addition to his support for Second Amendment rights, his stated political priorities included: criminal justice reform; ending the practice of solitary confinement; legalization of cannabis; improved education in Philadelphia; and conflict resolution training for disconnected youths. \nPolitician & Celebrity : Maj Toure, He is the real Maj Toure.. <a href=\"https://en.wikipedia.org/wiki/Maj_Toure\"> Website </a>. <a href=\"https://www.facebook.com/photo/?fbid=892582877919256&set=a.106950646482487\"> Image </a>\nWhen: Thu, 10:00A _(60m)\nWhere: HOME: HOMELAND, Field\nNote: Maj Toure is the founder of Black Guns Matter (BGM) and Black Libertarianism Movement (BLM)\n<a href=\"https://www.facebook.com/profile.php?id=100015026555306\">More Info </a>","location":"HOME","startDatetime":"2023-06-22T14:00:00Z","endDatetime":"2023-06-22T15:00:00Z","timestamp":"2023-04-30T22:11:16Z"},{"summary":"<b>So Many Regions, How do I Choose?</b> Amber Daves, Constance Spenser [HOME]","description":"For Whom: New movers, potential movers and Porc's that want a better understanding of all the awesome regions in New Hampshire.\nDescription: An overview of the regions of NH. We will have guest from each region give a brief summary of the area and what it is like to live there. Bring your questions we are ready with answers.\nOrganizer: Amber Daves\nWhen: Wed, 5:00P (120m)\nWhere: HOME: HOMELAND, Field\nNote: This is a brief overview, a more indepth discussion will take place on Friday afternoon.","location":"HOME","startDatetime":"2023-06-21T21:00:00Z","endDatetime":"2023-06-21T23:00:00Z","timestamp":"2023-04-30T22:11:16Z"},{"summary":"<b>Maj Toure - Q & A</b> Maj Toure [HOME]","description":"For Whom: Attendee who want to get up close and personal with Maj Toure.\nDescription: Maj Toure, a native of North Philadelphia, founded the educational nonprofit organization Black Guns Matter in 2016. The organization advocates for the right to keep and bear arms and promotes responsible ownership of firearms within African-American and urban communities. He has released three rap/hip hop recordings: Solutionary Vol. 1 (2005), Solutionary Vol. 2 (2014), and Solutionary Vol. 3 (2016). Toure was a candidate for an at-large seat in the Philadelphia City Council in the city's 2019 election.\nSpeaker: Maj Toure, Maj Toure, a native of North Philadelphia, founded the educational nonprofit organization Black Guns Matter in 2016. The organization advocates for the right to keep and bear arms and promotes responsible ownership of firearms within African-American and urban communities. He has released three rap/hip hop recordings: Solutionary Vol. 1 (2005), Solutionary Vol. 2 (2014), and Solutionary Vol. 3 (2016). Toure was a candidate for an at-large seat in the Philadelphia City Council in the city's 2019 election. He ran as a Libertarian. In addition to his support for Second Amendment rights, his stated political priorities included: criminal justice reform; ending the practice of solitary confinement; legalization of cannabis; improved education in Philadelphia; and conflict resolution training for disconnected youths. On November 5, 2019, Toure finished 15th in a field of 17 candidates in the city's election, failing to secure a seat on the City Council. He received 5,676 votes (0.5% of the vote total).. <a href=\"https://solutionarylifestyle.org/\"> Website </a>. <a href=\"https://solutionarylifestyle.org/wp-content/uploads/2022/04/IMG_4976.jpg\"> Image </a>\nWhen: Fri, 1:00P _(60m)\nWhere: HOME: HOMELAND, Field\nNote: Meet the Libertarian Politician and celebrity Maj Toure.\n<a href=\"https://solutionarylifestyle.org/\">More Info </a>","location":"HOME","startDatetime":"2023-06-23T17:00:00Z","endDatetime":"2023-06-23T18:00:00Z","timestamp":"2023-04-30T22:11:16Z"},{"summary":"<b>Maj Toure Q&A</b> Maj Toure [HOME]","description":"For Whom: Attendee who want to get up close and personal with Maj Toure.\nDescription: Maj Toure, a native of North Philadelphia, founded the educational nonprofit organization Black Guns Matter in 2016. The organization advocates for the right to keep and bear arms and promotes responsible ownership of firearms within African-American and urban communities. He has released three rap/hip hop recordings: Solutionary Vol. 1 (2005), Solutionary Vol. 2 (2014), and Solutionary Vol. 3 (2016). Toure was a candidate for an at-large seat in the Philadelphia City Council in the city's 2019 election.\nPolitician & Celebrity: Maj Toure, Maj Toure, a native of North Philadelphia, founded the educational nonprofit organization Black Guns Matter in 2016. The organization advocates for the right to keep and bear arms and promotes responsible ownership of firearms within African-American and urban communities. He has released three rap/hip hop recordings: Solutionary Vol. 1 (2005), Solutionary Vol. 2 (2014), and Solutionary Vol. 3 (2016). Toure was a candidate for an at-large seat in the Philadelphia City Council in the city's 2019 election. He ran as a Libertarian. In addition to his support for Second Amendment rights, his stated political priorities included: criminal justice reform; ending the practice of solitary confinement; legalization of cannabis; improved education in Philadelphia; and conflict resolution training for disconnected youths. On November 5, 2019, Toure finished 15th in a field of 17 candidates in the city's election, failing to secure a seat on the City Council. He received 5,676 votes (0.5% of the vote total).. <a href=\"https://solutionarylifestyle.org/\"> Website </a>. <a href=\"https://solutionarylifestyle.org/wp-content/uploads/2022/04/IMG_4976.jpg\"> Image </a>\nWhen: Sat, 3:00P _(60m)\nWhere: HOME: HOMELAND, Field\nNote: Meet the Libertarian Politician and celebrity Maj Toure.\n<a href=\"https://solutionarylifestyle.org/\">More Info </a>","location":"HOME","startDatetime":"2023-06-24T19:00:00Z","endDatetime":"2023-06-24T20:00:00Z","timestamp":"2023-04-30T22:11:16Z"},{"summary":"<b>New Hampshire Needs Workers!</b> Johann [HOME]","description":"For Whom: Anyone who wants to move here and needs to work or wants to start a new business here.\nDescription: We will discuss employment opportunities in New Hampshire.  Johann will lead the discussion at the Independence Realty Group tent starting at 9:00 AM on Thursday.\nLeader: Johann\nWhen: Thu, 9:00A _(60m)\nWhere: HOME: HOMELAND, Field","location":"HOME","startDatetime":"2023-06-22T13:00:00Z","endDatetime":"2023-06-22T14:00:00Z","timestamp":"2023-04-30T22:11:16Z"},{"summary":"<b>NH Regions: the good, the bad, and the beautiful!</b> Amber Daves [HOME]","description":"For Whom: New, and potential movers, and anyone interested in getting to know the regions in a more indepth way.\nDescription: We will have guests from each region to answer all of your questions about the communities they live in. This is an indepth discussion of each region, so bring ALL your questions! We will cover everyday life, attractions, fsp events, farming, city life, and anything else you want to know. \nOrganizer: Amber Daves\nWhen: Fri, 2:00P (180m)\nWhere: HOME: HOMELAND, Field","location":"HOME","startDatetime":"2023-06-23T18:00:00Z","endDatetime":"2023-06-23T21:00:00Z","timestamp":"2023-04-30T22:11:16Z"},{"summary":"<b>Alternative Medicine</b> Sarah Thompson [HOME]","description":"For Whom: If you are interested in learning about health, disease, and the arc of cure this is the talk for you.\nDescription: This presentation will cover the homeopathic approach to healing from acute and chronic disease.\nSpeaker: Sarah Thompson, Sarah is a practicing homeopath with a libertarian background. She's been on The Tom Woods Show and LewRockwell.com. <a href=\"www.innerseahomeopathy.com \"> Website </a>\nWhen: Wed, 11:00A _(90m)\nWhere: HOME: HOMELAND, Field\nNote: Schedule a free call with Sarah anytime through her website.\n<a href=\"www.innerseahomeopathy.com \">More Info </a>","location":"HOME","startDatetime":"2023-06-21T15:00:00Z","endDatetime":"2023-06-21T16:30:00Z","timestamp":"2023-04-30T22:11:16Z"},{"summary":"<b>Karaoke by Game Time Trivia</b> Whitney Rossman, Marc Chamberland [HOME]","description":"For Whom: Extroverts, performers, anyone who wants to sing and have a good time!\nDescription: Come have fun and sing it out for karaoke! Marc with Game Time Trivia is a professional trivia jockey and karaoke host with the most! Be ready to sing your hearts out and have a good time.\nOrganizer: Whitney Rossman, Fun fact: I was Marc’s first employee of Game Time Trivia in 2009. <a href=\"gametimetrivia.com\"> Website </a>\nHost: Marc Chamberland, \nWhen: Sat, 9:00P (120m)\nWhere: HOME: HOMELAND, Field\nNote: There will be a professional karaoke set up and some cool lights.","location":"HOME","startDatetime":"2023-06-25T01:00:00Z","endDatetime":"2023-06-25T03:00:00Z","timestamp":"2023-04-30T22:11:16Z"},{"summary":"<b>Emo Night PorcFest!</b> Ben Weir [LPNH]","description":"For Whom: Anyone who enjoys alternative non pop-culture music such as emo, punk, pop punk, metal, or metalcore.\nDescription: A live DJ, light show, dancing, and late 2000’s/early 2010’s emo music.\nHost: Ben Weir, Founder of the LP Emo Caucus, LPNH board member, lifelong musician. <a href=\"https://facebook.com/events/s/emo-night-porcfest/157801320541885/\"> Website </a>\nWhen: Thu, 8:00P (180m)\nWhere: LPNH: Libertarian Party New Hampshire, RV280\n<a href=\"https://facebook.com/events/s/emo-night-porcfest/157801320541885/\">More Info </a>","location":"LPNH","startDatetime":"2023-06-23T00:00:00Z","endDatetime":"2023-06-23T03:00:00Z","timestamp":"2023-04-30T22:11:16Z"},{"summary":"<b>Free Food For Weary Travelers </b> Tarrin Lupo [Blue]","description":"For Whom: Exhausted travelers who don't feel like cooking. \nDescription: Free Vegan Food till runs out - Gluten Free options too.  This is just something we do for goodwill every year to help out the community.  Food and supplies are donated by Luptopia. \nHost: Tarrin Lupo\nWhen: Mon, 5:00P _(90m)\nWhere: Blue: The Blueberry, MH4","location":"Blue","startDatetime":"2023-06-19T21:00:00Z","endDatetime":"2023-06-19T22:30:00Z","timestamp":"2023-04-30T22:11:16Z"},{"summary":"<b>Annual Vegan Potluck</b> Tarrin Lupo [Blue]","description":"For Whom: People interested in eating plant based.\nDescription: This is the 8th year of the Vegan Potluck.  Please bring a dish or donation of supplies if possible.  If not , that is fine, just try to pitch in and help clean up after.\nHost: Tarrin Lupo\nWhen: Sat, 3:00P _(90m)\nWhere: Blue: The Blueberry, MH4","location":"Blue","startDatetime":"2023-06-24T19:00:00Z","endDatetime":"2023-06-24T20:30:00Z","timestamp":"2023-04-30T22:11:16Z"},{"summary":"<b>Daily Free Pancakes</b> Tony Olsen [FH]","description":"For Whom: People who love socioeconomic freedom ... and free pancakes!\nDescription: Come and enjoy free pancakes and learn more about the Freedom Haven project.\nOrganizer: Tony Olsen, Tony has the ingredients, equipment, time, and willingness to make the pancakes.. <a href=\"https://freedomhaven.org/\"> Website </a>. <a href=\"https://freedomhaven.org/Tony/FreedomHaven/20220707-TheFreedomYouSeek-V16-4Kx5K-Opague.png\"> Image </a>\nWhen: Mon, 9:00A (120m)\nWhere: FH: The Freedom Haven project, RV35\nNote: Pancakes, syrup, butter, and margarine will be provided. \n<a href=\"https://t.me/+b3mFCVVxYERmNWEx\">More Info </a>","location":"FH","startDatetime":"2023-06-19T13:00:00Z","endDatetime":"2023-06-19T15:00:00Z","timestamp":"2023-04-30T22:11:16Z"},{"summary":"<b>Daily Free Pancakes</b> Tony Olsen [FH]","description":"For Whom: People who love socioeconomic freedom ... and free pancakes!\nDescription: Come and enjoy free pancakes and learn more about the Freedom Haven project.\nOrganizer: Tony Olsen, Tony has the ingredients, equipment, time, and willingness to make the pancakes.. <a href=\"https://freedomhaven.org/\"> Website </a>. <a href=\"https://freedomhaven.org/Tony/FreedomHaven/20220707-TheFreedomYouSeek-V16-4Kx5K-Opague.png\"> Image </a>\nWhen: Tue, 9:00A (120m)\nWhere: FH: The Freedom Haven project, RV35\nNote: Pancakes, syrup, butter, and margarine will be provided. \n<a href=\"https://t.me/+b3mFCVVxYERmNWEx\">More Info </a>","location":"FH","startDatetime":"2023-06-20T13:00:00Z","endDatetime":"2023-06-20T15:00:00Z","timestamp":"2023-04-30T22:11:16Z"},{"summary":"<b>Daily Free Pancakes</b> Tony Olsen [FH]","description":"For Whom: People who love socioeconomic freedom ... and free pancakes!\nDescription: Come and enjoy free pancakes and learn more about the Freedom Haven project.\nOrganizer: Tony Olsen, Tony has the ingredients, equipment, time, and willingness to make the pancakes.. <a href=\"https://freedomhaven.org/\"> Website </a>. <a href=\"https://freedomhaven.org/Tony/FreedomHaven/20220707-TheFreedomYouSeek-V16-4Kx5K-Opague.png\"> Image </a>\nWhen: Wed, 9:00A (120m)\nWhere: FH: The Freedom Haven project, RV35\nNote: Pancakes, syrup, butter, and margarine will be provided. \n<a href=\"https://t.me/+b3mFCVVxYERmNWEx\">More Info </a>","location":"FH","startDatetime":"2023-06-21T13:00:00Z","endDatetime":"2023-06-21T15:00:00Z","timestamp":"2023-04-30T22:11:16Z"},{"summary":"<b>Daily Free Pancakes</b> Tony Olsen [FH]","description":"For Whom: People who love socioeconomic freedom ... and free pancakes!\nDescription: Come and enjoy free pancakes and learn more about the Freedom Haven project.\nOrganizer: Tony Olsen, Tony has the ingredients, equipment, time, and willingness to make the pancakes.. <a href=\"https://freedomhaven.org/\"> Website </a>. <a href=\"https://freedomhaven.org/Tony/FreedomHaven/20220707-TheFreedomYouSeek-V16-4Kx5K-Opague.png\"> Image </a>\nWhen: Thu, 9:00A (120m)\nWhere: FH: The Freedom Haven project, RV35\nNote: Pancakes, syrup, butter, and margarine will be provided. \n<a href=\"https://t.me/+b3mFCVVxYERmNWEx\">More Info </a>","location":"FH","startDatetime":"2023-06-22T13:00:00Z","endDatetime":"2023-06-22T15:00:00Z","timestamp":"2023-04-30T22:11:16Z"},{"summary":"<b>Daily Free Pancakes</b> Tony Olsen [FH]","description":"For Whom: People who love socioeconomic freedom ... and free pancakes!\nDescription: Come and enjoy free pancakes and learn more about the Freedom Haven project.\nOrganizer: Tony Olsen, Tony has the ingredients, equipment, time, and willingness to make the pancakes.. <a href=\"https://freedomhaven.org/\"> Website </a>. <a href=\"https://freedomhaven.org/Tony/FreedomHaven/20220707-TheFreedomYouSeek-V16-4Kx5K-Opague.png\"> Image </a>\nWhen: Fri, 9:00A (120m)\nWhere: FH: The Freedom Haven project, RV35\nNote: Pancakes, syrup, butter, and margarine will be provided. \n<a href=\"https://t.me/+b3mFCVVxYERmNWEx\">More Info </a>","location":"FH","startDatetime":"2023-06-23T13:00:00Z","endDatetime":"2023-06-23T15:00:00Z","timestamp":"2023-04-30T22:11:16Z"},{"summary":"<b>Daily Free Pancakes</b> Tony Olsen [FH]","description":"For Whom: People who love socioeconomic freedom ... and free pancakes!\nDescription: Come and enjoy free pancakes and learn more about the Freedom Haven project.\nOrganizer: Tony Olsen, Tony has the ingredients, equipment, time, and willingness to make the pancakes.. <a href=\"https://freedomhaven.org/\"> Website </a>. <a href=\"https://freedomhaven.org/Tony/FreedomHaven/20220707-TheFreedomYouSeek-V16-4Kx5K-Opague.png\"> Image </a>\nWhen: Sat, 9:00A (120m)\nWhere: FH: The Freedom Haven project, RV35\nNote: Pancakes, syrup, butter, and margarine will be provided. \n<a href=\"https://t.me/+b3mFCVVxYERmNWEx\">More Info </a>","location":"FH","startDatetime":"2023-06-24T13:00:00Z","endDatetime":"2023-06-24T15:00:00Z","timestamp":"2023-04-30T22:11:16Z"},{"summary":"<b>Daily Free Pancakes</b> Tony Olsen [FH]","description":"For Whom: People who love socioeconomic freedom ... and free pancakes!\nDescription: Come and enjoy free pancakes and learn more about the Freedom Haven project.\nOrganizer: Tony Olsen, Tony has the ingredients, equipment, time, and willingness to make the pancakes.. <a href=\"https://freedomhaven.org/\"> Website </a>. <a href=\"https://freedomhaven.org/Tony/FreedomHaven/20220707-TheFreedomYouSeek-V16-4Kx5K-Opague.png\"> Image </a>\nWhen: Sun, 1:00P (120m)\nWhere: FH: The Freedom Haven project, RV35\nNote: Pancakes, syrup, butter, and margarine will be provided. \n<a href=\"https://t.me/+b3mFCVVxYERmNWEx\">More Info </a>","location":"FH","startDatetime":"2023-06-25T17:00:00Z","endDatetime":"2023-06-25T19:00:00Z","timestamp":"2023-04-30T22:11:16Z"},{"summary":"<b>Buying Your First New Hampshire Home</b> Franz Honer, Diane Kelley [REAL]","description":"For Whom: Potential Home Buyers\nDescription: Never owned a home, but you might want to? This is the place to get some info on what to consider. Our panelists will talk about how to choose a property, how to finance it, and answer any questions you might have. \nPanelist: Franz Honer, With over twenty years experience in the real estate industry, as well as an extensive background in software engineering and, Franz's passion is helping fellow liberty lovers achieve their real estate goals. Franz moved to New Hampshire in 2008 and enjoys sharing his knowledge of the Live Free or Die state, local communities, and housing considerations. . <a href=\"http://realestate603.com\"> Website </a>\nPanelist: Diane Kelley, By way of California, the Live Free or Die state is Diane’s dream come true, from her historic 1798 home to her role serving as a New Hampshire State Representative. She finds passion in helping people make the move and the joy they experience when they start each day in a home of their own. As an investment property owner, she especially enjoys sharing her experience to help her clients achieve their financial goals.. <a href=\"https://makenhyourhome.com/\"> Website </a>\nWhen: Wed, 3:00P _(60m)\nWhere: REAL: Real Estate 603, RV153","location":"REAL","startDatetime":"2023-06-21T19:00:00Z","endDatetime":"2023-06-21T20:00:00Z","timestamp":"2023-04-30T22:11:16Z"},{"summary":"<b>Nomadic Porcupines: RV Living!</b> Franz Honer, Diane Kelley [REAL]","description":"For Whom: Anyone interested in living in an RV either part-time or full-time, or already is and wants to talk shop\nDescription: An informal roundtable discussion on RV living. If you’re interested in the idea of living in an RV, or would like to share your experiences, stop on by! \n. . . Diane and Franz love to talk about RVs, from how they choose their Class C and travel trailer, respectively, the unexpected things you may not be thinking about until you become a serious RVer, and the exciting adventure of it all. Bring your questions and stories!\n. . . Hosted at the Alt Real Estate Hub (“REAL”) on RV (“lower”) site number 153.\nLeader: Franz Honer, With over twenty years experience in the real estate industry, as well as an extensive background in software engineering and internet marketing, Franz's passion is helping fellow liberty lovers achieve their real estate goals. Franz moved to New Hampshire in 2008 and enjoys sharing his knowledge of the Live Free or Die state. . <a href=\"http://realestate603.com\"> Website </a>\nPanelist: Diane Kelley, By way of California, the Live Free or Die state is Diane’s dream come true, from her historic 1798 home to her role serving as a New Hampshire State Representative. She finds passion in helping people make the move and the joy they experience when they start each day in a home of their own. As an investment property owner, she especially enjoys sharing her experience to help her clients achieve their financial goals.\nWhen: Mon, 3:00P _(60m)\nWhere: REAL: Real Estate 603, RV153","location":"REAL","startDatetime":"2023-06-19T19:00:00Z","endDatetime":"2023-06-19T20:00:00Z","timestamp":"2023-04-30T22:11:16Z"},{"summary":"<b>Clay Monster Battle Royale</b> David Wilson [Game]","description":"For Whom: Are you creative? Are you competitive? Do you have some pent up frustration?  This one is for you. \nDescription: Create a clay monster and pit it against others' creations in a Battle Royale\nFacilitator: David Wilson, David has been leading Clay-O-Rama battles for 30 years\nWhen: Fri, 2:00P _(90m)\nWhere: Game: Gamers Lounge, Rv108\nNote: Ages 12 and up recommended.\n<a href=\"https://media.wizards.com/2017/dnd/dragon/D15_Clay-O-Rama.pdf\">More Info </a>","location":"Game","startDatetime":"2023-06-23T18:00:00Z","endDatetime":"2023-06-23T19:30:00Z","timestamp":"2023-04-30T22:11:16Z"},{"summary":"<b>Tiny Homes for Retirees, Preppers, & Grads</b> Marco Capaldi [TnyH]","description":"For Whom: Retiring, Homesteading, Prepping, or in Debt\nDescription: Expert Talk\nSpeaker: Marco Capaldi, Marco Capaldi 3rd yr Porcfest attendee and a business owner has helped over 30 people to date downsize to one level luxurious living. Inventor and Designer Tomek Sadowski a native of Poland is the OEM in Poland of a line of Galvanized Steel Framed Tiny Homes all built to high EU energy standards with radiant flooring and customizable modern materials and solar, wind, and battery options. These are designed with adding liveable space in stages and there is a free standing home office and spa model that can be added to an existing home on telescoping piers and in one day without molesting your yard and landscaping. Tom and Marco are committed to hiring Ukranian displaced workers in Poland to build these homes. Our system of install and one day delivery is award winning. Also our prices are as low as $250 a sq ft 1/3 of modern building costs. We also furnish them through our subsidiary as well as provide all appliances in our base package.\n. <a href=\"http://www.vitayhomes.com\"> Website </a>\nWhen: Tue, 10:00A (120m)\nWhere: TnyH: Tiny Homes, Granny Podds, & ADU site, RV198\nNote: Connect to Feasibility Study Experts and our Host supplier. Come kick the radiant tile.\n<a href=\"http://www.vitayhomes.com\">More Info </a>","location":"TnyH","startDatetime":"2023-06-20T14:00:00Z","endDatetime":"2023-06-20T16:00:00Z","timestamp":"2023-04-30T22:11:16Z"},{"summary":"<b>How to build a ghost gun (Glock handguns)</b> Andrew Noveske [420]","description":"For Whom: Anyone wanting to learn how to build an unserialized, unregistered, and unknown firearm. number comeandbuildit\nDescription: So you wanna build a ghost gun? Bring all the necessary parts to this free workshop and you will take home your very own ghosty.\n\nWorkshop will be hosted by Andrew Noveske at Somali Stash House/Vice City, site RV173, 420 on the map, on Thursday June 22nd at 6pm\nHost: Andrew Noveske, This will be Andrews third year doing gun builder workshops at Porcfest. Entertaining and informative with a vast knowledge of firearms.\nWhen: Thu, 5:00P _(90m)\nWhere: 420: Somali Stash House presents: Vice City, R173\nNote: Parts needed-\nPolymer80 or competitor 80% Glock style frame\nLower parts kit\nBarrel\nUpper parts kit\nSlide to match the frame\n\nTools will be available, but feel free to bring your own drill/dremel.","location":"420","startDatetime":"2023-06-22T21:00:00Z","endDatetime":"2023-06-22T22:30:00Z","timestamp":"2023-04-30T22:11:16Z"},{"summary":"<b>Saturday Smokeout and donation drive for number freeross</b>  [420]","description":"For Whom: Anyone who wants to smoke a very large cone and donate to number freeross\nDescription: We will be filling a giant cone and puff puff passing at 4:20PM on Saturday doing a final drive for number freeross donations! Music and smoke, come hang out and donate to number freeross. Somali Stash House RV173, 420 on the map\nHost: \nWhen: Sat, 4:20P _(60m)\nWhere: 420: Somali Stash House presents: Vice City, R173\nNote: Smoking out and doing a final collection for number freeross. At 5:30, donations will be counted and sent to number freeross","location":"420","startDatetime":"2023-06-24T20:20:00Z","endDatetime":"2023-06-24T21:20:00Z","timestamp":"2023-04-30T22:11:16Z"},{"summary":"<b>Field Trip to Littleton</b> Franz Honer, Calvin Beaulier [Office]","description":"For Whom: Anyone who wants to see a bit of the North Country, likes to explore small town NH, or enjoys a bite to eat and a good beer.\nDescription: A casual jaunt to nearby Littleton, NH, a charming small town about 25 min from Rogers. Walk around downtown... grab lunch at Schilling's Brewery Pub... dip your feet in the Ammonoosuc River... visit the world's longest candy counter... check out \"Just L\" for some vintage finds... stock up on groceries and supplies. I'll be stopping at the Littleton Food Coop on the way back, a great place to find local and natural foods.\n\n***Meet at 11am sharp in front of the Rogers office*** \nIf you have your own wheels, excellent, or if you're visiting from afar and need a ride, we'll do our best to fit you in with someone who has room.\nOrganizer: Franz Honer, With over twenty years experience in the real estate industry, as well as an extensive background in software engineering and internet marketing, Franz's passion is helping fellow liberty lovers achieve their real estate goals. Franz moved to New Hampshire in 2008 and enjoys sharing his knowledge of the Live Free or Die state and the homebuying process. . <a href=\"http://realestate603.com\"> Website </a>\nHost: Calvin Beaulier, Calvin Beaulier is a father, husband, and attorney, and a proud resident of Littleton, New Hampshire. <a href=\"https://primemls.com/profile/614862\"> Website </a>\nWhen: Wed, 11:00A (180m)\nWhere: Office: Rogers Office, Parking Lot","location":"Office","startDatetime":"2023-06-21T15:00:00Z","endDatetime":"2023-06-21T18:00:00Z","timestamp":"2023-04-30T22:11:16Z"},{"summary":"<b>Campground Tour Monday</b> Mikey [Office]","description":"For Whom: Newbies\nDescription: Join Mikey for the third annual campground tours. Rogers is a massive and intimidating place, but your guide will be helping you get situated at his 9th Porcfest. Learn about the history of the campground, and Porcfest itself, before we venture on a 45 minute trek of the main areas. Get your navigation systems ready and prepare to make new friends!\nTour Guide: Mikey\nWhen: Mon, 6:00P _(60m)\nWhere: Office: Rogers Office, Parking Lot","location":"Office","startDatetime":"2023-06-19T22:00:00Z","endDatetime":"2023-06-19T23:00:00Z","timestamp":"2023-04-30T22:11:16Z"},{"summary":"<b>Campgroung Tour Tuesday</b> Mikey [Office]","description":"For Whom: Newbies\nDescription: Join Mikey for the third annual campground tours. Rogers is a massive and intimidating place, but your guide will be helping you get situated at his 9th Porcfest. Learn about the history of the campground, and Porcfest itself, before we venture on a 45 minute trek of the main areas. Get your navigation systems ready and prepare to make new friends!\nTour Guide: Mikey\nWhen: Tue, 10:00A _(60m)\nWhere: Office: Rogers Office, Parking Lot","location":"Office","startDatetime":"2023-06-20T14:00:00Z","endDatetime":"2023-06-20T15:00:00Z","timestamp":"2023-04-30T22:11:16Z"},{"summary":"<b>Campground Tour Wednesday</b> Mikey [Office]","description":"For Whom: Newbies\nDescription: Join Mikey for the third annual campground tours. Rogers is a massive and intimidating place, but your guide will be helping you get situated at his 9th Porcfest. Learn about the history of the campground, and Porcfest itself, before we venture on a 45 minute trek of the main areas. Get your navigation systems ready and prepare to make new friends!\nTour Guide: Mikey\nWhen: Wed, 10:00A _(60m)\nWhere: Office: Rogers Office, Parking Lot","location":"Office","startDatetime":"2023-06-21T14:00:00Z","endDatetime":"2023-06-21T15:00:00Z","timestamp":"2023-04-30T22:11:16Z"}]